Repository: nelson-lang/nelson
Catalog: locale/*/LC_MESSAGES/nelson.po
Languages: fr_fr

source: ylabel needs at least one argument.
fr_fr: ylabel a besoin d'au moins un argument.

source: zlabel needs at least one argument.
fr_fr: zlabel a besoin d'au moins un argument.

source: plot3 display of 3-D helix
fr_fr: Affichage plot3 de l'hélice 3D

source: This is the default error string.
fr_fr: Ceci est la chaîne d'erreur par défaut.

source: Error Dialog
fr_fr: Boîte de dialogue d'erreur

source: This is the default help string.
fr_fr: Ceci est la chaîne d'aide par défaut.

source: Help Dialog
fr_fr: Boîte de dialogue d'aide

source: This is the default warning string.
fr_fr: Ceci est la chaîne d'avertissement par défaut.

source: Wrong value for #3 argument. A valid icon or mode expected.
fr_fr: Mauvaise valeur pour l'argument #3. Une icône ou un mode valide est attendu.

source: Wrong value for #4 argument. A valid mode expected.
fr_fr: Mauvaise valeur pour l'argument #4. Un mode valide est attendu.

source: Second argument must start with /.
fr_fr: Le deuxième argument doit commencer par /.

source: Indexing help files:
fr_fr: Indexation des fichiers d'aide :

source: helpproject.qhp is missing.
fr_fr: helpproject.qhp est manquant.

source: Expecting statement list or function definition
fr_fr: Attente de la liste d'instructions ou de la définition de la fonction

source: Function %s has already been declared within this scope.
fr_fr: La fonction %s a déjà été déclarée dans cette portée.

source: A must be a 2-D numeric or logical matrix.
fr_fr: A doit être une matrice numérique ou logique 2-D.

source: TYPE must be lower or upper.
fr_fr: TYPE doit être inférieur ou supérieur.

source: Input must be square.
fr_fr: L'entrée doit être carrée.

source: A must be a square numeric matrix.
fr_fr: A doit être une matrice numérique carrée.

source: Difference order N must be a positive integer scalar.
fr_fr: L'ordre de différence N doit être un scalaire entier positif.

source: LOWER must be non-negative integers.
fr_fr: LOWER doit être des entiers non négatifs.

source: UPPER must be non-negative integers.
fr_fr: UPPER doit être des entiers non négatifs.

source: Input argument must be a real numeric scalar tolerance
fr_fr: L'argument d'entrée doit être une tolérance scalaire numérique réelle.

source: First input must be a column vector of length 2.
fr_fr: Le premier argument d'entrée doit être un vecteur colonne de longueur 2.

source: #2 argument: characters expected.
fr_fr: Argument #2 : caractères attendus.

source: #3 argument: Logical scalar expected.
fr_fr: Argument #3 : scalaire logique attendu.

source: module name or existing directory installed is expected.
fr_fr: Le nom du module ou le répertoire existant installé est attendu.

source: A valid git url or local directory expected.
fr_fr: Une URL git valide ou un répertoire local est attendu.

source: filename extension .nmz expected.
fr_fr: L'extension de fichier .nmz est attendue.

source: module-lock.json is missing.
fr_fr: module-lock.json est manquant.

source: %s already installed.
fr_fr: %s est déjà installé.

source: %s not installed.
fr_fr: %s n'est pas installé.

source: platform not supported.
fr_fr: plateforme non prise en charge.

source: Valid module repository expected.
fr_fr: Un référentiel de module valide est attendu.

source: Visual studio detected and configured to be used with Nelson.
fr_fr: Visual Studio détecté et configuré pour être utilisé avec Nelson.

source: An C/C++ compiler is required by %s
fr_fr: Un compilateur C/C++ est requis par %s

source: Platform not supported: %s
fr_fr: Plateforme non prise en charge : %s

source: Invalid type in platforms
fr_fr: Type invalide dans les plateformes

source: loader.m is missing.
fr_fr: loader.m est manquant.

source: module.json is missing.
fr_fr: module.json est manquant.

source: %s already loaded.
fr_fr: %s est déjà chargé.

source: A valid module name expected.
fr_fr: Un nom de module valide est attendu.

source: nmm required webtools module.
fr_fr: nmm requiert le module webtools.

source: nmm required file_archiver module.
fr_fr: nmm requiert le module file_archiver.

source: nmm required json module.
fr_fr: module json requis pour nmm.

source: Wrong type for argument #1: MPI_Comm expected.
fr_fr: Type incorrect pour l'argument n°1 : MPI_Comm attendu.

source: #2 argument: integer value expected.
fr_fr: Argument n°2 : valeur entière attendue.

source: A existing filename expected.
fr_fr: Un nom de fichier existant est attendu.

source: An .m filename extension expected.
fr_fr: Une extension de fichier .m est attendue.

source: Dimension argument must be a real, positive, integer scalar.
fr_fr: L'argument de dimension doit être un scalaire entier réel et positif.

source: Dimensions of arrays being concatenated are not consistent.
fr_fr: Les dimensions des tableaux concaténés ne sont pas cohérentes.

source: Size mismatch on arguments to arithmetic operator >=
fr_fr: Taille non conforme des arguments pour l'opérateur arithmétique >=

source: Size mismatch on arguments to arithmetic operator <=
fr_fr: Taille non conforme des arguments pour l'opérateur arithmétique <=

source: Argument must be a vector or a square matrix.
fr_fr: L'argument doit être un vecteur ou une matrice carrée.

source: The first two inputs must have the same number of elements.
fr_fr: Les deux premières entrées doivent avoir le même nombre d'éléments.

source: First argument must be a vector.
fr_fr: Le premier argument doit être un vecteur.

source: Second argument must be a square matrix.
fr_fr: Le deuxième argument doit être une matrice carrée.

source: Input must be a vector.
fr_fr: L'entrée doit être un vecteur.

source: Input to roots function must not contain NaN or Inf.
fr_fr: L'entrée de la fonction roots ne doit pas contenir NaN ou Inf.

source: M must be a positive integer.
fr_fr: M doit être un entier positif.

source: "periodic" or "symmetric" expected.
fr_fr: "périodique" ou "symétrique" attendu.

source: library slicot not loaded.
fr_fr: La bibliothèque slicot n'est pas chargée.

source: Please use speye(n), speye(m, n) or speye([m, n]).
fr_fr: Veuillez utiliser speye(n), speye(m, n) ou speye([m, n]).

source: ND-sparse arrays are not supported.
fr_fr: Les tableaux ND-sparse ne sont pas pris en charge.

source: Length must 3 in the dimension in which the cross product expected.
fr_fr: La longueur doit être de 3 dans la dimension où le produit vectoriel est attendu.

source: At least one dimension of length 3 expected.
fr_fr: Au moins une dimension de longueur 3 est attendue.

source: A and B must be single or double.
fr_fr: A et B doivent être de type single ou double.

source: A and B must be same size.
fr_fr: A et B doivent avoir la même taille.

source: Wrong value for input argument #1: a nonnegative integer expected.
fr_fr: Valeur incorrecte pour l'argument d'entrée n°1 : un entier non négatif est attendu.

source: Wrong value for input argument #1: maximum value of n allowed is 2^32.
fr_fr: Valeur incorrecte pour l'argument d'entrée n°1 : la valeur maximale autorisée pour n est 2^32.

source: linear method expected.
fr_fr: Une méthode linéaire est attendue.

source: Peaks
fr_fr: Sommet

source: Wrong value for #3 argument: 0 or 1 expected.
fr_fr: Valeur incorrecte pour l'argument n°3 : 0 ou 1 est attendu.

source: arguments #1 and #2 must have the same length.
fr_fr: Les arguments n°1 et n°2 doivent avoir la même longueur.

source: An existing filename expected.
fr_fr: Un nom de fichier existant est attendu.

source: file format not a supported file.
fr_fr: Format de fichier non pris en charge.

source: version not a supported file.
fr_fr: Version non prise en charge.

source: Wrong type for argument #1. string expected.
fr_fr: Type incorrect pour l'argument n°1 : une chaîne de caractères est attendue.

source: not yet implemented.
fr_fr: Pas encore implémenté.

source: Impossible to open:
fr_fr: Impossible d'ouvrir :

source: Wrong value for #3: IgnoreCase expected.
fr_fr: Valeur incorrecte pour l'argument n°3 : IgnoreCase est attendu.

source: <--CHECK REF--> tag expected.
fr_fr: Balise <--CHECK REF--> attendue.

source: No valid module.
fr_fr: Aucun module valide.

source: Tests running on %d workers.
fr_fr: Tests en cours sur %d travailleurs.

source: Impossible to save results file.
fr_fr: Impossible de sauvegarder le fichier de résultats.

source: File:
fr_fr: Fichier :

source: Line:
fr_fr: Ligne :

source: reference diary expected.
fr_fr: Un journal de référence est attendu.

source: output res and ref are not equal.
fr_fr: Les sorties res et ref ne sont pas égales.

source: Cannot edit the directory:
fr_fr: Impossible de modifier le répertoire :

source: Date field must be a character vector or string scalar.
fr_fr: Le champ de date doit être un vecteur de caractères ou une chaîne de caractères.

source: Date field "%s" is invalid.
fr_fr: Le champ de date "%s" n'est pas valide.

source: M must be a month number from 1 to 12.
fr_fr: M doit être un numéro de mois de 1 à 12.

source: Y must be an integer year number.
fr_fr: Y doit être un numéro d'année entier.

source: Numeric input data must be real.
fr_fr: Les données d'entrée numériques doivent être réelles.

source: "long" or "short" option expected.
fr_fr: Option "long" ou "short" attendue.

source: "local" or "en_US" option expected.
fr_fr: Option "local" ou "en_US" attendue.

source: Sunday
fr_fr: Dimanche

source: Monday
fr_fr: Lundi

source: Tuesday
fr_fr: Mardi

source: Wednesday
fr_fr: Mercredi

source: Thursday
fr_fr: Jeudi

source: Friday
fr_fr: Vendredi

source: Saturday
fr_fr: Samedi

source: Mon
fr_fr: Lun

source: Tue
fr_fr: Mar

source: Wed
fr_fr: Mer

source: Thu
fr_fr: Jeu

source: Fri
fr_fr: Ven

source: Input must be single or double.
fr_fr: L'entrée doit être de type single ou double.

source: Value must be greater than %d.
fr_fr: La valeur doit être supérieure à %d.

source: Please define CHATGPT_API_KEY environment variable with your private API Key.
fr_fr: Veuillez définir la variable d'environnement CHATGPT_API_KEY avec votre clé API privée.

source: Your question to ChatGPT?
fr_fr: Votre question à ChatGPT ?

source: %s is not a recognized parameter.
fr_fr: %s n'est pas un paramètre reconnu.

source: weboptions must be the last argument.
fr_fr: weboptions doit être le dernier argument.

source: Invalid type for #1 input argument: char or string expected.
fr_fr: Type invalide pour l'argument d'entrée n°1 : char ou string est attendu.

source: Invalid #3 Argument: weboptions expected.
fr_fr: Argument invalide n°3 : weboptions est attendu.

source: unmanaged case.
fr_fr: Cas non géré.

source: Timeout was reached
fr_fr: Le délai d'attente a été atteint.

source: help build failed.
fr_fr: La construction de l'aide a échoué.

source: Update translations:
fr_fr: Mise à jour des traductions :

source: Translations up-to-date:
fr_fr: Traductions à jour :

source: update .po for:
fr_fr: mettre à jour .po pour :

source: Number of undocumented functions
fr_fr: Nombre de fonctions non documentées

source: Number of existing help files
fr_fr: Nombre de fichiers d'aide existants

source: Congratulations, all functions are documented.
fr_fr: Félicitations, toutes les fonctions sont documentées.

source: Summary:
fr_fr: Résumé :

source: Passed:
fr_fr: Réussis :

source: Failed:
fr_fr: Échoués :

source: Skipped:
fr_fr: Ignorés :

source: Tests time:
fr_fr: Temps des tests :

source: Total time:
fr_fr: Temps total :

source: Assertion failed: expected (%ls) and computed (%ls) values are different.
fr_fr: Échec de l'assertion : les valeurs attendues (%ls) et calculées (%ls) sont différentes.

source: Assertion failed: expected (%s) and computed (%s) values are different.
fr_fr: Échec de l'assertion : les valeurs attendues (%s) et calculées (%s) sont différentes.

source: Wrong value for the #1 argument, 'fullpathext' or 'fullpath' expected.
fr_fr: Mauvaise valeur pour l'argument #1, 'fullpathext' ou 'fullpath' attendu.

source: Function returned a non-scalar result.
fr_fr: La fonction a renvoyé un résultat non scalaire.

source: Conversion to 'struct' to 'function_handle' is not possible.
fr_fr: La conversion de 'struct' à 'function_handle' n'est pas possible.

source: '-completenames' expected or a scalar integer value required.
fr_fr: '-completenames' attendu ou une valeur entière scalaire requise.

source: Wrong size for the argument #1. Scalar expected.
fr_fr: Mauvaise taille pour l'argument #1. Scalaire attendu.

source: Wrong type for the argument #1. 'Scalar string or row char vector expected.
fr_fr: Mauvais type pour l'argument #1. 'Chaîne scalaire ou vecteur de caractères ligne' attendu.

source: Wrong type for the argument #2. 'Scalar string or row char vector expected.
fr_fr: Mauvais type pour l'argument #2. 'Chaîne scalaire ou vecteur de caractères ligne' attendu.

source: The first argument must be 'like'.
fr_fr: Le premier argument doit être 'like'.

source: Attempt to convert to an unimplemented sparse type.
fr_fr: Tentative de conversion vers un type sparse non implémenté.

source: A finite value is expected.
fr_fr: Une valeur finie est attendue.

source: A real integer is expected.
fr_fr: Un entier réel est attendu.

source: A real positive integer is expected.
fr_fr: Un entier réel positif est attendu.

source: Only one unknown dimension is allowed.
fr_fr: Une seule dimension inconnue est autorisée.

source: Wrong value for the argument #2. 'r' or 'c' expected.
fr_fr: Mauvaise valeur pour l'argument #2. 'r' ou 'c' attendu.

source: Wrong type for the argument #2. Numeric values expected.
fr_fr: Mauvais type pour l'argument #2. Des valeurs numériques sont attendues.

source: Wrong size for the argument #2. Row vector or scalar expected.
fr_fr: Mauvaise taille pour l'argument #2. Vecteur ligne ou scalaire attendu.

source: An array of integer values, 0 <= D <= flintmax, is expected.
fr_fr: Un tableau de valeurs entières, 0 <= D <= flintmax, est attendu.

source: Unknown engine.
fr_fr: Moteur inconnu.

source: File to execute in a new process.
fr_fr: Fichier à exécuter dans un nouveau processus.

source: Language used in the current session.
fr_fr: Langue utilisée dans la session actuelle.

source: Socket.io URI address.
fr_fr: Adresse URI Socket.io.

source: Opens files in a text editor.
fr_fr: Ouvre les fichiers dans un éditeur de texte.

source: Wrong value for the timeout option.
fr_fr: Mauvaise valeur pour l'option de délai.

source: Error: Could not find the function NtOpenFile in the library ntdll.dll.
fr_fr: Erreur : Impossible de trouver la fonction NtOpenFile dans la bibliothèque ntdll.dll.

source: Numbers representing integers greater than or equal to flintmax might not be represented exactly as double-precision floating-point values.
fr_fr: Les nombres représentant des entiers supérieurs ou égaux à flintmax pourraient ne pas être représentés exactement en tant que valeurs de double précision en virgule flottante.

source: Function not found:
fr_fr: Fonction introuvable :

source: Malformed floating-point constant.
fr_fr: Constante à virgule flottante mal formée.

source: Malformed unsigned integer constant.
fr_fr: Constante d'entier non signé mal formée.

source: Malformed unsigned integer constant with unary operator '-'.
fr_fr: Constante d'entier non signé mal formée avec l'opérateur unaire '-'.

source: The second argument must be 'noperm'.
fr_fr: Le deuxième argument doit être 'noperm'.

source: Input must be 2-D.
fr_fr: L'entrée doit être en 2D.

source: Use balance(full(S)).
fr_fr: Utilisez balance(full(S)).

source: The first argument must be single or double.
fr_fr: Le premier argument doit être de type single ou double.

source: The matrix must be square.
fr_fr: La matrice doit être carrée.

source: Input to BALANCE must not contain NaN or Inf.
fr_fr: L'entrée de BALANCE ne doit pas contenir NaN ou Inf.

source: Invalid arguments for LAPACKE_dgebal.
fr_fr: Arguments invalides pour LAPACKE_dgebal.

source: File not found: %s
fr_fr: Fichier introuvable : %s

source: The second argument must be a structure with two fields whose names are 'type' and 'subs'.
fr_fr: Le deuxième argument doit être une structure avec deux champs dont les noms sont 'type' et 'subs'.

source: No support for index chaining.
fr_fr: Pas de support pour le chaînage d'index.

source: 'subs' field must be a cell array or string.
fr_fr: Le champ 'subs' doit être un tableau de cellules ou une chaîne de caractères.

source: The first argument must be a struct.
fr_fr: Le premier argument doit être une structure.

source: Illegal indexing structure argument: type '.', '{}', or '()' expected.
fr_fr: Argument de structure d'indexation illégal : type '.', '{}', ou '()' attendu.

source: The second argument must be a single string.
fr_fr: Le deuxième argument doit être une chaîne unique.

source: Wrong file prefix 'test_' or 'bug_' expected.
fr_fr: Préfixe de fichier incorrect, 'test_' ou 'bug_' attendu.

source: A combination of '%s' and '%s' options is not supported.
fr_fr: Une combinaison d'options '%s' et '%s' n'est pas prise en charge.

source: Wrong value for #1 argument. 'a' must be higher than 'b' ([a, b]).
fr_fr: Mauvaise valeur pour l'argument #1. 'a' doit être supérieur à 'b' ([a, b]).

source: Wrong value for #2 argument. 'a' must be higher than 'b' ([a, b]).
fr_fr: Mauvaise valeur pour l'argument #2. 'a' doit être supérieur à 'b' ([a, b]).

source: Warning! One or more outputs not assigned in the call.
fr_fr: Attention ! Un ou plusieurs résultats non assignés dans l'appel.

source: Check for incorrect argument data type or missing argument in the call to function '%s'.
fr_fr: Vérifiez le type de données incorrect de l'argument ou l'argument manquant dans l'appel de la fonction '%s'.

source: Your error message.
fr_fr: Votre message d'erreur.

source: Invalid syntax: s, z, p, q expected.
fr_fr: Syntaxe invalide : s, z, p, q attendu.

source: Invalid syntax: s expected.
fr_fr: Syntaxe invalide : s attendu.

source: Sample time: %.4f %s
fr_fr: Temps d'échantillonnage : %.4f %s

source: Discrete-time state-space model.
fr_fr: Modèle d'espace d'état discret.

source: Continuous-time state-space model.
fr_fr: Modèle d'espace d'état continu.

source: State-space model with %d outputs, %d inputs, and %d states.
fr_fr: Modèle d'espace d'état avec %d sorties, %d entrées et %d états.

source: Second argument must be a positive integer.
fr_fr: Le deuxième argument doit être un entier positif.

source: Ts property should be either a positive scalar, 0, or -1 to indicate that it is unspecified.
fr_fr: La propriété Ts doit être un scalaire positif, 0, ou -1 pour indiquer qu'elle n'est pas spécifiée.

source: Supported LTI model expected.
fr_fr: Modèle LTI pris en charge attendu.

source: Matrix A must be square.
fr_fr: La matrice A doit être carrée.

source: The number of rows in matrices A and B must be equal.
fr_fr: Le nombre de lignes des matrices A et B doit être égal.

source: Matrices A and C should have an identical number of columns.
fr_fr: Les matrices A et C doivent avoir un nombre identique de colonnes.

source: Matrices B and D should have an identical number of columns.
fr_fr: Les matrices B et D doivent avoir un nombre identique de colonnes.

source: The number of rows in matrices C and D must be equal.
fr_fr: Le nombre de lignes des matrices C et D doit être égal.

source: Matrices A and E should have an identical size.
fr_fr: Les matrices A et E doivent avoir une taille identique.

source: Empty transfer function.
fr_fr: Fonction de transfert vide.

source: From input %d to output:
fr_fr: De l'entrée %d à la sortie :

source: Discrete-time transfer function.
fr_fr: Fonction de transfert en temps discret.

source: Continuous-time transfer function.
fr_fr: Fonction de transfert en temps continu.

source: Dimensions of systems output are incompatible.
fr_fr: Les dimensions de la sortie des systèmes sont incompatibles.

source: SISO LTI model expected.
fr_fr: Modèle SISO LTI attendu.

source: SISO lti expected.
fr_fr: SISO lti attendu.

source: Transfer function with %d outputs and %d inputs.
fr_fr: Fonction de transfert avec %d sorties et %d entrées.

source: No property of the class %s matches the identifier %s.
fr_fr: Aucune propriété de la classe %s ne correspond à l'identifiant %s.

source: Unsupported parameter: %s.
fr_fr: Paramètre non pris en charge : %s.

source: Invalid syntax.
fr_fr: Syntaxe invalide.

source: Numerator and Denominator must have compatible sizes.
fr_fr: Le numérateur et le dénominateur doivent avoir des tailles compatibles.

source: Dimensions of systems input are incompatible.
fr_fr: Les dimensions de l'entrée des systèmes sont incompatibles.

source: Bode without input argument does not return output arguments.
fr_fr: Bode sans argument d'entrée ne renvoie pas d'arguments de sortie.

source: Call bode using the following command:
fr_fr: Appelez bode en utilisant la commande suivante :

source: Invalid line specification.
fr_fr: Spécification de ligne invalide.

source: LTI model expected.
fr_fr: Modèle LTI attendu.

source: Bode Diagram
fr_fr: Diagramme de Bode

source: Frequency [rad/s]
fr_fr: Fréquence [rad/s]

source: Frequency interval must be specified as {wmin, wmax} real.
fr_fr: L'intervalle de fréquence doit être spécifié comme {wmin, wmax} réel.

source: Real expected.
fr_fr: Réel attendu.

source: Ensure that the data type of the argument is correct in the function call to %s.
fr_fr: Assurez-vous que le type de données de l'argument est correct dans l'appel de la fonction %s.

source: An expression after +.
fr_fr: Une expression après +.

source: First input argument must be a cell array.
fr_fr: Le premier argument d'entrée doit être un tableau de cellules.

source: Cell with cells or object not supported.
fr_fr: Cellule avec des cellules ou objet non pris en charge.

source: Size mismatch on arguments to arithmetic operator.
fr_fr: Taille incompatible sur les arguments de l'opérateur arithmétique.

source: Cmake not found.
fr_fr: Cmake non trouvé.

source: The number of outputs should match the number of inputs.
fr_fr: Le nombre de sorties doit correspondre au nombre d'entrées.

source: At least two arguments.
fr_fr: Au moins deux arguments.

source: An even number of arguments.
fr_fr: Un nombre pair d'arguments.

source: Second argument must be positive.
fr_fr: Le deuxième argument doit être positif.

source: Second argument must be a scalar or vector.
fr_fr: Le deuxième argument doit être un scalaire ou un vecteur.

source: Pcolor requires either X,Y,C, or C arguments.
fr_fr: Pcolor nécessite soit des arguments X, Y, C, soit C.

source: X and Y must have the same size.
fr_fr: X et Y doivent avoir la même taille.

source: Size of S must match X, Y.
fr_fr: La taille de S doit correspondre à celle de X, Y.

source: Number of colors in C must match the number of points in X.
fr_fr: Le nombre de couleurs dans C doit correspondre au nombre de points dans X.

source: Y must be a vector or matrix.
fr_fr: Y doit être un vecteur ou une matrice.

source: Lexical error Malformed unsigned integer constant with unary operator -.
fr_fr: Erreur lexicale : constante entière non signée mal formée avec l'opérateur unaire -.

source: A valid git URL or local directory expected.
fr_fr: Une URL Git valide ou un répertoire local est attendu.

source: Illegal indexing structure argument: type ., {} or () expected.
fr_fr: Argument illégal pour la structure d'indexation : type ., {} ou () attendu.

source: Input argument value must be non-negative.
fr_fr: La valeur de l'argument d'entrée doit être non négative.

source: Third argument must be a vector.
fr_fr: Le troisième argument doit être un vecteur.

source: Input argument #1 and #3 should have the same column size.
fr_fr: Les arguments d'entrée #1 et #3 doivent avoir la même taille de colonne.
