Repository: nelson-lang/nelson
Catalog: locale/*/LC_MESSAGES/nelson.po
Languages: fr_fr

source: Your variables are:
fr_fr: Vos variables sont :

source: Name
fr_fr: Nom

source: Size
fr_fr: Taille

source: Bytes
fr_fr: Octets

source: Class
fr_fr: Classe

source: Attributes
fr_fr: Attributs

source: help collection file not found.
fr_fr: Fichier de collection d'aide introuvable.

source: built-in have no comments.
fr_fr: Les fonctions intégrées n'ont pas de commentaires.

source: function does not exist.
fr_fr: La fonction n'existe pas.

source: built-in, mex, anonymous function have no comments.
fr_fr: Les fonctions intégrées, mex et anonymes n'ont pas de commentaires.

source: A valid function expected.
fr_fr: Une fonction valide est attendue.

source: Cannot not open destination file.
fr_fr: Impossible d'ouvrir le fichier de destination.

source: pdf file not generated.
fr_fr: Fichier pdf non généré.

source: pdf cannot generated in this engine mode.
fr_fr: Le mode moteur actuel ne permet pas de générer un fichier pdf.

source: Error markdown generation.
fr_fr: Erreur de génération du markdown.

source: Existing directory expected.
fr_fr: Un répertoire existant est attendu.

source: format not supported: 'help', 'html' or 'md' expected.
fr_fr: Format non pris en charge : 'help', 'html' ou 'md' attendu.

source: Errors:
fr_fr: Erreurs :

source: No error.
fr_fr: Pas d'erreur.

source: Warnings:
fr_fr: Avertissements :

source: Warning:
fr_fr: Avertissement :

source: No warning.
fr_fr: Pas d'avertissement.

source: Wrong value for argument #1: An existing .xml documentation file expected.
fr_fr: Mauvaise valeur pour l'argument n°1 : un fichier de documentation .xml existant est attendu.

source: Wrong type for argument #1: .xml documentation file expected.
fr_fr: Mauvais type pour l'argument n°1 : un fichier de documentation .xml est attendu.

source: HtmlFileToPdfFile not loaded.
fr_fr: HtmlFileToPdfFile non chargé.

source: HtmlStreamToPdfFile not loaded.
fr_fr: HtmlStreamToPdfFile non chargé.

source: Authors
fr_fr: Auteurs

source: Author
fr_fr: Auteur

source: Bibliography
fr_fr: Bibliographie

source: File does not exist:
fr_fr: Le fichier n'existe pas :

source: XmlDocDirectory not created.
fr_fr: XmlDocDirectory non créé.

source: line
fr_fr: ligne

source: not managed.
fr_fr: non géré.

source: missing.
fr_fr: manquant.

source: duplicated.
fr_fr: en double.

source: invalid.
fr_fr: non valide.

source: is empty.
fr_fr: est vide.

source: has child.
fr_fr: a un enfant.

source: has no child.
fr_fr: n'a pas d'enfant.

source: cannot allocate memory.
fr_fr: impossible d'allouer de la mémoire.

source: not supported.
fr_fr: non pris en charge.

source: malformed.
fr_fr: mal formé.

source: has no property.
fr_fr: n'a pas de propriété.

source: Examples
fr_fr: Exemples

source: Example
fr_fr: Exemple

source: History
fr_fr: Historique

source: Tag malformed.
fr_fr: Balise mal formée.

source: multiple chapter.xml definition.
fr_fr: définition multiple de chapter.xml.

source: Error in file:
fr_fr: Erreur dans le fichier :

source: chapter.xml file is missing.
fr_fr: Le fichier chapter.xml est manquant.

source: chapter.xml is missing.
fr_fr: Le fichier chapter.xml est manquant.

source: Input argument
fr_fr: Argument d'entrée

source: Output argument
fr_fr: Argument de sortie

source: See also
fr_fr: Voir aussi

source: Syntax
fr_fr: Syntaxe

source: Used function(s)
fr_fr: Fonction(s) utilisée(s)

source: Cannot create a parser context
fr_fr: Impossible de créer un contexte de parseur

source: History manager not enabled.
fr_fr: Gestionnaire d'historique non activé.

source: The name of an integer class expected.
fr_fr: Le nom d'une classe entière est attendu.

source: Conversion to '
fr_fr: Conversion en '

source: ' from sparse matrix is not possible.
fr_fr: La conversion à partir d'une matrice creuse en '

source: Invalid conversion from complex matrix to '
fr_fr: Conversion invalide d'une matrice complexe en '

source: ' matrix.
fr_fr: '. Matrice.

source: ' from graphics_object is not possible.
fr_fr: La conversion à partir d'un graphics_object en '

source: ' from handle is not possible.
fr_fr: La conversion à partir d'une poignée (handle) en '

source: ' from string is not possible.
fr_fr: La conversion à partir d'une chaîne de caractères en '

source: ' from cell is not possible.
fr_fr: La conversion à partir d'une cellule en '

source: ' from function_handle is not possible.
fr_fr: La conversion à partir d'une function_handle en '

source: ' for input arguments of type '
fr_fr: ' pour les arguments d'entrée de type '

source: ' from struct is not possible.
fr_fr: La conversion à partir d'une structure en '

source: Invalid conversion.
fr_fr: Conversion invalide.

source: Argument #1: 'max' expected.
fr_fr: Argument n°1 : 'max' attendu.

source: Argument #1: valid value expected.
fr_fr: Argument n°1 : une valeur valide est attendue.

source: Undefined variable or function:
fr_fr: Variable ou fonction non définie :

source: Function : '%s'.
fr_fr: Fonction : '%s'.

source: a valid function definition expected.
fr_fr: une définition de fonction valide est attendue.

source: Complex cannot be converted to logical.
fr_fr: Impossible de convertir un complexe en logique.

source: Unable to convert variable type to test for if/while statement
fr_fr: Impossible de convertir le type de variable pour tester l'instruction if/while

source: System error detected:
fr_fr: Erreur système détectée :

source: BUILTIN type not managed.
fr_fr: Type BUILTIN non géré.

source: System error detected: %s
fr_fr: Erreur système détectée : %s

source: System error detected: Error code: %s
fr_fr: Erreur système détectée : Code d'erreur : %s

source: Illegal use of the ':' operator
fr_fr: Utilisation illégale de l'opérateur ':'

source: Redefining permanent variable.
fr_fr: Redéfinition de la variable permanente.

source: Valid variable name expected.
fr_fr: Un nom de variable valide est attendu.

source: Finished stepping to %s, line %d
fr_fr: Fin du pas à pas jusqu'à %s, ligne %d

source: Encountered breakpoint at %s, line %d
fr_fr: Point d'arrêt rencontré à %s, ligne %d

source: %d of %d:
fr_fr: %d sur %d:

source: Execution of the future was cancelled.
fr_fr: L'exécution du futur a été annulée.

source: Invalid LHS.
fr_fr: LHS invalide.

source: Syntax error.
fr_fr: Erreur de syntaxe.

source: unable to resolve
fr_fr: impossible de résoudre

source: to a function call
fr_fr: à un appel de fonction

source: Undefined function
fr_fr: Fonction non définie

source: Insufficient number of outputs.
fr_fr: Nombre de sorties insuffisant.

source: Case not managed.
fr_fr: Cas non géré.

source: Function
fr_fr: Fonction

source: out-of-order argument /
fr_fr: argument / hors d'ordre

source: is not defined in the called function!
fr_fr: n'est pas défini dans la fonction appelée !

source: %d %s line %d
fr_fr: %d %s ligne %d

source: Unable to delete breakpoint %d
fr_fr: Impossible de supprimer le point d'arrêt %d

source: Unable to step the specified number of lines, execution will continue
fr_fr: Impossible de faire avancer le nombre spécifié de lignes, l'exécution continuera

source: Failed to set breakpoint in %s at line %d - breakpoint is disabled
fr_fr: Échec de la définition d'un point d'arrêt dans %s à la ligne %d - le point d'arrêt est désactivé

source: Undefined variable:
fr_fr: Variable non définie :

source: Undefined function:
fr_fr: Fonction non définie :

source: Cannot reindex an expression that returns multiple values.
fr_fr: Impossible de réindexer une expression qui renvoie plusieurs valeurs.

source: index expected.
fr_fr: index attendu.

source: Please define:
fr_fr: Veuillez définir :

source: dynamic field reference to structure requires a string argument
fr_fr: la référence dynamique à un champ de structure nécessite un argument de type chaîne

source: a valid script expected.
fr_fr: Un script valide est attendu.

source: Right hand values must satisfy left hand side expression.
fr_fr: Les valeurs de la partie droite doivent satisfaire l'expression de la partie gauche.

source: Function not found:
fr_fr: Fonction non trouvée :

source: Type function not valid.
fr_fr: Type de fonction non valide.

source: The special variable 'varargout' was not defined as a cell-array.
fr_fr: La variable spéciale 'varargout' n'a pas été définie comme tableau de cellules.

source: The special variable 'varargout' was not defined as expected.
fr_fr: La variable spéciale 'varargout' n'a pas été définie comme prévu.

source: Not enough outputs in varargout to satisfy call.
fr_fr: Pas assez de sorties dans varargout pour satisfaire l'appel.

source: one or more outputs not assigned in call.
fr_fr: une ou plusieurs sorties non assignées dans l'appel.

source: Value of errno: %d
fr_fr: Valeur de errno : %d

source: Error opening file: %s
fr_fr: Erreur lors de l'ouverture du fichier : %s

source: Cannot open:
fr_fr: Impossible d'ouvrir :

source: Function '%s' has already been declared within this scope.
fr_fr: La fonction '%s' a déjà été déclarée dans cette portée.

source: Filename and function name are not same (%s vs %s).
fr_fr: Le nom de fichier et le nom de la fonction ne sont pas les mêmes (%s vs %s).

source: Lexical error '%s' at line %d of file %s
fr_fr: Erreur lexicale '%s' à la ligne %d du fichier %s

source: Lexical error '%s'
fr_fr: Erreur lexicale '%s'

source: Lexical error
fr_fr: Erreur lexicale

source: mismatched parenthesis
fr_fr: parenthèses non assorties

source: Maximum name length exceeded.
fr_fr: Dépassement de la longueur maximale du nom.

source: unterminated string
fr_fr: chaîne non terminée

source: unterminated character array
fr_fr: tableau de caractères non terminé

source: exceeds the Nelson maximum name length of %d characters.
fr_fr: dépasse la longueur maximale du nom de Nelson de %d caractères.

source: This statement is not inside any function.
fr_fr: Cette déclaration n'est à l'intérieur d'aucune fonction.

source: malformed floating point constant
fr_fr: constante en virgule flottante mal formée

source: Operands must be real.
fr_fr: Les opérandes doivent être réelles.

source: Operator '%s' is not supported for operands of type '%s'.
fr_fr: L'opérateur '%s' n'est pas pris en charge pour les opérandes de type '%s'.

source: Complex values cannot be converted to chars.
fr_fr: Les valeurs complexes ne peuvent pas être converties en caractères.

source: Nonscalar arrays of function handles are not allowed; use cell arrays instead.
fr_fr: Les tableaux non scalaires de pointeurs de fonction ne sont pas autorisés ; utilisez plutôt des tableaux de cellules.

source: Cannot promote to string array.
fr_fr: Impossible de promouvoir en tableau de chaînes de caractères.

source: Positive integral powers expected.
fr_fr: Puissances intégrales positives attendues.

source: Operand to && operator must be convertible to logical scalar values.
fr_fr: L'opérande de l'opérateur && doit être convertible en valeurs scalaires logiques.

source: Complex values cannot converted to logicals.
fr_fr: Les valeurs complexes ne peuvent pas être converties en logiques.

source: Operand to || operator must be convertible to logical scalar values.
fr_fr: L'opérande de l'opérateur || doit être convertible en valeurs scalaires logiques.

source: statement list or function definition
fr_fr: liste d'instructions ou définition de fonction

source: legal function name or return declaration after 'function'
fr_fr: nom de fonction légal ou déclaration de retour après 'function'

source: argument list or statement list after identifier '
fr_fr: liste d'arguments ou liste d'instructions après l'identifiant '

source: (possibly empty) argument list after '('
fr_fr: liste d'arguments (éventuellement vide) après '('

source: statement list after ')'
fr_fr: liste d'instructions après ')'

source: function name for function declared
fr_fr: nom de fonction pour la fonction déclarée

source: argument list or statement list following function name :
fr_fr: liste d'arguments ou liste d'instructions suivant le nom de la fonction :

source: an '=' symbol after identifier in return declaration
fr_fr: un symbole '=' après l'identifiant dans la déclaration de retour

source: a valid list of return arguments in return declaration
fr_fr: une liste valide d'arguments de retour dans la déclaration de retour

source: matching ']' in return declaration for '['
fr_fr: correspondance ']' dans la déclaration de retour pour '['

source: an '=' symbol after return declaration
fr_fr: un symbole '=' après la déclaration de retour

source: matching 'end' to 'try' clause from line
fr_fr: correspondance 'end' avec la clause 'try' à la ligne

source: matching 'end' to 'switch' clause from line
fr_fr: correspondance 'end' avec la clause 'switch' à la ligne

source: 'end' to match 'for' statement from line
fr_fr: 'end' pour correspondre à l'instruction 'for' à la ligne

source: matching right parenthesis
fr_fr: parenthèse droite correspondante

source: indexing expression
fr_fr: expression d'indexation

source: equals operator after loop index
fr_fr: opérateur égal après l'index de la boucle

source: identifier that is the loop variable
fr_fr: identifiant qui est la variable de boucle

source: identifier or assignment (id = expr) after 'for'
fr_fr: identifiant ou affectation (id = expr) après 'for'

source: test expression after 'while'
fr_fr: expression de test après 'while'

source: 'end' to match 'while' statement from line
fr_fr: 'end' pour correspondre à l'instruction 'while' à la ligne

source: condition expression for 'if'
fr_fr: expression de condition pour 'if'

source: 'end' to match 'if' statement from line
fr_fr: 'end' pour correspondre à l'instruction 'if' à la ligne

source: test condition for 'elseif' clause
fr_fr: condition de test pour la clause 'elseif'

source: statement list for 'else' clause
fr_fr: liste d'instructions pour la clause 'else'

source: expression in assignment
fr_fr: expression dans l'affectation

source: matching right bracket
fr_fr: crochet droit correspondant

source: indexing list
fr_fr: liste d'indexation

source: left parenthesis
fr_fr: parenthèse gauche

source: an expression after ':'
fr_fr: une expression après ':'

source: an expression after '+'
fr_fr: une expression après '+'

source: an expression after '-'
fr_fr: une expression après '-'

source: an expression after '*'
fr_fr: une expression après '*'

source: an expression after '/'
fr_fr: une expression après '/'

source: an expression after '\'
fr_fr: une expression après '\'

source: an expression after '|'
fr_fr: une expression après '|'

source: an expression after '&'
fr_fr: une expression après '&'

source: an expression after '||'
fr_fr: une expression après '||'

source: an expression after '&&'
fr_fr: une expression après '&&'

source: an expression after '<'
fr_fr: une expression après '<'

source: an expression after '<='
fr_fr: une expression après '<='

source: an expression after '>'
fr_fr: une expression après '>'

source: an expression after '>='
fr_fr: une expression après '>='

source: an expression after '=='
fr_fr: une expression après '=='

source: an expression after '~='
fr_fr: une expression après '~='

source: an expression after '.*'
fr_fr: une expression après '.*'

source: an expression after './'
fr_fr: une expression après './'

source: an expression after '.\'
fr_fr: une expression après '.\'

source: an expression after logical not
fr_fr: une expression après la négation logique

source: an expression after '^'
fr_fr: une expression après '^'

source: an expression after '.^'
fr_fr: une expression après '.^'

source: a matrix definition followed by a right bracket
fr_fr: une définition de matrice suivie d'une parenthèse droite

source: a cell-array definition followed by a right brace
fr_fr: une définition de tableau de cellules suivie d'une accolade droite

source: matching right brace
fr_fr: accolade droite correspondante

source: expecting expression after '=' in keyword assignment
fr_fr: attente d'une expression après '=' dans l'assignation de mot-clé

source: expecting keyword identifier after '/' in keyword assignment
fr_fr: attente d'un identifiant de mot-clé après '/' dans l'assignation de mot-clé

source: a right parenthesis after expression to match this one
fr_fr: une parenthèse droite après l'expression pour faire correspondance

source: an expression after left parenthesis
fr_fr: une expression après la parenthèse gauche

source: Expecting %s
fr_fr: En attente de %s

source: Expecting %s at line %d, column %d of file %s
fr_fr: En attente de %s à la ligne %d, colonne %d du fichier %s

source: Wrong value for #1 argument: 'available' expected.
fr_fr: Mauvaise valeur pour l'argument #1 : 'available' attendu.

source: PID valid expected.
fr_fr: PID valide attendu.

source: Command not sent.
fr_fr: Commande non envoyée.

source: #2 parameter invalid: 'minimize' parameter expected.
fr_fr: #2 paramètre invalide : paramètre 'minimize' attendu.

source: #3 Argument must contain a valid variable name.
fr_fr: #3 L'argument doit contenir un nom de variable valide.

source: #2 parameter invalid: 'post', 'eval', 'put', 'get', 'minimize' or 'isvar' parameter expected.
fr_fr: #2 paramètre invalide : paramètre 'post', 'eval', 'put', 'get', 'minimize' ou 'isvar' attendu.

source: #4 Argument must contain a valid variable name.
fr_fr: #4 L'argument doit contenir un nom de variable valide.

source: Variable not sent.
fr_fr: Variable non envoyée.

source: #4 Argument must contain a valid scope name.
fr_fr: #4 L'argument doit contenir un nom de portée valide.

source: #2 parameter invalid: 'put', 'get', 'post' or 'isvar' parameter expected.
fr_fr: #2 paramètre invalide : paramètre 'put', 'get', 'post' ou 'isvar' attendu.

source: #2 parameter invalid: 'put' parameter expected.
fr_fr: #2 paramètre invalide : paramètre 'put' attendu.

source: IPC resources not available.
fr_fr: Ressources IPC non disponibles.

source: Impossible to initialize IPC.
fr_fr: Impossible d'initialiser IPC.

source: Cannot compress data.
fr_fr: Impossible de compresser les données.

source: Serialized data too big.
fr_fr: Données sérialisées trop volumineuses.

source: Cannot send serialized data.
fr_fr: Impossible d'envoyer les données sérialisées.

source: Impossible to get value (PID destination no more valid).
fr_fr: Impossible d'obtenir la valeur (destination PID non valide).

source: Variable not fully serialized.
fr_fr: Variable non entièrement sérialisée.

source: Cannot serialize data.
fr_fr: Impossible de sérialiser les données.

source: Impossible to get value (Timeout).
fr_fr: Impossible d'obtenir la valeur (délai d'attente).

source: Wrong value for argument #2: 'ConvertInfAndNaN' expected.
fr_fr: Mauvaise valeur pour l'argument #2 : 'ConvertInfAndNaN' attendu.

source: Invalid character inside JSON string.
fr_fr: Caractère invalide à l'intérieur de la chaîne JSON.

source: Not enough tokens were provided.
fr_fr: Pas assez de jetons fournis.

source: The string is not a full JSON packet, more bytes expected.
fr_fr: La chaîne n'est pas un paquet JSON complet, plus d'octets sont attendus.

source: Unknow error.
fr_fr: Erreur inconnue.

source: valid JSON Object expected.
fr_fr: Objet JSON valide attendu.

source: Unsupported type to convert as JSON.
fr_fr: Type non pris en charge pour la conversion en JSON.

source: option #2 must be 'balance', or 'nobalance'.
fr_fr: l'option #2 doit être 'balance' ou 'nobalance'.

source: Second input must be 'skew' or 'nonskew'.
fr_fr: La deuxième entrée doit être 'skew' ou 'nonskew'.

source: Second input must be finite and >= 0.
fr_fr: La deuxième entrée doit être finie et >= 0.

source: Second input argument must be 'real' or 'complex'.
fr_fr: Le deuxième argument d'entrée doit être 'réel' ou 'complexe'.

source: svd(X, 0) or svd(X, 'econ') expected.
fr_fr: svd(X, 0) ou svd(X, 'econ') attendu.

source: Square matrix expected.
fr_fr: Matrice carrée attendue.

source: One argument had an illegal value.
fr_fr: Un argument avait une valeur illégale.

source: Positive finite matrix expected.
fr_fr: Matrice finie positive attendue.

source: Input(s) array must be 2 - dimensional.
fr_fr: Les tableaux d'entrée doivent être à 2 dimensions.

source: Undefined function 'expm' for input arguments of type
fr_fr: Fonction 'expm' non définie pour les arguments d'entrée de type

source: input matrices must be the same size.
fr_fr: les matrices d'entrée doivent être de même taille.

source: Undefined function '%s' for input arguments of type '%s'
fr_fr: Fonction non définie '%s' pour les arguments d'entrée de type '%s'

source: Input must be finite.
fr_fr: L'entrée doit être finie.

source: Undefined function 'sqrtm' for input arguments of type
fr_fr: Fonction 'sqrtm' non définie pour les arguments d'entrée de type

source: Cannot apply exponential operation to N-Dimensional arrays.
fr_fr: Impossible d'appliquer l'opération exponentielle aux tableaux N-dimensionnels.

source: Power (^) operator can only be applied to scalar and square arguments.
fr_fr: L'opérateur Power (^) ne peut être appliqué qu'aux arguments scalaires et carrés.

source: LAPACK_dgetrf error.
fr_fr: Erreur LAPACK_dgetrf.

source: LAPACK_dgecon error.
fr_fr: Erreur LAPACK_dgecon.

source: LAPACK_zgetrf error.
fr_fr: Erreur LAPACK_zgetrf.

source: LAPACK_zgecon error.
fr_fr: Erreur LAPACK_zgecon.

source: LAPACK_sgetrf error.
fr_fr: Erreur LAPACK_sgetrf.

source: LAPACK_sgecon error.
fr_fr: Erreur LAPACK_sgecon.

source: LAPACK_cgetrf error.
fr_fr: Erreur LAPACK_cgetrf.

source: LAPACK_cgecon error.
fr_fr: Erreur LAPACK_cgecon.

source: Undefined function 'rcond' for input arguments of type
fr_fr: Fonction 'rcond' non définie pour les arguments d'entrée de type

source: Undefined function 'schur' for input arguments of type
fr_fr: Fonction 'schur' non définie pour les arguments d'entrée de type

source: Input argument must not contain NaN or Inf.
fr_fr: L'argument d'entrée ne doit pas contenir NaN ou Inf.

source: svd: cannot take svd of matrix containing Inf or NaN values.
fr_fr: svd : impossible de prendre la svd d'une matrice contenant des valeurs Inf ou NaN.

source: LAPACKE_dgesvd error.
fr_fr: Erreur LAPACKE_dgesvd.

source: LAPACKE_zgesvd error.
fr_fr: Erreur LAPACKE_zgesvd.

source: LAPACKE_sgesvd error.
fr_fr: Erreur LAPACKE_sgesvd.

source: LAPACKE_cgesvd error.
fr_fr: Erreur LAPACKE_cgesvd.

source: Undefined function 'svd' for input arguments of type
fr_fr: Fonction 'svd' non définie pour les arguments d'entrée de type

source: Undefined function 'trace' for input arguments of type
fr_fr: Fonction 'trace' non définie pour les arguments d'entrée de type

source: Input following 'like' is not a logical array.
fr_fr: L'entrée suivant 'like' n'est pas un tableau logique.

source: N-dimensional sparse arrays are not supported.
fr_fr: Les tableaux creux N-dimensionnels ne sont pas pris en charge.

source: Conversion to logical from single is not possible.
fr_fr: La conversion en logique à partir de 'single' n'est pas possible.

source: Conversion to logical with NaN is not possible.
fr_fr: La conversion en logique avec NaN n'est pas possible.

source: Conversion to logical from sparse integer is not possible.
fr_fr: La conversion en logique à partir d'entier creux n'est pas possible.

source: Conversion to logical from graphics_object is not possible.
fr_fr: La conversion en logique à partir de graphics_object n'est pas possible.

source: Conversion to logical from handle is not possible.
fr_fr: La conversion en logique à partir de handle n'est pas possible.

source: Conversion to logical from string is not possible.
fr_fr: La conversion en logique à partir de string n'est pas possible.

source: Conversion to logical from cell is not possible.
fr_fr: La conversion en logique à partir de cell n'est pas possible.
