Repository: nelson-lang/nelson
Catalog: locale/*/LC_MESSAGES/nelson.po
Languages: fr_fr

source: empty string not allowed as expected message.
fr_fr: chaîne vide non autorisée en tant que message attendu.

source: Assertion failed : expected error message =
fr_fr: Échec de l'assertion : message d'erreur attendu =

source: computed error message =
fr_fr: message d'erreur calculé =

source: No error was produced while evaluating command.
fr_fr: Aucune erreur n'a été produite lors de l'évaluation de la commande.

source: Assertion failed : expected error identifier =
fr_fr: Échec de l'assertion : identifiant d'erreur attendu =

source: computed error identifier =
fr_fr: identifiant d'erreur calculé =

source: isapprox returns more than one output argument.
fr_fr: isapprox renvoie plus d'un argument de sortie.

source: isapprox must return a logical.
fr_fr: isapprox doit renvoyer une valeur logique.

source: Assertion failed: expected and computed values are too different.
fr_fr: Échec de l'assertion : les valeurs attendues et calculées sont trop différentes.

source: Assertion failed: expected '%s' and computed '%s' values are different.
fr_fr: Échec de l'assertion : les valeurs attendues '%s' et calculées '%s' sont différentes.

source: Assertion failed: expected (%s) and computed (%s) values are different.
fr_fr: Échec de l'assertion : les valeurs attendues (%s) et calculées (%s) sont différentes.

source: Assertion failed: expected "%s" and computed "%s" values are different.
fr_fr: Échec de l'assertion : les valeurs attendues "%s" et calculées "%s" sont différentes.

source: Assertion failed: expected (%lg) and computed (%lg) values are different.
fr_fr: Échec de l'assertion : les valeurs attendues (%lg) et calculées (%lg) sont différentes.

source: Assertion failed: expected (%ls) and computed (%ls) values are different.
fr_fr: Échec de l'assertion : les valeurs attendues (%ls) et calculées (%ls) sont différentes.

source: Assertion failed: expected and computed values are different.
fr_fr: Échec de l'assertion : les valeurs attendues et calculées sont différentes.

source: isequalto returns more than one output argument.
fr_fr: isequalto renvoie plus d'un argument de sortie.

source: isequalto must return a logical.
fr_fr: isequalto doit renvoyer une valeur logique.

source: isequalto returns an unexpected error.
fr_fr: isequalto renvoie une erreur inattendue.

source: Assertion failed: found false entry in condition = true.
fr_fr: Échec de l'assertion : entrée fausse trouvée dans la condition = true.

source: Assertion failed: found false entry in condition = false.
fr_fr: Échec de l'assertion : entrée fausse trouvée dans la condition = false.

source: Wrong value for #1 argument.
fr_fr: Mauvaise valeur pour l'argument #1.

source: Wrong value for #3 argument.
fr_fr: Mauvaise valeur pour l'argument #3.

source: Cannot create audioplayer handle.
fr_fr: Impossible de créer une poignée audioplayer.

source: audioplayer handle expected.
fr_fr: Une poignée audioplayer est attendue.

source: start >= 1 expected.
fr_fr: start >= 1 attendu.

source: Index >= 1 expected.
fr_fr: Index >= 1 attendu.

source: scalar or [start, end] vector expected.
fr_fr: Un scalaire ou un vecteur [start, end] est attendu.

source: Invalid range.
fr_fr: Plage invalide.

source: No property for class: audioplayer.
fr_fr: Aucune propriété pour la classe : audioplayer.

source: Properties for class: audioplayer:
fr_fr: Propriétés pour la classe : audioplayer :

source: [start, end] vector expected.
fr_fr: Un vecteur [start, end] est attendu.

source: Wrong value for #2 argument.
fr_fr: Mauvaise valeur pour l'argument #2.

source: Wrong value for #1 or #2 argument.
fr_fr: Mauvaise valeur pour l'argument #1 ou #2.

source: Wrong value for #4 argument.
fr_fr: Mauvaise valeur pour l'argument #4.

source: Invalid filename.
fr_fr: Nom de fichier invalide.

source: No tags available.
fr_fr: Aucune étiquette disponible.

source: Taglib not available.
fr_fr: Taglib non disponible.

source: Cannot save file.
fr_fr: Impossible d'enregistrer le fichier.

source: Wrong device ID.
fr_fr: ID de périphérique incorrect.

source: Empty matrix not allowed.
fr_fr: Matrice vide non autorisée.

source: Vector or matrix 2D expected.
fr_fr: Vecteur ou matrice 2D attendu.

source: Too many output channels.
fr_fr: Trop de canaux de sortie.

source: Type not supported.
fr_fr: Type non pris en charge.

source: 'native' or 'double' expected.
fr_fr: 'native' ou 'double' attendu.

source: Cannot read audio file.
fr_fr: Impossible de lire le fichier audio.

source: Invalid file extension.
fr_fr: Extension de fichier invalide.

source: Invalid BitsPerSample value.
fr_fr: Valeur BitsPerSample invalide.

source: Invalid parameters values.
fr_fr: Valeurs de paramètres invalides.

source: Write failed.
fr_fr: Échec de l'écriture.

source: Filename must have an extension.
fr_fr: Le nom de fichier doit avoir une extension.

source: audioplayer valid handle expected.
fr_fr: Une poignée audioplayer valide est attendue.

source: Sparse type not supported.
fr_fr: Le type sparse n'est pas pris en charge.

source: Cannot convert to Unicode.
fr_fr: Impossible de convertir en Unicode.

source: Invalid charset:
fr_fr: Jeu de caractères invalide :

source: Cannot convert string to expected charset.
fr_fr: Impossible de convertir la chaîne en jeu de caractères attendu.

source: 'machine' value expected.
fr_fr: La valeur 'machine' est attendue.

source: Not implemented on this platform.
fr_fr: Non implémenté sur cette plateforme.

source: Unrecognized option. "-full" expected.
fr_fr: Option non reconnue. "-full" attendu.

source: Error CLSIDFromString.
fr_fr: Erreur CLSIDFromString.

source: Error CLSIDFromProgID.
fr_fr: Erreur CLSIDFromProgID.

source: Error CoCreateInstanceEx.
fr_fr: Erreur CoCreateInstanceEx.

source: Invalid PROGID.
fr_fr: PROGID invalide.

source: Server is not running on this system.
fr_fr: Le serveur ne s'exécute pas sur ce système.

source: Fails to connect to server.
fr_fr: Échec de la connexion au serveur.

source: COM handle expected.
fr_fr: Une poignée COM est attendue.

source: COM valid handle expected.
fr_fr: Une poignée COM valide est attendue.

source: IDispatch not defined.
fr_fr: IDispatch non défini.

source: method not found.
fr_fr: Méthode non trouvée.

source: Error detected:
fr_fr: Erreur détectée :

source: Only 7 input parameters expected.
fr_fr: Seulement 7 paramètres d'entrée attendus.

source: VARIANT conversion fails.
fr_fr: La conversion VARIANT a échoué.

source: Sparse not supported.
fr_fr: Sparse n'est pas pris en charge.

source: N dimensions array not supported.
fr_fr: Les tableaux de N dimensions ne sont pas pris en charge.

source: Unrecognized option. "s" expected.
fr_fr: Option non reconnue. "s" attendu.

source: Second argument must be a scalar.
fr_fr: Le deuxième argument doit être un scalaire.

source: First argument to 'diag' function must be 2D.
fr_fr: Le premier argument de la fonction 'diag' doit être en 2D.

source: Type 'double' or 'single' expected.
fr_fr: Type 'double' ou 'single' attendu.

source: N-dimensional arrays are not supported.
fr_fr: Les tableaux de N dimensions ne sont pas pris en charge.

source: Size vector should be a row vector with real elements.
fr_fr: Le vecteur de taille doit être un vecteur ligne avec des éléments réels.

source: Too many dimensions! Current limit is
fr_fr: Trop de dimensions ! La limite actuelle est

source: A supported type expected at last argument.
fr_fr: Un type pris en charge est attendu en dernier argument.

source: 'like' expected at n - 2 argument.
fr_fr: 'like' attendu à l'argument n - 2.

source: sparse not supported.
fr_fr: Sparse n'est pas pris en charge.

source: Input following 'like'' is not a numeric array.
fr_fr: L'entrée suivant 'like'' n'est pas un tableau numérique.

source: Input following 'like' is not a numeric array.
fr_fr: L'entrée suivant 'like' n'est pas un tableau numérique.

source: #1 string expected.
fr_fr: #1 chaîne attendue.

source: #2 string expected.
fr_fr: #2 chaîne attendue.

source: Argument #1 : 'base', 'local' or 'caller' expected.
fr_fr: Argument #1 : 'base', 'local' ou 'caller' attendu.

source: #2 'errcatch' or 'nocatch' expected.
fr_fr: #2 'errcatch' ou 'nocatch' attendu.

source: Value between 0 and 255 expected.
fr_fr: Valeur entre 0 et 255 attendue.

source: Cannot return input name if not in an active function.
fr_fr: Impossible de renvoyer le nom de l'entrée si la fonction n'est pas active.

source: Scalar integer value required, but value is not integral.
fr_fr: Une valeur entière de type scalaire est requise, mais la valeur n'est pas entière.

source: Argument number is not valid.
fr_fr: Le numéro d'argument n'est pas valide.

source: not allowed in base scope.
fr_fr: non autorisé dans la portée de base.

source: You can only call 'narginchk' from within a Nelson function.
fr_fr: Vous ne pouvez appeler 'narginchk' que depuis une fonction Nelson.

source: Scalar integer value required for #1 argument.
fr_fr: Une valeur entière de type scalaire est requise pour l'argument #1.

source: Scalar integer value required for #2 argument.
fr_fr: Une valeur entière de type scalaire est requise pour l'argument #2.

source: No output arguments are allowed if only two input arguments.
fr_fr: Aucun argument de sortie n'est autorisé s'il n'y a que deux arguments d'entrée.

source: You can only call 'nargoutchk' from within a Nelson function.
fr_fr: Vous ne pouvez appeler 'nargoutchk' que depuis une fonction Nelson.

source: #4 input must be either 'struct' or 'string'.
fr_fr: L'entrée #4 doit être soit 'struct' soit 'string'.

source: Scalar integer value required for #3 argument.
fr_fr: Une valeur entière scalaire est requise pour l'argument #3.

source: Not enough output arguments.
fr_fr: Pas assez d'arguments de sortie.

source: Too many output arguments.
fr_fr: Trop d'arguments de sortie.

source: Cannot find Nelson binary path.
fr_fr: Impossible de trouver le chemin binaire de Nelson.

source: Cannot find Nelson libraries path.
fr_fr: Impossible de trouver le chemin des bibliothèques de Nelson.

source: Cannot find Nelson modules path.
fr_fr: Impossible de trouver le chemin des modules de Nelson.

source: Cannot find Nelson root path.
fr_fr: Impossible de trouver le chemin racine de Nelson.

source: Cannot find Nelson preferences path.
fr_fr: Impossible de trouver le chemin des préférences de Nelson.

source: Invalid use of statement list.
fr_fr: Utilisation invalide de la liste d'instructions.

source: 'local', 'caller', 'base' scope expected.
fr_fr: Portée attendue : 'local', 'caller' ou 'base'.

source: Error:
fr_fr: Erreur :

source: Permission denied.
fr_fr: Autorisation refusée.

source: File does not exist.
fr_fr: Le fichier n'existe pas.

source: '%s' does not know how to answer nargin/nargout.
fr_fr: '%s' ne sait pas comment répondre à nargin/nargout.

source: Wrong value for #%d argument.
fr_fr: Mauvaise valeur pour l'argument #%d.

source: Invalid third argument.
fr_fr: Troisième argument invalide.

source: Invalid second argument.
fr_fr: Deuxième argument invalide.

source: Invalid 4th argument.
fr_fr: Quatrième argument invalide.

source: 'auto', 'first', or 'last' for 'MissingPlacement' parameter.
fr_fr: 'auto', 'first' ou 'last' attendu pour le paramètre 'MissingPlacement'.

source: 'auto', 'real', or 'abs' for 'ComparisonMethod' parameter.
fr_fr: 'auto', 'real' ou 'abs' attendu pour le paramètre 'ComparisonMethod'.

source: Dimension argument to sort should be positive.
fr_fr: L'argument de dimension pour trier doit être positif.

source: Sort direction must be either the string 'ascend' or 'descend'.
fr_fr: La direction de tri doit être soit la chaîne 'ascend' soit 'descend'.

source: 'ComparisonMethod' or 'MissingPlacement' expected.
fr_fr: 'ComparisonMethod' ou 'MissingPlacement' attendu.

source: Shape parameter must be 'full', 'same', or 'valid'.
fr_fr: Le paramètre de forme doit être 'full', 'same' ou 'valid'.

source: Invalid data type: First argument must be numeric or logical.
fr_fr: Type de données invalide : le premier argument doit être numérique ou logique.

source: N-D arrays are not supported.
fr_fr: Les tableaux N-D ne sont pas pris en charge.

source: Sparse matrices are not supported.
fr_fr: Les matrices creuses ne sont pas prises en charge.

source: Invalid data type: Second argument must be numeric or logical.
fr_fr: Type de données invalide : le deuxième argument doit être numérique ou logique.

source: Invalid data type: Third argument must be numeric or logical.
fr_fr: Type de données invalide : le troisième argument doit être numérique ou logique.

source: Input Arguments must have the same size.
fr_fr: Les arguments d'entrée doivent avoir la même taille.

source: Dimension argument must be a positive integer scalar.
fr_fr: L'argument de dimension doit être un scalaire entier positif.

source: function
fr_fr: fonction

source: undefined.
fr_fr: non définie.

source: Only one input parameter is supported for cell arrays.
fr_fr: Seul un paramètre d'entrée est pris en charge pour les tableaux de cellules.

source: Not yet implemented with dim > 2
fr_fr: Pas encore implémenté avec dim > 2

source: Number of field names must match the number of fields in the new structure.
fr_fr: Le nombre de noms de champs doit correspondre au nombre de champs de la nouvelle structure.

source: function returned fewer outputs than expected
fr_fr: La fonction a renvoyé moins de sorties que prévu.

source: function returned a non-scalar result
fr_fr: La fonction a renvoyé un résultat non scalaire.

source: Error wrong type expected.
fr_fr: Erreur, mauvais type attendu.

source: Error already defined.
fr_fr: Erreur déjà définie.

source: wrong type #1
fr_fr: mauvais type #1

source: A valid function name is expected.
fr_fr: Un nom de fonction valide est attendu.

source: cell expected.
fr_fr: cellule attendue.

source: Wrong type for argument #1. struct expected.
fr_fr: Mauvais type pour l'argument #1. Une structure est attendue.

source: A field named '%s' doesn't exist.
fr_fr: Un champ nommé '%s' n'existe pas.

source: Conversion from 'struct' to 'function_handle' is not possible.
fr_fr: La conversion de 'struct' en 'function_handle' n'est pas possible.

source: struct([]) expected.
fr_fr: Une structure([]) est attendue.

source: requires pairs of field names and values.
fr_fr: requiert des paires de noms de champs et de valeurs.

source: requires a valid field name.
fr_fr: requiert un nom de champ valide.

source: '-completenames' expected.
fr_fr: '-completenames' attendu.

source: '-completenames' expected or a scalar integer value is required.
fr_fr: '-completenames' attendu ou une valeur entière scalaire est requise.

source: unexpected format.
fr_fr: format inattendu.

source: unexpected Numeric Format.
fr_fr: format numérique inattendu.

source: unexpected Line Spacing.
fr_fr: espacement de ligne inattendu.

source: Wrong size for argument #1. Scalar expected.
fr_fr: Taille incorrecte pour l'argument #1. Scalaire attendu.

source: Wrong type for argument #1. 'scalar string or row char vector expected.
fr_fr: Mauvais type pour l'argument #1. 'scalar string' ou 'row char vector' attendu.

source: Wrong type for argument #2. 'scalar string or row char vector expected.
fr_fr: Mauvais type pour l'argument #2. 'scalar string' ou 'row char vector' attendu.

source: All zero sparse: %s
fr_fr: Tout zéro sparse : %s

source: array
fr_fr: tableau

source: row vector
fr_fr: vecteur ligne

source: column vector
fr_fr: vecteur colonne

source: matrix
fr_fr: matrice

source: empty
fr_fr: vide

source: Column %d
fr_fr: Colonne %d

source: Columns %d through %d
fr_fr: Colonnes de %d à %d

source: #1 'double' or 'single' expected.
fr_fr: #1 attendu de type 'double' ou 'single'.

source: dlsym handle expected.
fr_fr: Un gestionnaire dlsym est attendu.

source: dllib handle expected.
fr_fr: Un gestionnaire dllib est attendu.

source: Cannot get library symbols:
fr_fr: Impossible d'obtenir les symboles de la bibliothèque :

source: libpointer handle expected.
fr_fr: Un gestionnaire libpointer est attendu.

source: Wrong type for argument #1: dllib scalar handle expected.
fr_fr: Mauvais type pour l'argument #1 : un gestionnaire scalaire dllib est attendu.

source: Valid handle expected.
fr_fr: Un gestionnaire valide est attendu.

source: Invalid argument type: %s.
fr_fr: Type d'argument invalide : %s.

source: Multiple possible symbol names found: %s
fr_fr: Plusieurs noms de symboles possibles ont été trouvés : %s

source: Invalid symbol name: %s
fr_fr: Nom de symbole invalide : %s

source: dllib valid handle expected.
fr_fr: Un gestionnaire dllib valide est attendu.

source: dlsym valid handle expected.
fr_fr: Un gestionnaire dlsym valide est attendu.

source: libpointer valid handle expected.
fr_fr: Un gestionnaire libpointer valide est attendu.

source: Cannot load library:
fr_fr: Impossible de charger la bibliothèque :

source: import type %s not defined in FFI type table.
fr_fr: Le type d'importation %s n'est pas défini dans la table des types FFI.

source: 'void' not allowed as input type.
fr_fr: 'void' n'est pas autorisé en tant que type d'entrée.

source: Unable to import function through FFI.
fr_fr: Impossible d'importer la fonction via FFI.

source: cell array
fr_fr: tableau de cellules

source: Invalid type for #%zu input argument: %s expected.
fr_fr: Type invalide pour l'argument d'entrée #%zu : %s attendu.

source: Invalid argument type:
fr_fr: Type d'argument invalide :

source: Invalid #2 argument type expected:
fr_fr: Type d'argument #2 invalide attendu :

source: Invalid #2 argument scalar expected.
fr_fr: Mauvais type d'argument #2 : un scalaire est attendu.

source: The datatype and size of the value must be defined.
fr_fr: Le type de données et la taille de la valeur doivent être définis.

source: Offset must not be greater than the size of the pointer.
fr_fr: L'offset ne doit pas être supérieur à la taille du pointeur.

source: Null pointer cannot be incremented.
fr_fr: Le pointeur nul ne peut pas être incrémenté.

source: Void cannot be incremented.
fr_fr: Void ne peut pas être incrémenté.

source: VoidPtr cannot be incremented.
fr_fr: VoidPtr ne peut pas être incrémenté.

source: Libpointer cannot be incremented.
fr_fr: Libpointer ne peut pas être incrémenté.

source: Cannot be incremented.
fr_fr: Ne peut pas être incrémenté.

source: Invalid type.
fr_fr: Type invalide.

source: Incompatible types.
fr_fr: Types incompatibles.

source: Only numericPtr can be reshaped.
fr_fr: Seul numericPtr peut être remodelé.

source: Integers can only be combined with integers of the same class, or scalar doubles.
fr_fr: Les entiers ne peuvent être combinés qu'avec des entiers de la même classe ou des doubles scalaires.

source: Numeric types expected.
fr_fr: Types numériques attendus.

source: Attempt to convert to unimplemented sparse type.
fr_fr: Tentative de conversion vers un type sparse non implémenté.

source: Inputs parameters must be scalars.
fr_fr: Les paramètres d'entrée doivent être des scalaires.

source: Third argument should be an integer value.
fr_fr: Le troisième argument doit être une valeur entière.

source: Undefined function 'ndims' for input arguments of type
fr_fr: Fonction 'ndims' non définie pour des arguments d'entrée de type

source: ORDER must have at least N elements for an N-D array.
fr_fr: L'ORDRE doit avoir au moins N éléments pour un tableau N-D.

source: Second argument is not a valid permutation.
fr_fr: Le deuxième argument n'est pas une permutation valide.

source: Too many dimensions!
fr_fr: Trop de dimensions !

source: A row vector is expected.
fr_fr: Un vecteur ligne est attendu.

source: Undefined function 'reshape' for input arguments of overloaded type.
fr_fr: Fonction 'reshape' non définie pour des arguments d'entrée de type surchargé.

source: Undefined function 'reshape' for input arguments of type 'function_handle'.
fr_fr: Fonction 'reshape' non définie pour des arguments d'entrée de type 'function_handle'.

source: Finite value expected.
fr_fr: Une valeur finie est attendue.

source: Real integer expected.
fr_fr: Un entier réel est attendu.

source: Real positive integer expected.
fr_fr: Un entier réel positif est attendu.

source: Only one unknown dimension allowed.
fr_fr: Seule une dimension inconnue est autorisée.

source: Reshape operation cannot change the number of elements in the array.
fr_fr: L'opération de remodelage ne peut pas changer le nombre d'éléments dans le tableau.

source: Wrong value for argument #2. 'r' or 'c' expected.
fr_fr: Mauvaise valeur pour l'argument #2 : 'r' ou 'c' est attendu.

source: Wrong type for argument #2. Numeric values expected.
fr_fr: Mauvais type pour l'argument #2 : des valeurs numériques sont attendues.

source: Wrong size for argument #2. Row vector or scalar expected.
fr_fr: Mauvaise taille pour l'argument #2 : un vecteur ligne ou un scalaire est attendu.

source: K-th diagonal input must be an integer scalar.
fr_fr: La K-ème diagonale en entrée doit être un scalaire entier.

source: Cannot convert:
fr_fr: Impossible de convertir :

source: The base must be an integer value between 2 and 36.
fr_fr: La base doit être une valeur entière entre 2 et 36.

source: 2D char array expected.
fr_fr: Un tableau char 2D est attendu.

source: Binary character vector may consist only of characters 0 and 1.
fr_fr: Le vecteur de caractères binaire ne peut contenir que les caractères 0 et 1.

source: Invalid string length: 1, 32, 64 expected.
fr_fr: Longueur de chaîne invalide : 1, 32, 64 attendus.

source: Unsupported data conversion.
fr_fr: Conversion de données non prise en charge.

source: Undefined function 'conj' for input arguments of type
fr_fr: Fonction 'conj' non définie pour des arguments d'entrée de type

source: Input arguments must be full.
fr_fr: Les arguments d'entrée doivent être complets.

source: Input arguments must be numeric.
fr_fr: Les arguments d'entrée doivent être numériques.

source: Input arguments must be real.
fr_fr: Les arguments d'entrée doivent être réels.

source: Input arguments must have the same size.
fr_fr: Les arguments d'entrée doivent avoir la même taille.

source: Undefined function '%s_complex'
fr_fr: Fonction '%s_complex' non définie

source: An array of integer values, 0 <= D <= flintmax expected.
fr_fr: Un tableau de valeurs entières, 0 <= D <= flintmax, est attendu.

source: #3 parameter: positive integer value expected.
fr_fr: Paramètre #3 : une valeur entière positive est attendue.

source: Invalid third input argument. 'first' or 'last' expected.
fr_fr: Troisième argument d'entrée invalide. 'first' ou 'last' est attendu.

source: Arrays have incompatible sizes for this operation.
fr_fr: Les tableaux ont des tailles incompatibles pour cette opération.

source: Undefined function '
fr_fr: Fonction non définie '

source: Undefined function 'isfinite' for input arguments of type
fr_fr: Fonction 'isfinite' non définie pour des arguments d'entrée de type

source: Undefined function 'isinf' for input arguments of type
fr_fr: Fonction 'isinf' non définie pour des arguments d'entrée de type

source: Undefined function 'isnan' for input arguments of type
fr_fr: Fonction 'isnan' non définie pour des arguments d'entrée de type

source: Imaginary part ignored.
fr_fr: Partie imaginaire ignorée.

source: Undefined function 'mod' for complex input argument.
fr_fr: Fonction 'mod' non définie pour un argument d'entrée complexe.

source: Undefined function 'mod' for sparse input argument.
fr_fr: Fonction 'mod' non définie pour un argument d'entrée creux.

source: Integers type not managed.
fr_fr: Type d'entiers non pris en charge.

source: Integers must be combined with integers of the same class.
fr_fr: Les entiers doivent être combinés avec des entiers de la même classe.

source: First argument must be real.
fr_fr: Le premier argument doit être réel.
