Repository: nelson-lang/nelson
Catalog: locale/*/LC_MESSAGES/nelson.po
Languages: fr_fr

source: Undefined function 'rem' for complex input argument.
fr_fr: Fonction 'rem' non définie pour un argument d'entrée complexe.

source: Undefined function 'rem' for sparse input argument.
fr_fr: Fonction 'rem' non définie pour un argument d'entrée creux.

source: Type not managed.
fr_fr: Type non pris en charge.

source: Input argument #1: scalar integer value expected.
fr_fr: Argument d'entrée #1 : une valeur entière scalaire est attendue.

source: unknown mode.
fr_fr: mode inconnu.

source: Main finish.m failed to run.
fr_fr: Échec de l'exécution du finish.m principal.

source: User finish.m failed to run.
fr_fr: Échec de l'exécution du finish.m utilisateur.

source: This mode is not yet implemented.
fr_fr: Ce mode n'est pas encore implémenté.

source: unknown engine.
fr_fr: moteur inconnu.

source: Gui module not loaded.
fr_fr: Module GUI non chargé.

source: Gui Function not loaded.
fr_fr: Fonction GUI non chargée.

source: no value after
fr_fr: aucune valeur après

source: multiple option
fr_fr: option multiple

source: display this help message
fr_fr: afficher ce message d'aide

source: display the version number
fr_fr: afficher le numéro de version

source: no main startup file
fr_fr: pas de fichier de démarrage principal

source: no user startup file
fr_fr: pas de fichier de démarrage utilisateur

source: no user modules loaded
fr_fr: aucun module utilisateur chargé

source: minimize main window (GUI only)
fr_fr: réduire la fenêtre principale (GUI seulement)

source: no ipc features
fr_fr: aucune fonctionnalité IPC

source: without file watcher
fr_fr: sans observateur de fichier

source: command to execute
fr_fr: commande à exécuter

source: file to execute in a new process
fr_fr: fichier à exécuter dans un nouveau processus

source: file to execute in an existing process
fr_fr: fichier à exécuter dans un processus existant

source: language used in the current session
fr_fr: langue utilisée dans la session actuelle

source: socket.io URI address
fr_fr: adresse URI socket.io

source: does not print banner and version at startup
fr_fr: ne pas imprimer la bannière et la version au démarrage

source: kill nelson process after n seconds
fr_fr: arrêter le processus Nelson après n secondes

source: open files in a text editor
fr_fr: ouvrir les fichiers dans un éditeur de texte

source: load .nh5, .mat files in Nelson
fr_fr: charger les fichiers .nh5, .mat dans Nelson

source: socketio address required.
fr_fr: adresse socket.io requise.

source: '-F' option, GUI mode required.
fr_fr: option '-F', mode GUI requis.

source: 'open' in editor, GUI mode required.
fr_fr: 'open' dans l'éditeur, mode GUI requis.

source: wrong value for the timeout option.
fr_fr: mauvaise valeur pour l'option de délai d'attente.

source: Error: could not find the function NtOpenFile in the library ntdll.dll.
fr_fr: Erreur : impossible de trouver la fonction NtOpenFile dans la bibliothèque ntdll.dll.

source: Too many arguments -f and -e are exclusive.
fr_fr: Trop d'arguments -f et -e sont exclusifs.

source: Error
fr_fr: Erreur

source: Too many arguments -f and -F are exclusive.
fr_fr: Trop d'arguments -f et -F sont exclusifs.

source: Nelson paths not initialized.
fr_fr: Chemins Nelson non initialisés.

source: Nelson interpreter not initialized.
fr_fr: Interpréteur Nelson non initialisé.

source: Recursion stack not enough. Please set the C recursion stack to
fr_fr: Pile de récursion insuffisante. Veuillez définir la pile de récursion C sur

source: Current C stack is:
fr_fr: La pile C actuelle est :

source: Nelson cannot load base modules.
fr_fr: Nelson ne peut pas charger les modules de base.

source: Main startup.m failed to run.
fr_fr: Échec de l'exécution de startup.m principal.

source: Module already loaded:
fr_fr: Module déjà chargé :

source: Impossible to load module:
fr_fr: Impossible de charger le module :

source: Impossible to read modules.json
fr_fr: Impossible de lire modules.json

source: User startup.m failed to run.
fr_fr: Échec de l'exécution de startup.m utilisateur.

source: First input argument must be a valid message identifier.
fr_fr: Le premier argument d'entrée doit être un identifiant de message valide.

source: Wrong value for #2 input argument.
fr_fr: Mauvaise valeur pour l'argument d'entrée #2.

source: 'reset' expected.
fr_fr: 'reset' attendu.

source: a structure or the string 'reset' expected.
fr_fr: une structure ou la chaîne 'reset' attendue.

source: MException expected.
fr_fr: MException attendue.

source: MException scalar expected.
fr_fr: MException scalaire attendue.

source: By default, warnings are enabled ('on'):
fr_fr: Par défaut, les avertissements sont activés ('on') :

source: Wrong value for #1 argument: valid warning struct expected.
fr_fr: Mauvaise valeur pour l'argument #1 : une structure d'avertissement valide est attendue.

source: Error:
fr_fr: Erreur :

source: Error in
fr_fr: Erreur dans

source: line
fr_fr: ligne

source: at line %5d of '%s'
fr_fr: à la ligne %5d de '%s'

source: Cannot apply wisdom.
fr_fr: Impossible d'appliquer la sagesse.

source: Wrong value for #1: 'load' or 'free' expected.
fr_fr: Mauvaise valeur pour l'argument #1 : 'load' ou 'free' attendu.

source: Wrong value for #1: 'load' expected.
fr_fr: Mauvaise valeur pour l'argument #1 : 'load' attendu.

source: Undefined function 'fft' for input arguments of type
fr_fr: Fonction 'fft' non définie pour des arguments d'entrée de type

source: Undefined function 'ifft' for input arguments of type
fr_fr: Fonction 'ifft' non définie pour des arguments d'entrée de type

source: Impossible to get current directory.
fr_fr: Impossible d'obtenir le répertoire courant.

source: Not a file or a directory.
fr_fr: Ce n'est ni un fichier ni un répertoire.

source: Argument #2 must contain a valid string 'path', 'filename' or 'extension' expected.
fr_fr: L'argument #2 doit contenir une chaîne valide, 'chemin', 'nom de fichier' ou 'extension' attendue.

source: All inputs must be strings, character vectors, or cell arrays of character vectors.
fr_fr: Tous les arguments doivent être des chaînes, des vecteurs de caractères ou des tableaux de cellules de vecteurs de caractères.

source: All string and cell array inputs must be the same size or scalars.
fr_fr: Toutes les chaînes et les tableaux de cellules doivent avoir la même taille ou être des scalaires.

source: Cell of strings expected.
fr_fr: Une cellule de chaînes est attendue.

source: Cannot change directory '%s'.
fr_fr: Impossible de changer de répertoire '%s'.

source: File source does not exist.
fr_fr: Le fichier source n'existe pas.

source: Source directory %s does not exist or is not a directory.
fr_fr: Le répertoire source %s n'existe pas ou n'est pas un répertoire.

source: Cannot create destination directory %s
fr_fr: Impossible de créer le répertoire de destination %s

source: Directory source does not exist.
fr_fr: Le répertoire source n'existe pas.

source: Directory destination does not exist.
fr_fr: Le répertoire de destination n'existe pas.

source: A cell of existing filenames expected.
fr_fr: Une cellule de noms de fichiers existants est attendue.

source: Directory already exists.
fr_fr: Le répertoire existe déjà.

source: an existing directory expected.
fr_fr: Un répertoire existant est attendu.

source: Permission denied
fr_fr: Permission refusée

source: an existing file expected.
fr_fr: Un fichier existant est attendu.

source: Cannot create directory.
fr_fr: Impossible de créer le répertoire.

source: Cannot read file:
fr_fr: Impossible de lire le fichier :

source: Cannot read file global info.
fr_fr: Impossible de lire les informations globales du fichier.

source: Cannot read file info.
fr_fr: Impossible de lire les informations du fichier.

source: Cannot open file.
fr_fr: Impossible d'ouvrir le fichier.

source: Cannot open destination file.
fr_fr: Impossible d'ouvrir le fichier de destination.

source: Cannot read data.
fr_fr: Impossible de lire les données.

source: Cannot read next file.
fr_fr: Impossible de lire le fichier suivant.

source: Invalid value.
fr_fr: Valeur non valide.

source: Invalid root path.
fr_fr: Chemin racine non valide.

source: Nothing to zip.
fr_fr: Rien à compresser.

source: Cannot write file:
fr_fr: Impossible d'écrire dans le fichier :

source: Cannot add entry:
fr_fr: Impossible d'ajouter une entrée :

source: Warning: Not a directory:
fr_fr: Avertissement : Ce n'est pas un répertoire :

source: function '
fr_fr: fonction '

source: ' is not a builtin.
fr_fr: ' n'est pas une fonction intégrée.

source: Invalid anonymous function.
fr_fr: Fonction anonyme non valide.

source: function macro name not found.
fr_fr: Nom de fonction macro introuvable.

source: The path is empty. Please restore path.
fr_fr: Le chemin est vide. Veuillez restaurer le chemin.

source: Nelson's search path contains the following directories:
fr_fr: Le chemin de recherche de Nelson contient les répertoires suivants :

source: Warning: Not in path:
fr_fr: Avertissement : Pas dans le chemin :

source: Not an existing directory:
fr_fr: Ce n'est pas un répertoire existant :

source: built-in
fr_fr: intégré

source: not found.
fr_fr: introuvable.

source: Shadowed
fr_fr: Occulté

source: #2 Argument must be '-all' or '-module'.
fr_fr: L'argument #2 doit être '-all' ou '-module'.

source: Function does not exist.
fr_fr: La fonction n'existe pas.

source: Argument #1 must be a valid function_handle.
fr_fr: L'argument #1 doit être un handle de fonction valide.

source: Case not managed. Please report.
fr_fr: Cas non géré. Veuillez signaler.

source: A valid function handle expected.
fr_fr: Un handle de fonction valide est attendu.

source: single argument to axes function must be handle for an axes.
fr_fr: Un seul argument pour la fonction axes doit être un handle pour une fenêtre graphique.

source: Specified window does not exist.
fr_fr: La fenêtre spécifiée n'existe pas.

source: Invalid handle.
fr_fr: Handle non valide.

source: figure number is out of range - it must be between 1 and 2147483647.
fr_fr: Le numéro de la figure est hors de portée - il doit être compris entre 1 et 2147483647.

source: figure graphics object expected.
fr_fr: Un objet graphique de type figure est attendu.

source: Invalid Figure handle.
fr_fr: Handle de figure non valide.

source: Wrong number of input parameters.
fr_fr: Nombre incorrect de paramètres d'entrée.

source: Got error for property:
fr_fr: Erreur obtenue pour la propriété :

source: hggroup expected.
fr_fr: Un objet graphique de type hggroup est attendu.

source: Parent should have only one graphics object.
fr_fr: Le parent doit avoir un seul objet graphique.

source: Cannot delete root graphics object.
fr_fr: Impossible de supprimer l'objet graphique racine.

source: graphics_object expected.
fr_fr: Un objet graphique est attendu.

source: No property for class
fr_fr: Pas de propriété pour la classe

source: Properties for class
fr_fr: Propriétés pour la classe

source: Expected graphics object(s).
fr_fr: Des objets graphiques sont attendus.

source: Property is readable only:
fr_fr: La propriété est en lecture seule :

source: Wrong value for quality: [0, 100] expected.
fr_fr: Mauvaise valeur pour la qualité : [0, 100] attendu.

source: Invalid object.
fr_fr: Objet non valide.

source: axes graphics object expected.
fr_fr: Un objet graphique de type axes est attendu.

source: Invalid Graphics object type name:
fr_fr: Nom de type d'objet graphique non valide :

source: Parent directory does not exist:
fr_fr: Le répertoire parent n'existe pas :

source: Unsupported format:
fr_fr: Format non pris en charge :

source: Impossible to save image.
fr_fr: Impossible de sauvegarder l'image.

source: RGB triplet expected.
fr_fr: Un triplet RGB est attendu.

source: One color specification or use the 'multiple' option expected.
fr_fr: Une spécification de couleur ou l'utilisation de l'option 'multiple' est attendue.

source: Valid color expected.
fr_fr: Une couleur valide est attendue.

source: Invalid #2 argument: 'one', 'multiple' expected.
fr_fr: Argument #2 invalide : 'one', 'multiple' attendu.

source: RGB triplet, a character vector, or a string scalar, cell of row characters expected.
fr_fr: Un triplet RGB, un vecteur de caractères ou une chaîne de caractères, une cellule de caractères attendue.

source: Use the 'multiple' option or specify one color specification.
fr_fr: Utilisez l'option 'multiple' ou spécifiez une spécification de couleur.

source: Valid color string expected.
fr_fr: Une chaîne de couleur valide est attendue.

source: Mx3 matrix of RGB triplets, a character vector, a cell-array of character vectors or a string array expected.
fr_fr: Matrice Mx3 de triplets RGB, un vecteur de caractères, un tableau de cellules de vecteurs de caractères ou un tableau de chaînes attendu.

source: Size mismatch on arguments to arithmetic operator
fr_fr: Taille incompatible des arguments pour l'opérateur arithmétique

source: Units not managed:
fr_fr: Unités non gérées :

source: Expecting a color spec: either a color name or a 3-vector or RGB values
fr_fr: Attente d'une spécification de couleur : soit un nom de couleur, soit un vecteur 3D, soit des valeurs RGB

source: Expect an m x 3 matrix for color orders.
fr_fr: Attendez-vous à une matrice m x 3 pour les ordres de couleur.

source: Color vector must be between 0 and 1.
fr_fr: Le vecteur de couleur doit être compris entre 0 et 1.

source: Please close some graphical windows.
fr_fr: Veuillez fermer certaines fenêtres graphiques.

source: Expecting handle for property.
fr_fr: Attente d'un handle pour la propriété.

source: Deleted graphics_object
fr_fr: Objet graphique supprimé

source: Invalid figure id.
fr_fr: ID de figure non valide.

source: The value must be a '|' delimited character vector, string array, or cell array of character vectors.
fr_fr: La valeur doit être un vecteur de caractères délimité par '|', un tableau de chaînes ou un tableau de cellules de vecteurs de caractères.

source: Out of bounds.
fr_fr: Hors limites.

source: Nx3 dimensional matrix expected for 'Vertices'.
fr_fr: Matrice de dimension Nx3 attendue pour 'Vertices'.

source: Invalid Face Colorspec.
fr_fr: Couleur de face non valide.

source: Invalid FaceVertexCData parameter with FaceColor to 'flat'.
fr_fr: Paramètre FaceVertexCData non valide avec FaceColor à 'flat'.

source: Invalid FaceVertexCData parameter with FaceColor to 'interp'.
fr_fr: Paramètre FaceVertexCData non valide avec FaceColor à 'interp'.

source: Invalid EdgeColor parameter.
fr_fr: Paramètre EdgeColor non valide.

source: Invalid FaceVertexCData parameter with EgdeColor to 'flat'.
fr_fr: Paramètre FaceVertexCData non valide avec EgdeColor à 'flat'.

source: Invalid FaceVertexCData parameter with EgdeColor to 'interp'.
fr_fr: Paramètre FaceVertexCData non valide avec EgdeColor à 'interp'.

source: Vertex Index out of bounds.
fr_fr: Indice de sommet hors limites.

source: Expecting a string for property.
fr_fr: Attente d'une chaîne pour la propriété.

source: Illegal selection for property.
fr_fr: Sélection illégale pour la propriété.

source: &Close
fr_fr: &Fermer

source: Unrecognized property '%s' for class '%s'.
fr_fr: Propriété non reconnue '%s' pour la classe '%s'.

source: Did you mean:
fr_fr: Vouliez-vous dire :

source: Restricted string/scalar default failed lookup of:
fr_fr: Échec de la recherche par défaut de chaînes/scalaires restreints :

source: Restricted string/color default failed lookup of:
fr_fr: Échec de la recherche par défaut de chaînes/couleurs restreints :

source: Set restricted string default failed lookup of:
fr_fr: Échec de la recherche par défaut de chaînes restreints :

source: Deleted graphics_object
fr_fr: Objet graphique supprimé

source: with properties:
fr_fr: avec les propriétés :

source: A valid filename expected.
fr_fr: Un nom de fichier valide est attendu.

source: Impossible read image file.
fr_fr: Impossible de lire le fichier image.

source: Unsupported file image format.
fr_fr: Format d'image de fichier non pris en charge.

source: Colormap should have three columns.
fr_fr: La carte de couleurs doit avoir trois colonnes.

source: Wrong size for AlphaMap.
fr_fr: Taille incorrecte pour AlphaMap.

source: Image must be double, single, logical or uint8 type.
fr_fr: L'image doit être de type double, single, logical ou uint8.

source: Unable to determine the file format from the file name.
fr_fr: Impossible de déterminer le format du fichier à partir du nom du fichier.

source: Not supported format.
fr_fr: Format non pris en charge.

source: Cannot write
fr_fr: Impossible d'écrire

source: Image data must be either MxN or MxNx3.
fr_fr: Les données de l'image doivent être soit MxN soit MxNx3.

source: Cannot save image file
fr_fr: Impossible de sauvegarder le fichier image

source: look and feel not applied.
fr_fr: Apparence et convivialité non appliquées.

source: "stylesheet" expected as first argument.
fr_fr: "stylesheet" attendu comme premier argument.

source: char, cell, or string expected.
fr_fr: Caractère, cellule ou chaîne attendu.

source: Invalid character vector for icon in 'msgbox'.
fr_fr: Vecteur de caractères non valide pour l'icône dans 'msgbox'.

source: Yes
fr_fr: Oui

source: No
fr_fr: Non

source: Cancel
fr_fr: Annuler

source: Execute...
fr_fr: Exécuter...

source: Interpreter currently runs.
fr_fr: L'interpréteur est actuellement en cours d'exécution.

source: Load workspace...
fr_fr: Charger l'espace de travail...

source: Save workspace...
fr_fr: Sauvegarder l'espace de travail...

source: Nelson (*.nh5);;MAT files (*.mat)
fr_fr: Nelson (*.nh5);;Fichiers MAT (*.mat)

source: About Nelson...
fr_fr: À propos de Nelson...

source: Text editor
fr_fr: Éditeur de texte

source: &File
fr_fr: &Fichier

source: &Execute...
fr_fr: &Exécuter...

source: Execute a .m file
fr_fr: Exécuter un fichier .m

source: &Load Workspace...
fr_fr: &Charger l'espace de travail...

source: Load a .nh5 file
fr_fr: Charger un fichier .nh5

source: &Save Workspace...
fr_fr: &Sauvegarder l'espace de travail...

source: Save a .nh5 file
fr_fr: Sauvegarder un fichier .nh5

source: &Change current directory
fr_fr: &Changer le répertoire courant

source: Change current directory
fr_fr: Changer le répertoire courant

source: &Display current directory
fr_fr: &Afficher le répertoire courant

source: Display current directory
fr_fr: Afficher le répertoire courant

source: E&xit
fr_fr: Quitter

source: Exit the application
fr_fr: Quitter l'application

source: &Edit
fr_fr: &Édition

source: C&ut
fr_fr: &Couper

source: Cut
fr_fr: Couper

source: &Copy
fr_fr: &Copier

source: Copy
fr_fr: Copier

source: &Paste
fr_fr: &Coller

source: Paste
fr_fr: Coller

source: &Select all
fr_fr: &Sélectionner tout

source: Select all
fr_fr: Sélectionner tout

source: &Empty clipboard
fr_fr: &Vider le presse-papiers

source: Empty clipboard
fr_fr: Vider le presse-papiers

source: Clear c&onsole
fr_fr: Effacer la c&onsole

source: Clear console
fr_fr: Effacer la console

source: &Help
fr_fr: &Aide

source: Nelson &website
fr_fr: Site web de Nelson

source: Nelson website
fr_fr: Site web de Nelson

source: B&ugs and Requests
fr_fr: B&ogues et demandes

source: Bugs and Requests
fr_fr: Bogues et demandes

source: &About
fr_fr: À propos de

source: About
fr_fr: À propos de

source: &Text editor
fr_fr: Éditeur de &texte

source: Close confirmation
fr_fr: Confirmation de fermeture

source: Are you sure to quit?
fr_fr: Êtes-vous sûr de vouloir quitter ?

source: Help on Selection
fr_fr: Aide sur la sélection

source: Select All
fr_fr: Sélectionner tout

source: Clear Command Window
fr_fr: Effacer la fenêtre de commande

source: Stop execution
fr_fr: Arrêter l'exécution

source: not defined.
fr_fr: non défini.

source: handle expected.
fr_fr: manipulateur attendu.

source: Handles being catenated have incompatible classes.
fr_fr: Les manipulateurs qui sont concaténés ont des classes incompatibles.

source: Scalar value expected.
fr_fr: Valeur scalaire attendue.

source: Unsupported value type.
fr_fr: Type de valeur non pris en charge.

source: Wrong text encoding parameter.
fr_fr: Mauvais paramètre de codage texte.

source: Invalid parameter.
fr_fr: Paramètre non valide.

source: 'TextEncoding' expected.
fr_fr: 'TextEncoding' attendu.

source: Valid deflate value expected.
fr_fr: Valeur de compression 'deflate' valide attendue.

source: Valid filename expected.
fr_fr: Nom de fichier valide attendu.

source: Valid data set name expected.
fr_fr: Nom de jeu de données valide attendu.

source: ChunkSize required.
fr_fr: ChunkSize requis.

source: FillValue and data set class must be same.
fr_fr: FillValue et la classe du jeu de données doivent être identiques.

source: Length ChunkSize and Size must be equal.
fr_fr: Les longueurs de ChunkSize et Size doivent être égales.

source: ChunkSize larger than Size.
fr_fr: ChunkSize plus grand que Size.

source: ChunkSize expected.
fr_fr: ChunkSize attendu.

source: HDF5 format file expected.
fr_fr: Fichier au format HDF5 attendu.

source: Open file failed.
fr_fr: Échec de l'ouverture du fichier.

source: data set already exists.
fr_fr: Le jeu de données existe déjà.

source: H5Screate_simple fails.
fr_fr: Échec de H5Screate_simple.

source: H5Pset_layout fails.
fr_fr: Échec de H5Pset_layout.

source: H5Pset_chunk fails.
fr_fr: Échec de H5Pset_chunk.

source: H5Dcreate fails.
fr_fr: Échec de H5Dcreate.

source: Invalid file format.
fr_fr: Format de fichier non valide.

source: Variable not found:
fr_fr: Variable non trouvée :

source: Cannot read variable:
fr_fr: Impossible de lire la variable :

source: Cannot read attribute.
fr_fr: Impossible de lire l'attribut.

source: Cannot read data set.
fr_fr: Impossible de lire le jeu de données.

source: Valid location expected.
fr_fr: Emplacement valide attendu.

source: Valid attribute name expected.
fr_fr: Nom d'attribut valide attendu.

source: file does not exist.
fr_fr: Le fichier n'existe pas.

source: Specified HDF5 object location could not be opened.
fr_fr: L'emplacement d'objet HDF5 spécifié n'a pas pu être ouvert.

source: Attribute name not found.
fr_fr: Nom d'attribut non trouvé.

source: Attribute have an invalid type.
fr_fr: L'attribut a un type non valide.

source: Impossible to open hdf5 file.
fr_fr: Impossible d'ouvrir le fichier hdf5.

source: Impossible to read dimensions and maximum size of data set.
fr_fr: Impossible de lire les dimensions et la taille maximale du jeu de données.

source: Invalid variable name:
fr_fr: Nom de variable non valide :

source: Variable does not exist:
fr_fr: La variable n'existe pas :

source: Cannot replace file
fr_fr: Impossible de remplacer le fichier

source: Invalid file version.
fr_fr: Version de fichier non valide.

source: Cannot save variable:
fr_fr: Impossible de sauvegarder la variable :

source: Invalid function handle.
fr_fr: Handle de fonction non valide.

source: Valid text encoding expected.
fr_fr: Codage texte valide attendu.

source: Specified HDF5 object location does not exist.
fr_fr: L'emplacement d'objet HDF5 spécifié n'existe pas.

source: Could not delete existing attribute.
fr_fr: Impossible de supprimer l'attribut existant.

source: Could not check if attribute exists.
fr_fr: Impossible de vérifier si l'attribut existe.

source: Cannot write attribute.
fr_fr: Impossible d'écrire l'attribut.

source: Cannot open HDF5 file expected.
fr_fr: Impossible d'ouvrir le fichier HDF5 attendu.

source: Cannot create data set.
fr_fr: Impossible de créer le jeu de données.

source: Cannot write data set.
fr_fr: Impossible d'écrire le jeu de données.

source: row vector characters expected.
fr_fr: Vecteur de caractères ligne attendu.

source: Complex number not supported.
fr_fr: Nombre complexe non pris en charge.

source: String class not supported.
fr_fr: Classe de chaîne non prise en charge.
