Repository: nelson-lang/nelson
Catalog: locale/*/LC_MESSAGES/nelson.po
Languages: fr_fr

source: A and E must have the same size.
fr_fr: A et E doivent avoir la même taille.

source: all arguments must be numeric matrices.
fr_fr: tous les arguments doivent être des matrices numériques.

source: Input Data
fr_fr: Données d'entrée

source: Filtered Data
fr_fr: Données filtrées

source: border option not yet implemented.
fr_fr: l'option de bordure n'est pas encore implémentée.

source: initialMagnification option not yet implemented.
fr_fr: l'option initialMagnification n'est pas encore implémentée.

source: labels values already defined.
fr_fr: les valeurs des étiquettes sont déjà définies.

source: explode values already defined.
fr_fr: les valeurs de l'éclatement sont déjà définies.

source: Size mismatch of X and labels on arguments.
fr_fr: Taille incorrecte de X et des étiquettes sur les arguments.

source: Size mismatch of X and explode on arguments.
fr_fr: Taille incorrecte de X et de l'éclatement sur les arguments.

source: explode or labels values expected.
fr_fr: des valeurs d'éclatement ou d'étiquettes sont attendues.

source: Wrong size for input arguments: vectors with the same size expected.
fr_fr: Taille incorrecte des arguments d'entrée : des vecteurs de la même taille sont attendus.

source: Two indices expected.
fr_fr: Deux indices attendus.

source: Illegal indexing structure argument: type () expected.
fr_fr: Argument de structure d'indexation illégal : type () attendu.

source: Three input arguments expected to return three output arguments.
fr_fr: Trois arguments d'entrée sont attendus pour retourner trois arguments de sortie.

source: File Browser
fr_fr: Explorateur de fichiers

source: New
fr_fr: Nouveau

source: Directory
fr_fr: Répertoire

source: Show in explorer
fr_fr: Afficher dans l'explorateur

source: Delete
fr_fr: Supprimer

source: Run
fr_fr: Exécuter

source: Rename
fr_fr: Renommer

source: Refresh
fr_fr: Actualiser

source: Open with Default Application
fr_fr: Ouvrir avec l'application par défaut

source: Indicate files not in path
fr_fr: Indiquer les fichiers qui ne sont pas dans le chemin d'accès

source: Add to Path
fr_fr: Ajouter au chemin d'accès

source: Remove to Path
fr_fr: Supprimer du chemin d'accès

source: Collapse All
fr_fr: Réduire tout

source: Rename Directory
fr_fr: Renommer le répertoire

source: Rename File
fr_fr: Renommer le fichier

source: New Name:
fr_fr: Nouveau nom :

source: Create New Directory
fr_fr: Créer un nouveau répertoire

source: New Directory Name:
fr_fr: Nom du nouveau répertoire :

source: New script name:
fr_fr: Nom du nouveau script :

source: New function name:
fr_fr: Nom de la nouvelle fonction :

source: History Browser
fr_fr: Historique du navigateur

source: Execute selection
fr_fr: Exécuter la sélection

source: Clear all
fr_fr: Tout effacer

source: Delete selection
fr_fr: Supprimer la sélection

source: Copy selection
fr_fr: Copier la sélection

source: Create Script
fr_fr: Créer un script

source: Are you certain you wish to clear the history?
fr_fr: Êtes-vous certain de vouloir effacer l'historique ?

source: Please note that this action cannot be undone.
fr_fr: Veuillez noter que cette action est irréversible.

source: Clear history
fr_fr: Effacer l'historique

source: &Windows
fr_fr: &Fenêtres

source: &Layout
fr_fr: &Disposition

source: Default
fr_fr: Défaut

source: &Command line only
fr_fr: &Ligne de commande uniquement

source: &Two columns
fr_fr: &Deux colonnes

source: &History browser
fr_fr: &Navigateur d'historique

source: History browser
fr_fr: Navigateur d'historique

source: &File browser
fr_fr: &Explorateur de fichiers

source: File browser
fr_fr: Explorateur de fichiers

source: &Workspace browser
fr_fr: &Navigateur de l'espace de travail

source: Workspace browser
fr_fr: Navigateur de l'espace de travail

source: Workspace Browser
fr_fr: Navigateur de l'espace de travail

source: Save As
fr_fr: Enregistrer sous

source: Plot Gallery
fr_fr: Galerie de graphiques

source: Value
fr_fr: Valeur

source: Scope
fr_fr: Portée

source: Rename Variable
fr_fr: Renommer la variable

source: Enter a new name:
fr_fr: Entrer un nouveau nom :

source: Save Variable As
fr_fr: Enregistrer la variable sous

source: Nelson Files (*.nh5)
fr_fr: Fichiers Nelson (*.nh5)

source: Not yet implemented.
fr_fr: Pas encore implémenté.

source: single or double type expected.
fr_fr: Type simple ou double attendu.

source: Input to LU must not contain NaN or Inf.
fr_fr: L'entrée de LU ne doit pas contenir NaN ou Inf.

source: Pole locations are in more that 10% error
fr_fr: Les emplacements des pôles comportent une erreur de plus de 10%

source: first input argument must be one of the following: 'tan', 'cos', 'sin', 'square', or 'pulse'.
fr_fr: Le premier argument d'entrée doit être l'un des suivants : 'tan', 'cos', 'sin', 'square' ou 'pulse'.

source: All elements of cell array must have same type.
fr_fr: Tous les éléments du tableau de cellules doivent avoir le même type.

source: All structures must have same fieldnames
fr_fr: Toutes les structures doivent avoir les mêmes noms de champs

source: all arguments must numeric matrix.
fr_fr: tous les arguments doivent être des matrices numériques.

source: warning(query) does not require an second argument.
fr_fr: warning(query) ne nécessite pas de second argument.

source: 'toplevel' expected as third argumnent.
fr_fr: 'toplevel' attendu comme troisième argument.

source: border option not yet implement.
fr_fr: l'option de bordure n'est pas encore implémentée.

source: initialMagnification option not yet implement.
fr_fr: l'option initialMagnification n'est pas encore implémentée.

source: Wrong size for input arguments: vectors with same size expected.
fr_fr: Taille incorrecte des arguments d'entrée : des vecteurs de même taille sont attendus.

source: Lexical error unterminated character array
fr_fr: Erreur lexicale : tableau de caractères non terminé

source: Three input arguments expected to return three ouput arguments.
fr_fr: Trois arguments d'entrée sont attendus pour retourner trois arguments de sortie.

source: No compiler configured. doc supported_compiler for more information.
fr_fr: Aucun compilateur configuré. doc support_compiler pour plus d'informations.

source: Field
fr_fr: Champ

source: Method
fr_fr: Methode

source: Property
fr_fr: Propriété
