Repository: nelson-lang/nelson
Catalog: locale/*/LC_MESSAGES/nelson.po
Languages: fr_fr

source: Wrong size for argument #2. double matrix expected.
fr_fr: Taille incorrecte pour l'argument #2. Matrice de nombres réels attendue.

source: Wrong type for argument #1: sparse double expected.
fr_fr: Type incorrect pour l'argument #1 : tableau creux de nombres réels attendu.

source: Wrong type for argument #2: sparse double expected.
fr_fr: Type incorrect pour l'argument #2 : tableau creux de nombres réels attendu.

source: Wrong type for argument #1: sparse expected.
fr_fr: Type incorrect pour l'argument #1 : tableau creux attendu.

source: Wrong type for argument #2: sparse expected.
fr_fr: Type incorrect pour l'argument #2 : tableau creux attendu.

source: Wrong type for argument #1: single expected.
fr_fr: Type incorrect pour l'argument #1 : nombre réel simple précision attendu.

source: Wrong type for argument #2: single expected.
fr_fr: Type incorrect pour l'argument #2 : nombre réel simple précision attendu.

source: Wrong size for argument #1. single matrix expected.
fr_fr: Taille incorrecte pour l'argument #1. Matrice de nombres réels simple précision attendue.

source: Wrong size for argument #2. single matrix expected.
fr_fr: Taille incorrecte pour l'argument #2. Matrice de nombres réels simple précision attendue.

source: Wrong type for argument #1. integer expected.
fr_fr: Type incorrect pour l'argument #1 : entier attendu.

source: Wrong type for argument #2. integer expected.
fr_fr: Type incorrect pour l'argument #2 : entier attendu.

source: Wrong size for argument #1. integer matrix expected.
fr_fr: Taille incorrecte pour l'argument #1. Matrice d'entiers attendue.

source: Wrong size for argument #2. integer matrix expected.
fr_fr: Taille incorrecte pour l'argument #2. Matrice d'entiers attendue.

source: Wrong size for argument #1. integer n-d matrix expected.
fr_fr: Taille incorrecte pour l'argument #1. Matrice d'entiers de dimension n attendue.

source: Wrong size for argument #2. integer n-d matrix expected.
fr_fr: Taille incorrecte pour l'argument #2. Matrice d'entiers de dimension n attendue.

source: Same integer type expected.
fr_fr: Le même type d'entier est attendu.

source: Wrong type for argument #1. int8 expected.
fr_fr: Type incorrect pour l'argument #1 : int8 attendu.

source: Wrong type for argument #1. uint8 expected.
fr_fr: Type incorrect pour l'argument #1 : uint8 attendu.

source: Wrong type for argument #1. int16 expected.
fr_fr: Type incorrect pour l'argument #1 : int16 attendu.

source: Wrong type for argument #1. uint16 expected.
fr_fr: Type incorrect pour l'argument #1 : uint16 attendu.

source: Wrong type for argument #1. int32 expected.
fr_fr: Type incorrect pour l'argument #1 : int32 attendu.

source: Wrong type for argument #1. uint32 expected.
fr_fr: Type incorrect pour l'argument #1 : uint32 attendu.

source: Wrong type for argument #1. int64 expected.
fr_fr: Type incorrect pour l'argument #1 : int64 attendu.

source: Wrong type for argument #1. uint64 expected.
fr_fr: Type incorrect pour l'argument #1 : uint64 attendu.

source: Wrong type for argument #1: function handle expected.
fr_fr: Type incorrect pour l'argument #1 : handle de fonction attendu.

source: Wrong type for argument #%d: function handle expected.
fr_fr: Type incorrect pour l'argument #%d : handle de fonction attendu.

source: Wrong type for argument #1: string or function handle expected.
fr_fr: Type incorrect pour l'argument #1 : chaîne de caractères ou handle de fonction attendu.

source: Wrong type for argument #1: string or double expected.
fr_fr: Type incorrect pour l'argument #1 : chaîne de caractères ou nombre réel attendu.

source: Wrong type for argument #1: string or cell expected.
fr_fr: Type incorrect pour l'argument #1 : chaîne de caractères ou cellule attendue.

source: Wrong type for argument #2: string or cell expected.
fr_fr: Type incorrect pour l'argument #2 : chaîne de caractères ou cellule attendue.

source: Wrong type for #1 argument: numeric value expected.
fr_fr: Type incorrect pour l'argument #1 : valeur numérique attendue.

source: Wrong type for #2 argument: numeric value expected.
fr_fr: Type incorrect pour l'argument #2 : valeur numérique attendue.

source: Wrong type for argument #1. cell expected.
fr_fr: Type incorrect pour l'argument #1 : cellule attendue.

source: Wrong type for argument #2. cell expected.
fr_fr: Type incorrect pour l'argument #2 : cellule attendue.

source: Wrong type for argument #2. struct expected.
fr_fr: Type incorrect pour l'argument #2 : structure attendue.

source: Wrong types for inputs arguments.
fr_fr: Types incorrects pour les arguments d'entrée.

source: Wrong type: #1 argument.
fr_fr: Type incorrect pour l'argument #1.

source: Wrong type: #2 argument.
fr_fr: Type incorrect pour l'argument #2.

source: Wrong type for input arguments: double expected.
fr_fr: Type incorrect pour les arguments d'entrée : nombre réel attendu.

source: Wrong type for input arguments: single expected.
fr_fr: Type incorrect pour les arguments d'entrée : nombre réel simple précision attendu.

source: logical expected.
fr_fr: Valeur logique attendue.

source: struct expected.
fr_fr: Structure attendue.

source: class expected.
fr_fr: Classe attendue.

source: cell of strings expected.
fr_fr: Cellule de chaînes de caractères attendue.

source: type reserved.
fr_fr: Type réservé.

source: Wrong size for input arguments: full matrix expected.
fr_fr: Taille incorrecte pour les arguments d'entrée : matrice complète attendue.

source: Wrong size for input arguments: 2D matrix expected.
fr_fr: Taille incorrecte pour les arguments d'entrée : matrice 2D attendue.

source: Wrong size for argument #1: full matrix expected.
fr_fr: Taille incorrecte pour l'argument #1 : matrice complète attendue.

source: Wrong size for argument #1: 2D matrix expected.
fr_fr: Taille incorrecte pour l'argument #1 : matrice 2D attendue.

source: Wrong size for argument #1: scalar expected.
fr_fr: Taille incorrecte pour l'argument #1 : scalaire attendu.

source: Wrong size for argument #2: scalar expected.
fr_fr: Taille incorrecte pour l'argument #2 : scalaire attendu.

source: Wrong size for argument #%d: scalar expected.
fr_fr: Taille incorrecte pour l'argument #%d : scalaire attendu.

source: Wrong size for #1 argument. a scalar or a row vector expected.
fr_fr: Taille incorrecte pour l'argument #1 : scalaire ou vecteur ligne attendu.

source: Wrong size for #1 argument. [a, b] expected.
fr_fr: Taille incorrecte pour l'argument #1 : [a, b] attendu.

source: Wrong size for #2 argument. [a, b] expected.
fr_fr: Taille incorrecte pour l'argument #2 : [a, b] attendu.

source: Wrong size for #1 argument. row vector expected.
fr_fr: Taille incorrecte pour l'argument #1 : vecteur ligne attendu.

source: Wrong size for #2 argument. row vector expected.
fr_fr: Taille incorrecte pour l'argument #2 : vecteur ligne attendu.

source: Same size expected.
fr_fr: Taille attendue identique.

source: A scalar expected.
fr_fr: Un scalaire est attendu.

source: Wrong value for argument #1. Scalar integer value expected.
fr_fr: Mauvaise valeur pour l'argument #1. Un scalaire entier est attendu.

source: Wrong value for argument #2. Scalar integer value expected.
fr_fr: Mauvaise valeur pour l'argument #2. Un scalaire entier est attendu.

source: Wrong value for argument #%d. Scalar integer value expected.
fr_fr: Mauvaise valeur pour l'argument #%d. Un scalaire entier est attendu.

source: Wrong value for argument #1. A finite scalar integer value expected.
fr_fr: Mauvaise valeur pour l'argument #1. Un scalaire entier fini est attendu.

source: Wrong value for argument #2. A finite scalar integer value expected.
fr_fr: Mauvaise valeur pour l'argument #2. Un scalaire entier fini est attendu.

source: Wrong value for argument #%d. A finite scalar integer value expected.
fr_fr: Mauvaise valeur pour l'argument #%d. Un scalaire entier fini est attendu.

source: Wrong value for argument #1. A finite vector of integer values expected.
fr_fr: Mauvaise valeur pour l'argument #1. Un vecteur fini de valeurs entières est attendu.

source: Wrong value for #1: Invalid size.
fr_fr: Mauvaise valeur pour #1 : Taille invalide.

source: Wrong value for #2: Invalid size.
fr_fr: Mauvaise valeur pour #2 : Taille invalide.

source: Wrong value for #%d: Invalid size.
fr_fr: Mauvaise valeur pour #%d : Taille invalide.

source: Wrong value for #1 argument. Positive value expected.
fr_fr: Mauvaise valeur pour l'argument #1. Une valeur positive est attendue.

source: Wrong value for #%d argument. Positive value expected.
fr_fr: Mauvaise valeur pour l'argument #%d. Une valeur positive est attendue.

source: Wrong value for #1 argument. 'a' must be higher than 'b' ([a,b]).
fr_fr: Mauvaise valeur pour l'argument #1. 'a' doit être supérieur à 'b' ([a,b]).

source: Wrong value for #2 argument. 'a' must be higher than 'b' ([a,b]).
fr_fr: Mauvaise valeur pour l'argument #2. 'a' doit être supérieur à 'b' ([a,b]).

source: Interrupt (ctrl-c) encountered.
fr_fr: Interruption (ctrl-c) détectée.

source: Warning! One or more outputs not assigned in call.
fr_fr: Attention ! Un ou plusieurs résultats non assignés dans l'appel.

source: Dimensions concatenated are not consistent.
fr_fr: Dimensions concaténées non cohérentes.

source: Fieldnames in structs must match.
fr_fr: Les noms de champ dans les structures doivent correspondre.

source: Wrong type for argument #1: handle expected.
fr_fr: Type incorrect pour l'argument #1 : un identifiant (handle) est attendu.

source: Wrong type for argument #2: handle expected.
fr_fr: Type incorrect pour l'argument #2 : un identifiant (handle) est attendu.

source: Wrong type for argument #3: handle expected.
fr_fr: Type incorrect pour l'argument #3 : un identifiant (handle) est attendu.

source: Wrong type for argument #%d: handle expected.
fr_fr: Type incorrect pour l'argument #%d : un identifiant (handle) est attendu.

source: Wrong type for argument #1: graphics object expected.
fr_fr: Type incorrect pour l'argument #1 : un objet graphique est attendu.

source: Wrong type for argument #2: graphics object expected.
fr_fr: Type incorrect pour l'argument #2 : un objet graphique est attendu.

source: Wrong type for argument #3: graphics object expected.
fr_fr: Type incorrect pour l'argument #3 : un objet graphique est attendu.

source: Wrong type for argument #%d: graphics object expected.
fr_fr: Type incorrect pour l'argument #%d : un objet graphique est attendu.

source: Invalid Graphics Object.
fr_fr: Objet graphique invalide.

source: Builtin
fr_fr: Intégré

source: File or directory
fr_fr: Fichier ou répertoire

source: assert_checkerror fails.
fr_fr: Échec de l'assertion checkerror.

source: Assertion failed: expected (%g) and computed (%g) values are different.
fr_fr: Échec de l'assertion : les valeurs attendues (%g) et calculées (%g) sont différentes.

source: assert_isfalse fails.
fr_fr: Échec de l'assertion isfalse.

source: Your error message
fr_fr: Votre message d'erreur

source: assert_istrue fails.
fr_fr: Échec de l'assertion istrue.

source: Audio data must be real and floating point.
fr_fr: Les données audio doivent être réelles et en virgule flottante.

source: Sample rate FS must be a positive number.
fr_fr: Le taux d'échantillonnage FS doit être un nombre positif.

source: NBITS must be 8, 16, or 24.
fr_fr: NBITS doit être 8, 16 ou 24.

source: Argument #1: Requires 2-D values only.
fr_fr: Argument #1 : nécessite uniquement des valeurs en 2D.

source: RANGE must be a 2-element [YMIN, YMAX] vector.
fr_fr: RANGE doit être un vecteur à 2 éléments [YMIN, YMAX].

source: Welcome to COM Interface for Nelson !
fr_fr: Bienvenue dans l'interface COM pour Nelson !

source: Excel application expected.
fr_fr: Application Excel attendue.

source: Format not found.
fr_fr: Format non trouvé.

source: A valid range expected.
fr_fr: Une plage valide est attendue.

source: A scalar integer value expected.
fr_fr: Une valeur scalaire entière est attendue.

source: An absolute path expected.
fr_fr: Un chemin absolu est attendu.

source: Sheet name not found.
fr_fr: Nom de feuille non trouvé.

source: No empty matrix expected.
fr_fr: Aucune matrice vide n'est attendue.

source: Only 2D matrix supported.
fr_fr: Seules les matrices 2D sont prises en charge.

source: "%s" is not a recognized parameter.
fr_fr: "%s" n'est pas un paramètre reconnu.

source: Invalid value for "%s" field.
fr_fr: Valeur invalide pour le champ "%s".

source: String or characters expected.
fr_fr: Chaîne de caractères ou caractères attendus.

source: Argument #2 must contain a valid string var, builtin, dir or file expected.
fr_fr: L'argument #2 doit contenir une chaîne de caractères valide, un intégré, un répertoire ou un fichier est attendu.

source: An expression after +
fr_fr: Une expression après +

source: Invalid argument: rows, descend, ascend expected.
fr_fr: Argument invalide : lignes, descend, ascend attendus.

source: Invalid argument #2: scalar integer value expected.
fr_fr: Argument invalide #2 : un scalaire entier est attendu.

source: Invalid argument: descend, ascend expected.
fr_fr: Argument invalide : descend, ascend attendus.

source: Check for incorrect argument data type or missing argument in call to function %s.
fr_fr: Vérifiez le type de données d'argument incorrect ou l'argument manquant dans l'appel à la fonction %s.

source: Cannot convert missing element.
fr_fr: Impossible de convertir l'élément manquant.

source: Cell must be string scalars or character arrays.
fr_fr: La cellule doit contenir des scalaires de chaînes de caractères ou des tableaux de caractères.

source: Matrix 2D expected.
fr_fr: Matrice 2D attendue.

source: Invalid Input struct expected.
fr_fr: Une structure d'entrée invalide est attendue.

source: Wrong numbers of input arguments.
fr_fr: Nombre incorrect d'arguments d'entrée.

source: Input should be a string or character array.
fr_fr: L'entrée doit être une chaîne de caractères ou un tableau de caractères.

source: Conversion to struct to function_handle is not possible.
fr_fr: La conversion en structure en tant que function_handle n'est pas possible.

source: Invalid name-value argument: %s.
fr_fr: Argument nom-valeur invalide : %s.

source: CMake not found.
fr_fr: CMake non trouvé.

source: Environment variable does not exist.
fr_fr: La variable d'environnement n'existe pas.

source: Does not exist.
fr_fr: N'existe pas.

source: A valid destination directory expected.
fr_fr: Un répertoire de destination valide est attendu.

source: Valid files list expected.
fr_fr: Une liste de fichiers valide est attendue.

source: Invalid directory.
fr_fr: Répertoire invalide.

source: Invalid builtin list.
fr_fr: Liste de builtins invalide.

source: #2 input argument: A string or cell of strings expected.
fr_fr: Argument d'entrée #2 : une chaîne de caractères ou une cellule de chaînes est attendue.

source: At least 4 input arguments expected.
fr_fr: Au moins 4 arguments d'entrée sont attendus.

source: A valid destination library name expected.
fr_fr: Un nom de bibliothèque de destination valide est attendu.

source: A valid list of c/cpp files expected.
fr_fr: Une liste valide de fichiers c/cpp est attendue.

source: A valid list of includes directories expected.
fr_fr: Une liste valide de répertoires d'inclusion est attendue.

source: A valid list of define expected.
fr_fr: Une liste valide de définitions est attendue.

source: A valid list of external libraries expected.
fr_fr: Une liste valide de bibliothèques externes est attendue.

source: A valid build configuration value expected.
fr_fr: Une valeur de configuration de build valide est attendue.

source: A valid c_flags configuration value expected.
fr_fr: Une valeur de configuration c_flags valide est attendue.

source: A valid cxx_flags configuration value expected.
fr_fr: Une valeur de configuration cxx_flags valide est attendue.

source: Template file is missing.
fr_fr: Le fichier modèle est manquant.

source: CMakeLists.txt is missing.
fr_fr: CMakeLists.txt est manquant.

source: Vswhere not found.
fr_fr: Vswhere non trouvé.

source: Cannot read vswhere result.
fr_fr: Impossible de lire le résultat de vswhere.

source: Invalid type for #2 input argument: doublePtr expected.
fr_fr: Type invalide pour l'argument d'entrée #2 : doublePtr est attendu.

source: Incompatible types double --> int32
fr_fr: Types incompatibles double --> int32

source: Incompatible types doublePtr --> int32Ptr
fr_fr: Types incompatibles doublePtr --> int32Ptr

source: N must be a scalar if DIM is specified.
fr_fr: N doit être un scalaire si DIM est spécifié.

source: All values of N must be integer values.
fr_fr: Toutes les valeurs de N doivent être des entiers.

source: N must be a vector.
fr_fr: N doit être un vecteur.

source: #1 input argument: must be real positive integer values.
fr_fr: Argument d'entrée #1 : doit être des valeurs entières positives réelles.

source: Wrong value for argument #1: finite value expected.
fr_fr: Mauvaise valeur pour l'argument #1 : une valeur finie est attendue.

source: Wrong value for argument #1: real value expected.
fr_fr: Mauvaise valeur pour l'argument #1 : une valeur réelle est attendue.

source: N must be 2^k*p, with p = 1, 12, 20.
fr_fr: N doit être de la forme 2^k*p, avec p = 1, 12, 20.

source: Last element of input column does not match first element of input row.
fr_fr: Le dernier élément de la colonne d'entrée ne correspond pas au premier élément de la ligne d'entrée.

source: #2 argument must be double or single.
fr_fr: L'argument #2 doit être de type double ou single.

source: Integer-valued index argument expected.
fr_fr: Un argument d'indice à valeurs entières est attendu.

source: dimensions must be an integer vector.
fr_fr: les dimensions doivent être un vecteur d'entiers.

source: A numeric 2-D matrix expected.
fr_fr: Une matrice 2-D numérique est attendue.

source: tolerance must be a real scalar.
fr_fr: la tolérance doit être un scalaire réel.

source: normest did not converge for %d iterations with tolerance %g
fr_fr: normest n'a pas convergé en %d itérations avec une tolérance de %g

source: Imaginary part is ignored.
fr_fr: La partie imaginaire est ignorée.

source: Indexing arguments must have the same length.
fr_fr: Les arguments d'indexation doivent avoir la même longueur.

source: Indexing arguments are out of range of an array of the given size.
fr_fr: Les arguments d'indexation sont hors de portée d'un tableau de la taille donnée.

source: Input argument must be a vector.
fr_fr: L'argument d'entrée doit être un vecteur.

source: Column wins diagonal conflict.
fr_fr: La colonne remporte le conflit diagonal.

source: nelson_f2c not found.
fr_fr: nelson_f2c introuvable.

source: Input argument #1: existing file expected.
fr_fr: Argument d'entrée #1 : fichier existant attendu.

source: Input argument #2: existing directory expected.
fr_fr: Argument d'entrée #2 : répertoire existant attendu.

source: library fftw not loaded.
fr_fr: bibliothèque fftw non chargée.

source: X must be a vector or matrix.
fr_fr: X doit être un vecteur ou une matrice.

source: All values of DIM must be integer values.
fr_fr: Toutes les valeurs de DIM doivent être des entiers.

source: Too many input arguments.
fr_fr: Trop d'arguments d'entrée.

source: Unknown command option:
fr_fr: Option de commande inconnue :

source: Vector must have 4, 6, or 8 elements.
fr_fr: Le vecteur doit avoir 4, 6 ou 8 éléments.

source: "manual" or "auto" argument expected.
fr_fr: Argument "manual" ou "auto" attendu.

source: Error setting property
fr_fr: Erreur lors du réglage de la propriété

source: "plot" argument expected.
fr_fr: Argument "plot" attendu.

source: Requires a string scalar or a character vector argument.
fr_fr: Nécessite une chaîne de caractères scalaire ou un vecteur de caractères en argument.

source: Invalid LineSpec string.
fr_fr: Chaîne LineSpec invalide.

source: First argument must be an axes object.
fr_fr: Le premier argument doit être un objet axes.

source: Command option must be on or off.
fr_fr: L'option de commande doit être activée ou désactivée.

source: Invalid input arguments.
fr_fr: Arguments d'entrée invalides.

source: Invalid #1 argument: image or filename expected.
fr_fr: Argument #1 invalide : image ou nom de fichier attendu.

source: Invalid #1 argument: image must be uint8, uint16, double, or single.
fr_fr: Argument #1 invalide : l'image doit être uint8, uint16, double ou single.

source: Wrong size for #1 argument: image must be MxN or MxNx3 array.
fr_fr: Taille incorrecte pour l'argument #1 : l'image doit être un tableau MxN ou MxNx3.

source: Invalid colormap.
fr_fr: Colormap invalide.

source: Invalid input argument.
fr_fr: Argument d'entrée invalide.

source: Invalid colormap
fr_fr: Colormap invalide

source: XData must be a vector.
fr_fr: XData doit être un vecteur.

source: YData must be a vector.
fr_fr: YData doit être un vecteur.

source: Unrecognized property.
fr_fr: Propriété non reconnue.

source: Invalid argument detected.
fr_fr: Argument invalide détecté.

source: Displaying real part of complex input.
fr_fr: Affichage de la partie réelle de l'entrée complexe.

source: data %d
fr_fr: données %d

source: Unrecognized location option.
fr_fr: Option de localisation non reconnue.

source: Wrong input arguments.
fr_fr: Mauvais arguments d'entrée.

source: Invalid parameter/value pair arguments.
fr_fr: Arguments de paire paramètre/valeur invalides.

source: struct type expected.
fr_fr: Type struct attendu.

source: Size of data mismatch.
fr_fr: Taille des données incohérente.

source: String color or numeric value expected.
fr_fr: Couleur de chaîne ou valeur numérique attendue.

source: Dimensions do not match.
fr_fr: Les dimensions ne correspondent pas.

source: Not enough input arguments.
fr_fr: Pas assez d'arguments d'entrée.

source: Must be a 3-column colormap matrix.
fr_fr: Doit être une matrice de colormap à 3 colonnes.

source: X must have the same dimensions as Y or be a vector with the same number of rows as Y.
fr_fr: X doit avoir les mêmes dimensions que Y ou être un vecteur avec le même nombre de lignes que Y.

source: X, C arguments must be real.
fr_fr: Les arguments X, C doivent être réels.

source: Z argument must be a matrix.
fr_fr: L'argument Z doit être une matrice.

source: X, Y, Z arguments must be real.
fr_fr: Les arguments X, Y, Z doivent être réels.

source: size(Z, 1) must be the same as length(Y) and size(Z, 2) must be the same as length(X).
fr_fr: size(Z, 1) doit être le même que la longueur de Y et size(Z, 2) doit être le même que la longueur de X.

source: X, Y, and Z must have the same dimensions.
fr_fr: X, Y et Z doivent avoir les mêmes dimensions.

source: X and Y must be vectors and Z must be a matrix.
fr_fr: X et Y doivent être des vecteurs et Z doit être une matrice.

source: X, Y, Z, C arguments must be real.
fr_fr: Les arguments X, Y, Z, C doivent être réels.

source: Z and C must have the same size.
fr_fr: Z et C doivent avoir la même taille.

source: Invalid input argument: numeric value expected.
fr_fr: Argument d'entrée invalide : valeur numérique attendue.

source: Vectors x and y must be the same length.
fr_fr: Les vecteurs x et y doivent avoir la même longueur.

source: Vectors x and z must be the same length.
fr_fr: Les vecteurs x et z doivent avoir la même longueur.

source: last argument must be a string or cell of strings.
fr_fr: Le dernier argument doit être une chaîne de caractères ou une cellule de chaînes de caractères.

source: Invalid input argument: graphics object or text value expected.
fr_fr: Argument d'entrée invalide : objet graphique ou valeur de texte attendu.

source: xlabel needs at least one argument.
fr_fr: xlabel a besoin d'au moins un argument.

source: Invalid output argument.
fr_fr: Argument de sortie invalide.
