Repository: nelson-lang/nelson
Catalog: locale/*/LC_MESSAGES/nelson.po
Languages: fr_fr

source: Unable to convert supplied object to a string.
fr_fr: Impossible de convertir l'objet fourni en chaîne de caractères.

source: Unable to convert supplied object to a single string.
fr_fr: Impossible de convertir l'objet fourni en une seule chaîne de caractères.

source: A cell or string array expected.
fr_fr: Un tableau de cellules ou de chaînes est attendu.

source: A cell of string expected.
fr_fr: Un tableau de cellules de chaînes est attendu.

source: A vector expected.
fr_fr: Un vecteur est attendu.

source: A column vector expected.
fr_fr: Un vecteur colonne est attendu.

source: Number of field names must match number of values in structure constructor.
fr_fr: Le nombre de noms de champs doit correspondre au nombre de valeurs dans le constructeur de structure.

source: ArrayOf dimensions of non-scalar entries must agree in structure construction.
fr_fr: Le tableau des dimensions des entrées non scalaires doit être cohérent dans la construction de structure.

source: Invalid dimensions.
fr_fr: Dimensions invalides.

source: Input must be 2-D
fr_fr: L'entrée doit être en 2D

source: Sparse matrix not managed.
fr_fr: La matrice creuse n'est pas gérée.

source: Argument to diagonal constructor must by a vector!
fr_fr: L'argument du constructeur diagonal doit être un vecteur !

source: Statement A(...) = [] can only contain one non-colon index.
fr_fr: L'instruction A(...) = [] ne peut contenir qu'un seul indice non deux-points.

source: sparse matrices do not support deleting n-dimensional planes - Only 2-D
fr_fr: Les matrices creuses ne prennent pas en charge la suppression de plans en N dimensions - Seulement en 2D

source: Expected a real value scalar.
fr_fr: Un scalaire de valeur réelle est attendu.

source: A real integer value scalar expected.
fr_fr: Un scalaire de valeur entière réelle est attendu.

source: Expected a real valued scalar
fr_fr: Un scalaire de valeur réelle est attendu

source: Index exceeds dimensions.
fr_fr: L'indice dépasse les dimensions.

source: multidimensional indexing (more than 2 dimensions) not legal for sparse arrays
fr_fr: L'indexation multidimensionnelle (plus de 2 dimensions) n'est pas autorisée pour les tableaux creux

source: Expected a function_handle.
fr_fr: Un function_handle est attendu.

source: Expected an graphics object.
fr_fr: Un objet graphique est attendu.

source: Expected an graphics object scalar.
fr_fr: Un scalaire d'objet graphique est attendu.

source: Expected a valid handle.
fr_fr: Un handle valide est attendu.

source: Expected a handle scalar.
fr_fr: Un scalaire de handle est attendu.

source: Expected a handle.
fr_fr: Un handle est attendu.

source: Cannot convert base types to reference types.
fr_fr: Impossible de convertir les types de base en types de référence.

source: Cannot convert handle-arrays to any other type.
fr_fr: Impossible de convertir les tableaux de handles en tout autre type.

source: Cannot convert graphic handle-arrays to any other type.
fr_fr: Impossible de convertir les tableaux de handles graphiques en tout autre type.

source: Cannot convert cell-arrays to any other type.
fr_fr: Impossible de convertir les tableaux de cellules en tout autre type.

source: Cannot convert function_handle to any other type.
fr_fr: Impossible de convertir function_handle en tout autre type.

source: Cannot combine classes with different types.
fr_fr: Impossible de combiner des classes de types différents.

source: Cannot convert class to any other type.
fr_fr: Impossible de convertir une classe en tout autre type.

source: Cannot combine structures with different fields if the combination requires fields to be deleted from one of the structures.
fr_fr: Impossible de combiner des structures avec des champs différents si la combinaison nécessite la suppression de champs dans l'une des structures.

source: Cannot convert struct-arrays to any other type.
fr_fr: Impossible de convertir les tableaux de structures en tout autre type.

source: Cannot convert string-arrays to any other type.
fr_fr: Impossible de convertir les tableaux de chaînes en tout autre type.

source: Cannot make sparse.
fr_fr: Impossible de créer un tableau creux.

source: Cannot make strings or reference types sparse.
fr_fr: Impossible de créer des chaînes ou des types de référence sous forme de tableau creux.

source: Cannot make n-dimensional arrays sparse.
fr_fr: Impossible de créer des tableaux n-dimensionnels sous forme de tableau creux.

source: Cannot dereference a field of a multi-element structure array.
fr_fr: Impossible de déréférencer un champ d'un tableau de structures à plusieurs éléments.

source: getField not supported for sparse arrays.
fr_fr: getField n'est pas pris en charge pour les tableaux creux.

source: Reference to non-existent field
fr_fr: Référence à un champ inexistant

source: Attempt to apply field-indexing to non structure-array object.
fr_fr: Tentative d'application de l'indexation de champ à un objet non tableau de structures.

source: getFieldAsList not supported for sparse arrays.
fr_fr: getFieldAsList n'est pas pris en charge pour les tableaux creux.

source: setField not supported for sparse arrays.
fr_fr: setField n'est pas pris en charge pour les tableaux creux.

source: Cannot apply A.field_name = B to multi-element structure array A.
fr_fr: Impossible d'appliquer A.field_name = B à un tableau de structures A à plusieurs éléments.

source: setFieldAsList not supported for sparse arrays.
fr_fr: setFieldAsList n'est pas pris en charge pour les tableaux creux.

source: Not enough right hand values to satisfy left hand side expression.
fr_fr: Pas assez de valeurs du côté droit pour satisfaire l'expression du côté gauche.

source: insertFieldName not supported for sparse arrays.
fr_fr: insertFieldName n'est pas pris en charge pour les tableaux creux.

source: Illegal argument to Dimensions constructor
fr_fr: Argument illégal pour le constructeur Dimensions

source: Invalid dimension position.
fr_fr: Position de dimension invalide.

source: For colon operator with char operands, first and last operands must be char.
fr_fr: Pour l'opérateur de deux-points avec des opérandes de type char, le premier et le dernier opérande doivent être de type char.

source: Colon operands must be all the same type, or mixed with real double scalar.
fr_fr: Les opérandes des deux-points doivent tous être du même type, ou mélangés avec un scalaire réel double.

source: handle must have a type.
fr_fr: Le handle doit avoir un type.

source: handle must have a pointer.
fr_fr: Le handle doit avoir un pointeur.

source: Cannot apply numeric operation
fr_fr: Impossible d'appliquer l'opération numérique

source: to reference types.
fr_fr: aux types de référence.

source: Same reference type expected.
fr_fr: Le même type de référence est attendu.

source: Cannot apply matrix operation
fr_fr: Impossible d'appliquer l'opération matricielle

source: to N-Dimensional arrays.
fr_fr: aux tableaux N-dimensionnels.

source: Size mismatch on arguments to
fr_fr: Taille incompatible des arguments pour

source: Sparse Function not loaded.
fr_fr: Fonction creuse non chargée.

source: input must be a valid class name.
fr_fr: L'entrée doit être un nom de classe valide.

source: The last argument must be a positive integer.
fr_fr: Le dernier argument doit être un entier positif.

source: The last argument must be a positive integer or 'allows-all-empties'.
fr_fr: Le dernier argument doit être un entier positif ou 'allows-all-empties'.

source: Second argument must be a 'allows-all-empties'.
fr_fr: Le deuxième argument doit être un 'allows-all-empties'.

source: Invalid input argument position.
fr_fr: Position invalide de l'argument d'entrée.

source: Invalid input argument at position %d.
fr_fr: Argument d'entrée invalide à la position %d.

source: Value must be logical.
fr_fr: La valeur doit être logique.

source: Value must be finite.
fr_fr: La valeur doit être finie.

source: Value must not be empty.
fr_fr: La valeur ne doit pas être vide.

source: Value must be logical scalar.
fr_fr: La valeur doit être un scalaire logique.

source: Value must be scalar or empty.
fr_fr: La valeur doit être un scalaire ou vide.

source: Value must be valid variable name.
fr_fr: La valeur doit être un nom de variable valide.

source: Value must be a character vector, string array or cell array of character vectors.
fr_fr: La valeur doit être un vecteur de caractères, un tableau de chaînes ou un tableau de vecteurs de caractères.

source: Value must be a character vector or string scalar.
fr_fr: La valeur doit être un vecteur de caractères ou une chaîne scalaire.

source: Value must be folder.
fr_fr: La valeur doit être un dossier.

source: Value must be file.
fr_fr: La valeur doit être un fichier.

source: Value must be a vector.
fr_fr: La valeur doit être un vecteur.

source: Value must be a float.
fr_fr: La valeur doit être un nombre flottant.

source: Value must be numeric.
fr_fr: La valeur doit être numérique.

source: Value must be one of the following types:
fr_fr: La valeur doit être l'un des types suivants :

source: or
fr_fr: ou

source: Value must be real.
fr_fr: La valeur doit être réelle.

source: Value must be positive.
fr_fr: La valeur doit être positive.

source: Value must be non positive.
fr_fr: La valeur doit être non positive.

source: Value must be nonnegative.
fr_fr: La valeur doit être non négative.

source: Value must be negative.
fr_fr: La valeur doit être négative.

source: Value must not be NaN.
fr_fr: La valeur ne doit pas être NaN.

source: Value must not be zero.
fr_fr: La valeur ne doit pas être zéro.

source: Value must not be sparse.
fr_fr: La valeur ne doit pas être clairsemée.

source: Value must be integer.
fr_fr: La valeur doit être un nombre entier.

source: Value must be non missing.
fr_fr: La valeur ne doit pas être manquante.

source: Second input to function 'mustBeGreaterThan' must be a scalar.
fr_fr: Le deuxième argument de la fonction 'mustBeGreaterThan' doit être un scalaire.

source: Inputs to function 'mustBeGreaterThan' must be numeric or logical.
fr_fr: Les entrées de la fonction 'mustBeGreaterThan' doivent être numériques ou logiques.

source: Inputs to function 'mustBeGreaterThan' must be real.
fr_fr: Les entrées de la fonction 'mustBeGreaterThan' doivent être réelles.

source: Value must be greater than %s.
fr_fr: La valeur doit être supérieure à %s.

source: Value must be greater than compared value.
fr_fr: La valeur doit être supérieure à la valeur comparée.

source: Second input to function 'mustBeLessThan' must be a scalar.
fr_fr: Le deuxième argument de la fonction 'mustBeLessThan' doit être un scalaire.

source: Inputs to function 'mustBeLessThan' must be numeric or logical.
fr_fr: Les entrées de la fonction 'mustBeLessThan' doivent être numériques ou logiques.

source: Value must be numeric or logical.
fr_fr: La valeur doit être numérique ou logique.

source: Inputs to function 'mustBeLessThan' must be real.
fr_fr: Les entrées de la fonction 'mustBeLessThan' doivent être réelles.

source: Value must be less than %s.
fr_fr: La valeur doit être inférieure à %s.

source: Value must be less than compared value.
fr_fr: La valeur doit être inférieure à la valeur comparée.

source: Second input to function 'mustBeGreaterThanOrEqual' must be a scalar.
fr_fr: Le deuxième argument de la fonction 'mustBeGreaterThanOrEqual' doit être un scalaire.

source: Inputs to function 'mustBeGreaterThanOrEqual' must be numeric or logical.
fr_fr: Les entrées de la fonction 'mustBeGreaterThanOrEqual' doivent être numériques ou logiques.

source: Inputs to function 'mustBeGreaterThanOrEqual' must be real.
fr_fr: Les entrées de la fonction 'mustBeGreaterThanOrEqual' doivent être réelles.

source: Value must be greater than or equal to %s.
fr_fr: La valeur doit être supérieure ou égale à %s.

source: Value must be greater than or equal to compared value.
fr_fr: La valeur doit être supérieure ou égale à la valeur comparée.

source: Second input to function 'mustBeLessThanOrEqual' must be a scalar.
fr_fr: Le deuxième argument de la fonction 'mustBeLessThanOrEqual' doit être un scalaire.

source: Inputs to function 'mustBeLessThanOrEqual' must be numeric or logical.
fr_fr: Les entrées de la fonction 'mustBeLessThanOrEqual' doivent être numériques ou logiques.

source: Inputs to function 'mustBeLessThanOrEqual' must be real.
fr_fr: Les entrées de la fonction 'mustBeLessThanOrEqual' doivent être réelles.

source: Value must be less than or equal to %s.
fr_fr: La valeur doit être inférieure ou égale à %s.

source: Value must be less than or equal to compared value.
fr_fr: La valeur doit être inférieure ou égale à la valeur comparée.

source: Value must be non zero length text.
fr_fr: La valeur doit être un texte de longueur non nulle.

source: Value must be member of the compared value.
fr_fr: La valeur doit être un membre de la valeur comparée.

source: A combinaison de '%s' et '%s' options is not supported.
fr_fr: La combinaison des options '%s' et '%s' n'est pas prise en charge.

source: Value must 'inclusive', 'exclusive', 'exclude-lower' or 'exclude-upper'.
fr_fr: La valeur doit être 'inclusive', 'exclusive', 'exclude-lower' ou 'exclude-upper'.

source: Second input to function 'mustBeInRange' must be a real or scalar value.
fr_fr: Le deuxième argument de la fonction 'mustBeInRange' doit être une valeur réelle ou scalaire.

source: Third input to function 'mustBeInRange' must be a real or scalar value.
fr_fr: Le troisième argument de la fonction 'mustBeInRange' doit être une valeur réelle ou scalaire.

source: Value must be in range.
fr_fr: La valeur doit être dans la plage.

source: Wrong type for argument #4. struct expected.
fr_fr: Type incorrect pour l'argument n°4. Une structure est attendue.

source: Wrong size for argument #4. scalar struct expected.
fr_fr: Taille incorrecte pour l'argument n°4. Une structure scalaire est attendue.

source: Type not supported. Only char, string, numeric or logical allowed.
fr_fr: Type non pris en charge. Seuls char, string, numeric ou logical sont autorisés.

source: Wrong type for argument #5. weboptions object expected.
fr_fr: Type incorrect pour l'argument n°5. Un objet weboptions est attendu.

source: HEAD detached at
fr_fr: HEAD détaché à

source: remote branch does not exist.
fr_fr: la branche distante n'existe pas.

source: Valid tag or branch name expected.
fr_fr: Un nom de balise ou de branche valide est attendu.

source: repository error %d/%d: %ls
fr_fr: erreur de dépôt %d/%d : %ls

source: repository error %d
fr_fr: erreur de dépôt %d

source: local branch name does not exist.
fr_fr: le nom de la branche locale n'existe pas.

source: Bad Request (400)
fr_fr: Requête incorrecte (400)

source: Unauthorized (401)
fr_fr: Non autorisé (401)

source: Payment Required (402)
fr_fr: Paiement requis (402)

source: Forbidden (403)
fr_fr: Interdit (403)

source: Not Found (404)
fr_fr: Non trouvé (404)

source: Method Not Allowed (405)
fr_fr: Méthode non autorisée (405)

source: Not Acceptable (406)
fr_fr: Non acceptable (406)

source: Proxy Authentication Required (407)
fr_fr: Authentification du proxy requise (407)

source: Request Timeout (408)
fr_fr: Délai d'attente de la requête (408)

source: Conflict (409)
fr_fr: Conflit (409)

source: Gone (410)
fr_fr: Parti (410)

source: Length Required (411)
fr_fr: Longueur requise (411)

source: Precondition Failed (412)
fr_fr: Échec de la condition préalable (412)

source: Payload Too Large (413)
fr_fr: Charge trop volumineuse (413)

source: URI Too Long (414)
fr_fr: URI trop long (414)

source: Unsupported Media Type (415)
fr_fr: Type de média non pris en charge (415)

source: Range Not Satisfiable (416)
fr_fr: Plage non satisfaisable (416)

source: Expectation Failed (417)
fr_fr: Échec de l'attente (417)

source: I'm a teapot (418)
fr_fr: Je suis une théière (418)

source: Misdirected Request (421)
fr_fr: Requête mal dirigée (421)

source: Unprocessable Entity (422)
fr_fr: Entité non traitable (422)

source: Locked (423)
fr_fr: Verrouillé (423)

source: Failed Dependency (424)
fr_fr: Dépendance échouée (424)

source: Too Early (425)
fr_fr: Trop tôt (425)

source: Upgrade Required (426)
fr_fr: Mise à niveau requise (426)

source: Precondition Required (428)
fr_fr: Condition préalable requise (428)

source: Too Many Requests (429)
fr_fr: Trop de requêtes (429)

source: Request Header Fields Too Large (431)
fr_fr: Champs d'en-tête de la requête trop grands (431)

source: Unavailable For Legal Reasons (451)
fr_fr: Indisponible pour des raisons légales (451)

source: Internal Server Error (500)
fr_fr: Erreur interne du serveur (500)

source: Not Implemented (501)
fr_fr: Non implémenté (501)

source: Bad Gateway (502)
fr_fr: Passerelle incorrecte (502)

source: Service Unavailable (503)
fr_fr: Service non disponible (503)

source: Gateway Timeout (504)
fr_fr: Délai d'attente de la passerelle (504)

source: HTTP Version Not Supported (505)
fr_fr: Version HTTP non prise en charge (505)

source: Variant Also Negotiates (506)
fr_fr: La variante négocie également (506)

source: Insufficient Storage (507)
fr_fr: Espace de stockage insuffisant (507)

source: Loop Detected (508)
fr_fr: Détection de boucle (508)

source: Not Extended(510)
fr_fr: Non étendu (510)

source: Network Authentication Required (511)
fr_fr: Authentification réseau requise (511)

source: HTTP Client error code:
fr_fr: Code d'erreur HTTP du client :

source: HTTP Server error code:
fr_fr: Code d'erreur HTTP du serveur :

source: weboptions object expected.
fr_fr: Un objet weboptions est attendu.

source: Cannot create destination file.
fr_fr: Impossible de créer le fichier de destination.

source: Cannot initialize webwrite.
fr_fr: Impossible d'initialiser webwrite.

source: Cannot initialize websave.
fr_fr: Impossible d'initialiser websave.

source: Invalid HeaderFields size.
fr_fr: Taille de HeaderFields non valide.

source: Allowable stack depth exceeded...
fr_fr: Profondeur de pile autorisée dépassée...

source: Attempt to pop global scope off of context stack!
fr_fr: Tentative de retirer la portée globale de la pile de contexte !

source: AST - syntax error!
fr_fr: AST - erreur de syntaxe !

source: END keyword illegal!
fr_fr: Mot clé END illégal !

source: Unrecognized reserved node in expression tree!
fr_fr: Nœud réservé non reconnu dans l'arbre d'expression !

source: Unrecognized expression!
fr_fr: Expression non reconnue !

source: Empty expression!
fr_fr: Expression vide !

source: Illegal use of the ':' keyword in indexing expression
fr_fr: Utilisation illégale du mot-clé ':' dans une expression d'indexation

source: Switch statements support scalar and string arguments only.
fr_fr: Les instructions Switch ne prennent en charge que des arguments scalaires et de chaîne.

source: endfunction cannot used here.
fr_fr: endfunction ne peut pas être utilisé ici.

source: Unrecognized statement type.
fr_fr: Type d'instruction non reconnu.

source: Expected indexing expression!
fr_fr: Expression d'indexation attendue !

source: Need to Overload!
fr_fr: Besoin de surcharge !

source: NEED TO IMPLEMENT ASSIGNATION FOR OBJECT.
fr_fr: BESOIN D'IMPLÉMENTER L'ATTRIBUTION POUR L'OBJET.

source: Cannot apply A.field_name = B to non struct-array object A.
fr_fr: Impossible d'appliquer A.field_name = B à l'objet A qui n'est pas une structure-array.

source: Illegal left hand side in multifunction expression
fr_fr: Côté gauche illégal dans une expression multifonction

source: Multiple rows not allowed in left hand side of multifunction expression
fr_fr: Plusieurs lignes ne sont pas autorisées dans le côté gauche d'une expression multifonction

source: Parenthetical expression in the left hand side of a function call must resolve to a single element.
fr_fr: L'expression entre parenthèses du côté gauche d'un appel de fonction doit se résoudre à un seul élément.

source: Cannot use arguments in a call to a script.
fr_fr: Impossible d'utiliser des arguments dans un appel à un script.

source: Cannot assign outputs in a call to a script.
fr_fr: Impossible d'attribuer des sorties lors d'un appel à un script.

source: Illegal expression in function expression
fr_fr: Expression illégale dans l'expression de la fonction

source: Must have lvalue in argument passed by reference
fr_fr: L'argument passé par référence doit avoir une valeur gauche (lvalue)

source: Invalid file id.
fr_fr: Identifiant de fichier invalide.

source: Memory allocation error... You may have run out of memory!
fr_fr: Erreur d'allocation de mémoire... Vous pourriez être à court de mémoire !

source: Wrong number of output arguments.
fr_fr: Nombre incorrect d'arguments de sortie.

source: Wrong number of input arguments.
fr_fr: Nombre incorrect d'arguments d'entrée.

source: Wrong type for argument #1: string expected.
fr_fr: Type incorrect pour l'argument #1 : chaîne de caractères attendue.

source: Wrong type for argument #2: string expected.
fr_fr: Type incorrect pour l'argument #2 : chaîne de caractères attendue.

source: Wrong type for argument #3: string expected.
fr_fr: Type incorrect pour l'argument #3 : chaîne de caractères attendue.

source: Wrong type for argument #%d: string expected.
fr_fr: Type incorrect pour l'argument #%d : chaîne de caractères attendue.

source: Wrong type for argument #1: cell of strings expected.
fr_fr: Type incorrect pour l'argument #1 : cellule de chaînes de caractères attendue.

source: Wrong type for argument #2: cell of strings expected.
fr_fr: Type incorrect pour l'argument #2 : cellule de chaînes de caractères attendue.

source: Wrong type for argument #%d: cell of strings expected.
fr_fr: Type incorrect pour l'argument #%d : cellule de chaînes de caractères attendue.

source: Wrong type for argument #1: logical expected.
fr_fr: Type incorrect pour l'argument #1 : valeur logique attendue.

source: Wrong type for argument #2: logical expected.
fr_fr: Type incorrect pour l'argument #2 : valeur logique attendue.

source: Wrong type for argument #3: logical expected.
fr_fr: Type incorrect pour l'argument #3 : valeur logique attendue.

source: Wrong type for argument #4: logical expected.
fr_fr: Type incorrect pour l'argument #4 : valeur logique attendue.

source: Wrong size for argument #1. logical matrix expected.
fr_fr: Taille incorrecte pour l'argument #1. Matrice logique attendue.

source: Wrong size for argument #2. logical matrix expected.
fr_fr: Taille incorrecte pour l'argument #2. Matrice logique attendue.

source: Wrong type for argument #1: sparse logical expected.
fr_fr: Type incorrect pour l'argument #1 : tableau creux logique attendu.

source: Wrong type for argument #2: sparse logical expected.
fr_fr: Type incorrect pour l'argument #2 : tableau creux logique attendu.

source: Wrong type for argument #1: double expected.
fr_fr: Type incorrect pour l'argument #1 : nombre réel attendu.

source: Wrong type for argument #2: double expected.
fr_fr: Type incorrect pour l'argument #2 : nombre réel attendu.

source: Wrong type for argument #3: double expected.
fr_fr: Type incorrect pour l'argument #3 : nombre réel attendu.

source: Wrong type for argument #4: double expected.
fr_fr: Type incorrect pour l'argument #4 : nombre réel attendu.

source: Wrong type for argument #5: double expected.
fr_fr: Type incorrect pour l'argument #5 : nombre réel attendu.

source: Wrong type for argument #6: double expected.
fr_fr: Type incorrect pour l'argument #6 : nombre réel attendu.

source: Wrong type for argument #%d: double expected.
fr_fr: Type incorrect pour l'argument #%d : nombre réel attendu.

source: Wrong size for argument #1. double matrix expected.
fr_fr: Taille incorrecte pour l'argument #1. Matrice de nombres réels attendue.
