Repository: nelson-lang/nelson
Catalog: locale/*/LC_MESSAGES/nelson.po
Languages: fr_fr

source: Wrong size for #1 argument.
fr_fr: Taille incorrecte pour l'argument #1.

source: Wrong size for #2 argument.
fr_fr: Taille incorrecte pour l'argument #2.

source: Wrong size for #3 argument.
fr_fr: Taille incorrecte pour l'argument #3.

source: Wrong value for #2 argument. positive value expected.
fr_fr: Valeur incorrecte pour l'argument #2. Une valeur positive est attendue.

source: Wrong value for #3 argument. positive value expected.
fr_fr: Valeur incorrecte pour l'argument #3. Une valeur positive est attendue.

source: Wrong value for #1 argument. [0, 1] values expected.
fr_fr: Valeur incorrecte pour l'argument #1. Des valeurs [0, 1] sont attendues.

source: Inputs must be the same size.
fr_fr: Les entrées doivent être de même taille.

source: Inputs must be real integers.
fr_fr: Les entrées doivent être des entiers réels.

source: 'double' or 'single' type for all input arguments expected.
fr_fr: Type 'double' ou 'single' attendu pour tous les arguments d'entrée.

source: dense type for all input arguments expected.
fr_fr: Type dense attendu pour tous les arguments d'entrée.

source: Inputs arguments must be real.
fr_fr: Les arguments d'entrée doivent être réels.

source: X and V must be of the same length.
fr_fr: X et V doivent être de la même longueur.

source: Inputs must be 2-D.
fr_fr: Les entrées doivent être en 2D.

source: Native accumulation on char array is not supported.
fr_fr: L'accumulation native sur un tableau de caractères n'est pas prise en charge.

source: Second argument must be 0.
fr_fr: Le deuxième argument doit être 0.

source: Error using diary.
fr_fr: Erreur lors de l'utilisation de diary.

source: #1 Argument 'get' expected.
fr_fr: Argument #1 'get' attendu.

source: #2 Argument 'Diary' or 'DiaryFile' expected.
fr_fr: #2 Argument 'Diary' ou 'DiaryFile' attendu.

source: #1 Argument 'set' expected.
fr_fr: Argument #1 'set' attendu.

source: #3 Argument 'on' or 'off' expected.
fr_fr: #3 Argument 'on' ou 'off' attendu.

source: #3 Argument a string expected.
fr_fr: #3 Argument une chaîne de caractères attendue.

source: '-append' expected.
fr_fr: '-append' attendu.

source: a valid delimiter expected.
fr_fr: Un délimiteur valide est attendu.

source: 'pc' or 'unix' expected.
fr_fr: 'pc' ou 'unix' attendu.

source: cell2mat returns more than one output argument.
fr_fr: cell2mat renvoie plus d'un argument de sortie.

source: Problem with file manager.
fr_fr: Problème avec le gestionnaire de fichiers.

source: Invalid file identifier.
fr_fr: Identifiant de fichier invalide.

source: Cannot close files.
fr_fr: Impossible de fermer les fichiers.

source: Wrong value for #1: 'all' expected.
fr_fr: Mauvaise valeur pour l'argument #1 : 'all' attendu.

source: 'clear' expected as second argument.
fr_fr: 'clear' attendu comme deuxième argument.

source: Not implemented for requested file identifier.
fr_fr: Non implémenté pour l'identifiant de fichier demandé.

source: Second argument must be greater than zero.
fr_fr: Le deuxième argument doit être supérieur à zéro.

source: Encoding not supported.
fr_fr: Encodage non pris en charge.

source: Invalid name.
fr_fr: Nom invalide.

source: Invalid file mode.
fr_fr: Mode de fichier invalide.

source: Impossible to add file.
fr_fr: Impossible d'ajouter le fichier.

source: Invalid machine format.
fr_fr: Format de machine invalide.

source: Invalid encoding.
fr_fr: Encodage invalide.

source: Impossible to open file.
fr_fr: Impossible d'ouvrir le fichier.

source: machine format option ignored.
fr_fr: Option de format de machine ignorée.

source: valid format expected.
fr_fr: Format valide attendu.

source: ID not supported.
fr_fr: ID non pris en charge.

source: Cannot use encoding:
fr_fr: Impossible d'utiliser l'encodage :

source: Wrong value for #1 argument: a valid file ID expected.
fr_fr: Mauvaise valeur pour l'argument #1 : un ID de fichier valide est attendu.

source: Wrong value for machine format.
fr_fr: Mauvaise valeur pour le format de machine.

source: Wrong value for #3 argument: not supported precision.
fr_fr: Mauvaise valeur pour l'argument #3 : précision non prise en charge.

source: Problem to read data.
fr_fr: Problème pour lire les données.

source: Rewind failed.
fr_fr: Échec de rembobinage.

source: Wrong value >= 0 expected.
fr_fr: Une valeur >= 0 est attendue.

source: Wrong size. scalar or [a, b] expected.
fr_fr: Taille incorrecte. Scalaire ou [a, b] attendu.

source: Wrong type. double expected.
fr_fr: Type incorrect. Double attendu.

source: Not implemented for 'stdout', 'stderr' or 'stdin'.
fr_fr: Non implémenté pour 'stdout', 'stderr' ou 'stdin'.

source: Invalid origin.
fr_fr: Origine invalide.

source: Cannot write references type.
fr_fr: Impossible d'écrire le type de référence.

source: Cannot write sparse type.
fr_fr: Impossible d'écrire le type sparse.

source: Endian conversion not supported for this file identifier.
fr_fr: La conversion d'endianness n'est pas prise en charge pour cet identifiant de fichier.

source: encoding conversion not supported for this file identifier.
fr_fr: La conversion d'encodage n'est pas prise en charge pour cet identifiant de fichier.

source: Filename is empty
fr_fr: Le nom de fichier est vide

source: Valid option expected.
fr_fr: Option valide attendue.

source: load function expected.
fr_fr: Fonction load attendue.

source: save function expected.
fr_fr: Fonction save attendue.

source: First argument must be a text scalar.
fr_fr: Le premier argument doit être un scalaire texte.

source: An numeric matrix expected.
fr_fr: Une matrice numérique est attendue.

source: Cannot to use encoding:
fr_fr: Impossible d'utiliser l'encodage :

source: Unable to open file
fr_fr: Impossible d'ouvrir le fichier

source: Invalid format.
fr_fr: Format invalide.

source: Unsupported fscanf format.
fr_fr: Format fscanf non pris en charge.

source: Format string had no usable format specs.
fr_fr: La chaîne de format n'avait pas de spécifications de format utilisables.

source: Erroneous format specification
fr_fr: Spécification de format erronée

source: No more data.
fr_fr: Pas de données supplémentaires.

source: Matching failure in format.
fr_fr: Échec de correspondance dans le format.

source: Unsupported sscanf format.
fr_fr: Format sscanf non pris en charge.

source: sscanf internal error.
fr_fr: Erreur interne sscanf.

source: NaN and Inf not allowed.
fr_fr: NaN et Inf ne sont pas autorisés.

source: Expected a integer value.
fr_fr: Une valeur entière est attendue.

source: Conversion to char from complex is not possible.
fr_fr: La conversion en caractère à partir de complexe n'est pas possible.

source: Number of Input arguments must the same as output.
fr_fr: Le nombre d'arguments d'entrée doit être le même que celui de la sortie.

source: char vector or cell of strings expected.
fr_fr: Un vecteur de caractères ou une cellule de chaînes est attendu.

source: 'class' argument expected.
fr_fr: Argument 'class' attendu.

source: Second input argument must be a real positive integers.
fr_fr: Le deuxième argument d'entrée doit être un entier réel positif.

source: Wrong value for #3: 'IgnoreCase' expected.
fr_fr: Mauvaise valeur pour l'argument #3 : 'IgnoreCase' attendu.

source: Invalid input argument(s): cell or string expected.
fr_fr: Argument(s) d'entrée invalide(s) : cellule ou chaîne attendue.

source: 'ForceCellOutput' expected as third input argument.
fr_fr: 'ForceCellOutput' attendu comme troisième argument d'entrée.

source: Second argument must be a single string expected.
fr_fr: Le deuxième argument doit être une chaîne de caractères unique.

source: First argument must be a cell of strings (or a string) and second argument a string.
fr_fr: Le premier argument doit être une cellule de chaînes (ou une chaîne) et le deuxième argument une chaîne.

source: Input strings must have one row.
fr_fr: Les chaînes d'entrée doivent avoir une seule ligne.

source: Type not managed in this case.
fr_fr: Type non géré dans ce cas.

source: Input must be a text scalar.
fr_fr: L'entrée doit être un scalaire texte.

source: A 2D matrix expected.
fr_fr: Une matrice 2D est attendue.

source: Wrong format string.
fr_fr: Chaîne de format incorrecte.

source: PRECISION must be a scalar integer >= 0.
fr_fr: PRECISION doit être un entier scalaire >= 0.

source: Same size or scalar expected.
fr_fr: La même taille ou un scalaire est attendu.

source: Wrong type for argument #1: string array or character vector or cell array of character vectors expected.
fr_fr: Type incorrect pour l'argument #1 : tableau de chaînes de caractères ou vecteur de caractères ou cellule de tableaux de caractères de chaînes attendu.

source: Wrong type for argument #2: string array or character vector or cell array of character vectors expected.
fr_fr: Type incorrect pour l'argument #2 : tableau de chaînes de caractères ou vecteur de caractères ou cellule de tableaux de caractères de chaînes attendu.

source: wrong file extension .m or .m expected.
fr_fr: Mauvaise extension de fichier .m ou .m attendue.

source: Duplicated tag detected: %s
fr_fr: Balise dupliquée détectée : %s

source: Check tags used.
fr_fr: Vérifiez les balises utilisées.

source: Cannot edit the directory: %1
fr_fr: Impossible de modifier le répertoire : %1

source: File %1 does not exists. Do you want to create it?
fr_fr: Le fichier %1 n'existe pas. Voulez-vous le créer ?

source: &New
fr_fr: &Nouveau

source: &Open
fr_fr: &Ouvrir

source: &Save
fr_fr: &Enregistrer

source: Save &As
fr_fr: Enregistrer &sous

source: Save A&ll
fr_fr: Tout enregi&strer

source: Close &All
fr_fr: Fermer &tout

source: &Quit Editor
fr_fr: &Quitter l'éditeur

source: &Undo
fr_fr: &Annuler

source: &Redo
fr_fr: &Rétablir

source: &Font
fr_fr: &Police

source: Copy Full Path
fr_fr: Copier le chemin complet

source: Comment
fr_fr: Commenter

source: Uncomment
fr_fr: Décommenter

source: &Go To Line ...
fr_fr: &Aller à la ligne ...

source: &Run file
fr_fr: &Exécuter le fichier

source: &Stop execution
fr_fr: &Arrêter l'exécution

source: Smart Indent
fr_fr: Indentation intelligente

source: Print
fr_fr: Imprimer

source: Evaluate selection
fr_fr: Évaluer la sélection

source: Edit
fr_fr: Éditer

source: Ready
fr_fr: Prêt

source: The document %1 has been modified. Do you want to save your changes ?
fr_fr: Le document %1 a été modifié. Voulez-vous enregistrer vos modifications ?

source: File saved
fr_fr: Fichier enregistré

source: Cannot write file: %1.
fr_fr: Impossible d'écrire le fichier : %1.

source: File not saved
fr_fr: Fichier non enregistré

source: Cannot read file %1: %2.
fr_fr: Impossible de lire le fichier %1 : %2.

source: File loaded
fr_fr: Fichier chargé

source: Nelson Editor
fr_fr: Éditeur Nelson

source: Save File
fr_fr: Enregistrer le fichier

source: Text files
fr_fr: Fichiers texte

source: Markdown files
fr_fr: Fichiers Markdown

source: All files
fr_fr: Tous les fichiers

source: Open file ...
fr_fr: Ouvrir le fichier ...

source: Go To Line ...
fr_fr: Aller à la ligne ...

source: Enter a line number to go to:
fr_fr: Entrez un numéro de ligne pour aller à :

source: Run file ...
fr_fr: Exécuter le fichier ...

source: File %1 was modified by an external software. Do you want to reopen it?
fr_fr: Le fichier %1 a été modifié par un logiciel externe. Voulez-vous le rouvrir ?

source: Calendar not initialized.
fr_fr: Calendrier non initialisé.

source: Year value is wrong [1400, 9999] expected.
fr_fr: La valeur de l'année est incorrecte [1400, 9999] attendue.

source: Month value is wrong [1, 12] expected.
fr_fr: La valeur du mois est incorrecte [1, 12] attendue.

source: Failed to convert text to date number.
fr_fr: Échec de conversion du texte en numéro de date.

source: vector double, character vector or string array expected.
fr_fr: Un vecteur double, un vecteur de caractères ou un tableau de chaînes est attendu.

source: a date vector or string expected, all subsequent arguments are ignored.
fr_fr: Un vecteur de date ou une chaîne est attendu, tous les arguments ultérieurs sont ignorés.

source: Invalid vector size must be compatible
fr_fr: Taille de vecteur invalide, elle doit être compatible

source: Argument #2: 'ns' or 's' expected.
fr_fr: Argument #2 : 'ns' ou 's' attendu.

source: First argument must be a function handle that takes no input argument.
fr_fr: Le premier argument doit être une poignée de fonction ne prenant aucun argument d'entrée.

source: evaluator is not defined.
fr_fr: L'évaluateur n'est pas défini.

source: Elapsed time is %f seconds.
fr_fr: Le temps écoulé est de %f secondes.

source: Cannot call toc.
fr_fr: Impossible d'appeler toc.

source: You must call 'tic' without an output argument before calling 'toc' without an input argument.
fr_fr: Vous devez appeler 'tic' sans argument de sortie avant d'appeler 'toc' sans argument d'entrée.

source: Sun
fr_fr: Dim.

source: M
fr_fr: L

source: Tu
fr_fr: M

source: W
fr_fr: M

source: Th
fr_fr: J

source: F
fr_fr: V

source: Sat
fr_fr: S

source: Feb
fr_fr: Fév.

source: Apr
fr_fr: Avr.

source: May
fr_fr: Mai

source: Jun
fr_fr: Juin

source: Jul
fr_fr: Juill.

source: Aug
fr_fr: Août

source: Sep
fr_fr: Sept.

source: Dec
fr_fr: Déc.

source: This declaration is only allowed from a class constructor.
fr_fr: Cette déclaration n'est autorisée que depuis un constructeur de classe.

source: Matrix index is out of range.
fr_fr: L'index de la matrice est hors limites.

source: Invalid index
fr_fr: Index invalide

source: Illegal zero or negative index
fr_fr: Index zéro ou négatif illégal

source: Cannot convert string data types to indices.
fr_fr: Impossible de convertir les types de données string en indices.

source: Imaginary part of complex index ignored.
fr_fr: La partie imaginaire de l'indice complexe est ignorée.

source: index must either be real positive integers or logicals.
fr_fr: l'indice doit être soit des entiers positifs réels, soit des logiques.

source: Zero or negative index encountered.
fr_fr: Indice zéro ou négatif rencontré.

source: Too big index encountered.
fr_fr: Indice trop grand rencontré.

source: Cannot convert handle arrays to indices.
fr_fr: Impossible de convertir les tableaux de handle en indices.

source: Cannot convert cell arrays to indices.
fr_fr: Impossible de convertir les tableaux de cellules en indices.

source: Cannot convert string arrays to indices.
fr_fr: Impossible de convertir les tableaux de chaînes en indices.

source: Cannot convert function_handle arrays to indices.
fr_fr: Impossible de convertir les tableaux de function_handle en indices.

source: Cannot convert class arrays to indices.
fr_fr: Impossible de convertir les tableaux de classes en indices.

source: Cannot convert structure arrays to indices.
fr_fr: Impossible de convertir les tableaux de structures en indices.

source: Cannot convert unknown type to indices.
fr_fr: Impossible de convertir un type inconnu en indices.

source: operation does not support sparse matrix arguments.
fr_fr: l'opération ne prend pas en charge les arguments de matrice creuse.

source: Warning: sparse matrix converted to full for operation.
fr_fr: Avertissement : la matrice creuse a été convertie en pleine pour l'opération.

source: Cannot resize sparse arrays.
fr_fr: Impossible de redimensionner les tableaux creux.

source: Reshape operation not allowed for overloaded type.
fr_fr: L'opération de remodelage n'est pas autorisée pour le type surchargé.

source: Reshape operation not allowed for 'function_handle' type.
fr_fr: L'opération de remodelage n'est pas autorisée pour le type 'function_handle'.

source: Reshape operation not allowed with N Dimensions sparse arrays.
fr_fr: L'opération de remodelage n'est pas autorisée avec les tableaux creux de N dimensions.

source: changeDimensions operation not allowed for overloaded type.
fr_fr: L'opération changeDimensions n'est pas autorisée pour le type surchargé.

source: changeDimensions operation not allowed for 'function_handle' type.
fr_fr: L'opération changeDimensions n'est pas autorisée pour le type 'function_handle'.

source: changeDimensions operation cannot change the number of elements in array.
fr_fr: L'opération changeDimensions ne peut pas changer le nombre d'éléments dans le tableau.

source: Invalid data class.
fr_fr: Classe de données invalide.

source: Byte size calculation not supported for sparse arrays.
fr_fr: Le calcul de la taille en octets n'est pas pris en charge pour les tableaux creux.

source: isPositive not supported for sparse arrays.
fr_fr: isPositive n'est pas pris en charge pour les tableaux creux.

source: Switch argument must be a scalar or a string
fr_fr: L'argument de commutation doit être un scalaire ou une chaîne.

source: Switch argument cannot be a reference type (struct or cell array)
fr_fr: L'argument de commutation ne peut pas être un type de référence (tableau de structures ou de cellules).

source: Case arguments must either be a scalar or a cell array
fr_fr: Les arguments de cas doivent être soit un scalaire soit un tableau de cellules.

source: copyElements not supported for sparse arrays.
fr_fr: copyElements n'est pas pris en charge pour les tableaux creux.

source: Invalid index value > limit max.
fr_fr: Valeur d'indice invalide > limite max.

source: Expected a positive integer scalar.
fr_fr: Un scalaire entier positif est attendu.

source: Expected a integer.
fr_fr: Un entier est attendu.

source: Dimension argument must be a positive integer scalar within indexing range.
fr_fr: L'argument de dimension doit être un scalaire entier positif dans la plage d'indexation.

source: Expected integer index.
fr_fr: Indice entier attendu.

source: Undefined function 'nzmax' for input arguments of type 'cell'.
fr_fr: Fonction 'nzmax' indéfinie pour les arguments d'entrée de type 'cell'.

source: Undefined function 'nzmax' for input arguments of type 'string'.
fr_fr: Fonction 'nzmax' indéfinie pour les arguments d'entrée de type 'string'.

source: Undefined function 'nzmax' for input arguments of type 'class'.
fr_fr: Fonction 'nzmax' indéfinie pour les arguments d'entrée de type 'class'.

source: Undefined function 'nzmax' for input arguments of type 'struct'.
fr_fr: Fonction 'nzmax' indéfinie pour les arguments d'entrée de type 'struct'.

source: Undefined function 'nzmax' for input arguments.
fr_fr: Fonction 'nzmax' indéfinie pour les arguments d'entrée.

source: Undefined function 'nnz' for input arguments of type 'cell'.
fr_fr: Fonction 'nnz' indéfinie pour les arguments d'entrée de type 'cell'.

source: Undefined function 'nnz' for input arguments of type 'string'.
fr_fr: Fonction 'nnz' indéfinie pour les arguments d'entrée de type 'string'.

source: Undefined function 'nnz' for input arguments of type 'class'.
fr_fr: Fonction 'nnz' indéfinie pour les arguments d'entrée de type 'class'.

source: Undefined function 'nnz' for input arguments of type 'struct'.
fr_fr: Fonction 'nnz' indéfinie pour les arguments d'entrée de type 'struct'.

source: Undefined function 'nnz' for input arguments.
fr_fr: Fonction 'nnz' indéfinie pour les arguments d'entrée.

source: Index exceeds array bounds.
fr_fr: L'indice dépasse les limites du tableau.

source: Field names must be valid.
fr_fr: Les noms de champ doivent être valides.

source: Duplicated field detected.
fr_fr: Champ dupliqué détecté.

source: Empty matrix of type double expected.
fr_fr: Une matrice vide de type double est attendue.

source: Size mismatch in assignment A(I1,I2,...,In) = B.
fr_fr: Incompatibilité de taille dans l'assignation A(I1,I2,...,In) = B.

source: Cannot promote to function_handle array.
fr_fr: Impossible de promouvoir en tableau de function_handle.

source: Cannot promote to class array.
fr_fr: Impossible de promouvoir en tableau de classes.

source: Multidimensional indexing not legal for sparse arrays in assignment A(I1,I2,...,IN) = B
fr_fr: L'indexation multidimensionnelle n'est pas autorisée pour les tableaux creux dans l'assignation A(I1,I2,...,IN) = B.

source: Assignment A(:) = B requires A and B to be the same size
fr_fr: L'assignation A(:) = B nécessite que A et B aient la même taille.

source: Cannot promote to another class type array.
fr_fr: Impossible de promouvoir en tableau d'un autre type de classe.

source: Cell definition must have same number of elements in each row
fr_fr: La définition de la cellule doit avoir le même nombre d'éléments dans chaque ligne.

source: Attempt to apply contents-indexing to non-cell array object.
fr_fr: Tentative d'application de l'indexation du contenu à un objet de tableau non cellulaire.

source: Empty contents indexing is not defined.
fr_fr: L'indexation de contenu vide n'est pas définie.

source: getVectorContents not supported for sparse arrays.
fr_fr: getVectorContents n'est pas pris en charge pour les tableaux creux.

source: Content indexing must return a single value.
fr_fr: L'indexation du contenu doit renvoyer une seule valeur.

source: Index exceeds cell array dimensions
fr_fr: L'indice dépasse les dimensions du tableau de cellules.

source: getNDimContents not supported for sparse arrays.
fr_fr: getNDimContents n'est pas pris en charge pour les tableaux creux.

source: Attempt to apply contents-indexing to non cell-array object.
fr_fr: Tentative d'application de l'indexation du contenu à un objet de tableau non cellulaire.

source: getVectorContentsAsList not supported for sparse arrays.
fr_fr: getVectorContentsAsList n'est pas pris en charge pour les tableaux creux.

source: ArrayOf index exceeds bounds of cell-array
fr_fr: ArrayOf l'index dépasse les limites du tableau de cellules

source: Attempt to apply contents-indexing to non cell or string array object.
fr_fr: Tentative d'application de l'indexation du contenu à un objet de tableau non cellulaire ou de chaînes.

source: getNDimContentsAsList not supported for sparse arrays.
fr_fr: getNDimContentsAsList n'est pas pris en charge pour les tableaux creux.

source: Conversion from <missing> to character vector is not supported.
fr_fr: La conversion de <missing> en vecteur de caractères n'est pas prise en charge.

source: setVectorContents not supported for sparse arrays.
fr_fr: setVectorContents n'est pas pris en charge pour les tableaux creux.

source: In expression A{I} = B, I must reference a single element of cell-array A.
fr_fr: Dans l'expression A{I} = B, I doit faire référence à un seul élément du tableau de cellules A.

source: Illegal negative index in expression A{I} = B.
fr_fr: Indice négatif illégal dans l'expression A{I} = B.

source: setNDimContents not supported for sparse arrays.
fr_fr: setNDimContents n'est pas pris en charge pour les tableaux creux.

source: In expression A{I1,I2,...,IN} = B, (I1,...,IN) must reference a single element of cell-array A.
fr_fr: Dans l'expression A{I1,I2,...,IN} = B, (I1,...,IN) doit faire référence à un seul élément du tableau de cellules A.

source: setVectorContentsAsList not supported for sparse arrays.
fr_fr: setVectorContentsAsList n'est pas pris en charge pour les tableaux creux.

source: Not enough right hand side values to satisy left hand side expression.
fr_fr: Pas assez de valeurs du côté droit pour satisfaire l'expression du côté gauche.

source: {} assignment expects a character vector.
fr_fr: L'assignation {} attend un vecteur de caractères.

source: setNDimContentsAsList not supported for sparse arrays.
fr_fr: setNDimContentsAsList n'est pas pris en charge pour les tableaux creux.

source: Not enough right hand side values to satisfy left hand side expression
fr_fr: Pas assez de valeurs du côté droit pour satisfaire l'expression du côté gauche

source: String array expected.
fr_fr: Tableau de chaînes attendu.

source: Conversion <missing> to character vector is not supported.
fr_fr: La conversion <missing> en vecteur de caractères n'est pas prise en charge.
