Repository: nelson-lang/nelson
Catalog: locale/*/LC_MESSAGES/nelson.po
Languages: fr_fr

source: First argument must be a column vector.
fr_fr: Le premier argument doit être un vecteur colonne.

source: Arguments #1 and #2 must have the same length.
fr_fr: Les arguments #1 et #2 doivent avoir la même longueur.

source: String, cell of chars, or characters vector expected.
fr_fr: Chaîne, tableau de cellules de caractères ou vecteur de caractères attendu.

source: Weboptions must be the last argument.
fr_fr: Weboptions doit être le dernier argument.

source: isapprox must return an logical.
fr_fr: isapprox doit renvoyer un booléen.

source: isequalto must return an logical.
fr_fr: isequalto doit renvoyer un booléen.

source: Cannot convert to unicode.
fr_fr: Impossible de convertir en Unicode.

source: Input function not allowed from evalc.
fr_fr: La fonction d'entrée n'est pas autorisée depuis evalc.

source: Function not found.
fr_fr: Fonction non trouvée.

source: An row vector expected.
fr_fr: Un vecteur ligne est attendu.

source: finite value expected.
fr_fr: Une valeur finie est attendue.

source: real integer expected.
fr_fr: Un entier réel est attendu.

source: real positive integer expected.
fr_fr: Un entier réel positif est attendu.

source: only one unknown dimension allowed.
fr_fr: Une seule dimension inconnue autorisée.

source: Reshape operation cannot change the number of elements in array.
fr_fr: L'opération de remodelage ne peut pas changer le nombre d'éléments dans le tableau.

source: Wrong value for argument #2. 'r' or 'c' expected
fr_fr: Valeur incorrecte pour l'argument #2. 'r' ou 'c' attendu.

source: Wrong type for argument #2. numeric values expected
fr_fr: Type incorrect pour l'argument #2. Des valeurs numériques sont attendues.

source: Wrong size for argument #2. row vector or scalar expected
fr_fr: Taille incorrecte pour l'argument #2. Un vecteur ligne ou un scalaire est attendu.

source: An array of integers values, 0 <= D <= flintmax expected.
fr_fr: Un tableau de valeurs entières, 0 <= D <= flintmax, est attendu.

source: unknow engine.
fr_fr: Moteur inconnu.

source: file to execute in an new process
fr_fr: Fichier à exécuter dans un nouveau processus

source: language used in current session
fr_fr: Langue utilisée dans la session en cours

source: socket.io uri address
fr_fr: Adresse URI socket.io

source: opens files in text editor
fr_fr: Ouvre les fichiers dans l'éditeur de texte

source: wrong value for timeout option.
fr_fr: Valeur incorrecte pour l'option timeout.

source: Error: could not find the function NtOpenFile in library ntdll.dll.
fr_fr: Erreur : impossible de trouver la fonction NtOpenFile dans la bibliothèque ntdll.dll.

source: Recursion stack not enough. Please set C recursion stack to
fr_fr: Pile de récursion insuffisante. Veuillez définir la pile de récursion C à

source: Malformed floating point constant.
fr_fr: Constante à virgule flottante mal formée.

source: Second argument must be 'noperm'.
fr_fr: Le deuxième argument doit être 'noperm'.

source: First argument must be single or double.
fr_fr: Le premier argument doit être un seul ou double.

source: Matrix must be square.
fr_fr: La matrice doit être carrée.

source: Invalid arguments for LAPACKE_dgebal
fr_fr: Arguments invalides pour LAPACKE_dgebal.

source: Second argument must be a structure with two fields whose names are 'type' and 'subs'.
fr_fr: Le deuxième argument doit être une structure avec deux champs nommés 'type' et 'subs'.

source: First argument must be a struct.
fr_fr: Le premier argument doit être une structure.

source: Illegal indexing structure argument: type '.', '{}' or '()' expected.
fr_fr: Argument de structure d'indexation illégal : '.' attendu, '{}' ou '()'.

source: Second argument a single string expected.
fr_fr: Le deuxième argument doit être une seule chaîne de caractères.

source: wrong file prefix 'test_' or 'bug_' expected.
fr_fr: préfixe de fichier incorrect, 'test_' ou 'bug_' attendu.

source: A combinaison of '%s' and '%s' options is not supported.
fr_fr: La combinaison des options '%s' et '%s' n'est pas supportée.

source: Wrong value for #1 :Invalid size.
fr_fr: Valeur incorrecte pour #1 : Taille invalide.

source: Wrong value for #2 :Invalid size.
fr_fr: Valeur incorrecte pour #2 : Taille invalide.

source: Wrong value for #%d :Invalid size.
fr_fr: Valeur incorrecte pour #%d : Taille invalide.

source: Wrong value for #1 argument. positive value expected.
fr_fr: Valeur incorrecte pour l'argument #1. Une valeur positive est attendue.

source: Wrong value for #%d argument. positive value expected.
fr_fr: Valeur incorrecte pour l'argument #%d. Une valeur positive est attendue.

source: Wrong value for #1 argument. a must be higher than b ([a,b]).
fr_fr: Valeur incorrecte pour l'argument #1. a doit être supérieur à b ([a,b]).

source: Wrong value for #2 argument. a must be higher than b ([a,b]).
fr_fr: Valeur incorrecte pour l'argument #2. a doit être supérieur à b ([a,b]).

source: Warning! one or more outputs not assigned in call.
fr_fr: Attention ! Un ou plusieurs résultats ne sont pas assignés dans l'appel.

source: Check for incorrect argument data type or missing argument in call to function '%s'.
fr_fr: Vérifiez le type de données incorrect de l'argument ou l'argument manquant dans l'appel de la fonction '%s'.

source: your error message
fr_fr: votre message d'erreur

source: format not found.
fr_fr: format non trouvé.

source: sheet name not found.
fr_fr: nom de la feuille non trouvé.

source: Invalid syntax: sexpected.
fr_fr: Syntaxe invalide : %s attendu.

source: Static gain.
fr_fr: Gain statique.

source: Matrix dimensions must agree.
fr_fr: Les dimensions de la matrice doivent être compatibles.

source: Sampling times must agree.
fr_fr: Les temps d'échantillonnage doivent être compatibles.

source: dimensions of systems output is incompatible.
fr_fr: Les dimensions de la sortie du système ne sont pas compatibles.

source: dimensions of systems input is incompatible.
fr_fr: Les dimensions de l'entrée du système ne sont pas compatibles.

source: bode without input argument does not return output arguments.
fr_fr: bode sans argument d'entrée ne renvoie pas d'arguments de sortie.

source: invalid line specification.
fr_fr: Spécification de ligne invalide.

source: frequency interval must be specified as {wmin, wmax} real.
fr_fr: L'intervalle de fréquence doit être spécifié sous la forme {wmin, wmax} réel.

source: real expected.
fr_fr: Réel attendu.

source: invalid value for "%s" field.
fr_fr: Valeur invalide pour le champ "%s".

source: an expression after +
fr_fr: Une expression après +.

source: invalid argument: rows, descend, ascend expected.
fr_fr: Argument invalide : on attend des lignes, descendre, monter.

source: invalid argument: descend, ascend expected.
fr_fr: Argument invalide : on attend descendre, monter.

source: All structures must have the same fieldnames
fr_fr: Toutes les structures doivent avoir les mêmes noms de champs.

source: Size mismatch on arguments to arithmetic operator
fr_fr: Taille incompatible sur les arguments de l'opérateur arithmétique.

source: cmake not found.
fr_fr: cmake non trouvé.

source: only string expected as input argument.
fr_fr: Seule une chaîne de caractères est attendue en tant qu'argument d'entrée.

source: environment variable does not exist.
fr_fr: la variable d'environnement n'existe pas.

source: does not exist.
fr_fr: n'existe pas.

source: template file is missing.
fr_fr: le fichier de modèle est manquant.

source: vswhere not found.
fr_fr: vswhere non trouvé.

source: warning(query) does not require a second argument.
fr_fr: attention (query) ne nécessite pas de deuxième argument.

source: Group can only be a child of axes or hggroup.
fr_fr: Le groupe ne peut être qu'un enfant d'axes ou d'un groupe hg.

source: Invalid argument type: char vector, string, or cell of char expected.
fr_fr: Type d'argument non valide : un vecteur de caractères, une chaîne de caractères ou une cellule de caractères est attendu.

source: CDataMapping scaled or direct value expected.
fr_fr: CDataMapping attend une valeur mise à l'échelle ou directe.

source: pcolor requires either X, Y, C, or C arguments.
fr_fr: pcolor nécessite les arguments X, Y, C ou C.

source: size of S must match X, Y.
fr_fr: La taille de S doit correspondre à X, Y.

source: number of colors in C must match number of points in X.
fr_fr: le nombre de couleurs dans C doit correspondre au nombre de points dans X.

source: An valid git url or local directory expected.
fr_fr: Une URL Git valide ou un répertoire local est attendu.

source: an valid module name expected.
fr_fr: un nom de module valide est attendu.

source: arguments #1 and #2 must have same length.
fr_fr: les arguments #1 et #2 doivent avoir la même longueur.

source: String, cell of chars or characters vector expected.
fr_fr: Une chaîne de caractères, une cellule de caractères ou un vecteur de caractères est attendu.

source: weboptions must be last argument.
fr_fr: weboptions doit être le dernier argument.

source: Congratulations all functions are documented.
fr_fr: Félicitations, toutes les fonctions sont documentées.

source: Multiple possible symbol name found: %s
fr_fr: Plusieurs noms de symboles possibles trouvés : %s

source: null pointer cannot be incremented.
fr_fr: Le pointeur nul ne peut pas être incrémenté.

source: void cannot be incremented.
fr_fr: Le type void ne peut pas être incrémenté.

source: voidPtr cannot be incremented.
fr_fr: voidPtr ne peut pas être incrémenté.

source: libpointer cannot be incremented.
fr_fr: libpointer ne peut pas être incrémenté.

source: cannot be incremented.
fr_fr: ne peut pas être incrémenté.

source: Incompatible types
fr_fr: Types incompatibles

source: Numerics types expected.
fr_fr: Des types numériques sont attendus.

source: Attempt to convert to unimplemented sparse type
fr_fr: Tentative de conversion vers un type creux non implémenté

source: All structures must have the same fieldnames.
fr_fr: Toutes les structures doivent avoir les mêmes noms de champs.

source: Unrecognized option for the second argument.
fr_fr: Option non reconnue pour le deuxième argument.

source: Unrecognized option for the third argument.
fr_fr: Option non reconnue pour le troisième argument.

source: Unknown option.
fr_fr: Option inconnue.

source: input function not allowed from evalc.
fr_fr: Fonction d'entrée non autorisée depuis evalc.

source: function not found.
fr_fr: Fonction non trouvée.

source: Dimension argument to sort should be positive
fr_fr: L'argument de dimension pour le tri doit être positif

source: Sort direction must be either the string 'ascend' or 'descend'
fr_fr: La direction de tri doit être soit la chaîne 'ascend' soit 'descend'

source: shape parameter must be 'full', 'same', or 'valid'.
fr_fr: Le paramètre de forme doit être 'full', 'same' ou 'valid'.

source: Input Arguments must have same size.
fr_fr: Les arguments d'entrée doivent avoir same taille.

source: Number of field names must match number of fields in new structure.
fr_fr: Le nombre de noms de champs doit correspondre au nombre de champs dans la nouvelle structure.

source: function returned non-scalar result
fr_fr: la fonction a renvoyé un résultat non scalaire

source: A valid function name expected.
fr_fr: un nom de fonction valide est attendu

source: requires a valid fieldname.
fr_fr: nécessite un nom de champ valide

source: '-completenames' expected or scalar integer value required.
fr_fr: '-completenames' attendu ou une valeur entière scalaire est requise

source: Wrong size for argument #1. scalar expected
fr_fr: taille incorrecte pour l'argument #1. un scalaire est attendu

source: Wrong type for argument #1. 'scalar string or row char vector expected
fr_fr: Type incorrect pour l'argument #1. 'chaîne scalaire ou vecteur de caractères en ligne' est attendu

source: Wrong type for argument #2. 'scalar string or row char vector expected
fr_fr: Type incorrect pour l'argument #2. 'chaîne scalaire ou vecteur de caractères en ligne' est attendu

source: First argument must be 'like'.
fr_fr: Le premier argument doit être 'like'.

source: 's', 'p', 'z', 'q', 'z^-1', or 'q^-1' expected.
fr_fr: 's', 'p', 'z', 'q', 'z^-1' ou 'q^-1' est attendu.

source: TimeUnit property must be a valid time unit.
fr_fr: La propriété TimeUnit doit être une unité de temps valide.

source: 'toplevel' expected as third argument.
fr_fr: 'toplevel' est attendu comme troisième argument.

source: Unrecognized option for second argument.
fr_fr: Option non reconnue pour le deuxième argument.

source: Unrecognized option for third argument.
fr_fr: Option non reconnue pour le troisième argument.

source: 'off' expected.
fr_fr: 'off' est attendu.

source: Group can be only a child of axes or hggroup.
fr_fr: Le groupe ne peut être qu'un enfant des axes ou de hggroup.

source: Reduce option not yet implemented.
fr_fr: L'option Reduce n'est pas encore implémentée.

source: Pixels with NaN values are set to the minimum pixel value.
fr_fr: Les pixels avec des valeurs NaN sont définis à la valeur minimale des pixels.

source: Invalid argument type: char vector, string or cell of char expected.
fr_fr: Type d'argument non valide : vecteur de caractères, chaîne ou cellule de caractères attendu.

source: Unknow option.
fr_fr: Option inconnue.

source: 'nostartup' and 'startup' are mutually exclusive.
fr_fr: 'nostartup' et 'startup' sont mutuellement exclusifs.

source: warning('query') does not require a second argument.
fr_fr: warning('query') ne nécessite pas de deuxième argument.

source: Value should be a positive integer value > 0.
fr_fr: La valeur doit être un entier positif > 0.

source: Ts property must be 0, a positive scalar, or -1.
fr_fr: La propriété Ts doit être 0, un scalaire positif, ou -1.

source: All elements of cell array must have the same type.
fr_fr: Tous les éléments du tableau de cellules doivent avoir le même type.

source: Index out of range
fr_fr: Index hors de portée.

source: An numeric 2-D matrix expected.
fr_fr: Une matrice numérique 2D est attendue.

source: 'toplevel' expected as the third argument.
fr_fr: 'toplevel' est attendu comme troisième argument.

source: reduce option not yet implement.
fr_fr: L'option reduce n'est pas encore implémentée.

source: Pixels with NaN values are set to minimum pixel value.
fr_fr: Les pixels avec des valeurs NaN sont définis à la valeur minimale du pixel.

source: pcolor requires either X,Y,C, or C arguments.
fr_fr: pcolor nécessite soit des arguments X,Y,C, soit C.

source: Cannot set a read only property.
fr_fr: Impossible de définir une propriété en lecture seule.

source: Wrong value for #1 argument, 'fullpathext' or 'fullpath' expected.
fr_fr: Valeur incorrecte pour l'argument #1, 'fullpathext' ou 'fullpath' attendu.

source: cellfun works only on cells.
fr_fr: cellfun fonctionne uniquement sur des cellules.

source: Wrong type for argument #1. class expected.
fr_fr: Type incorrect pour l'argument #1. Classe attendue.

source: Illegal indexing structure argument: type '.' expected.
fr_fr: Argument de structure d'indexation illégal : type '.' attendu.

source: Second argument must be a double or single variable.
fr_fr: Le deuxième argument doit être une variable double ou simple.

source: '%s' failed to run.
fr_fr: '%s' n'a pas réussi à s'exécuter.

source: Invalid indexing.
fr_fr: Indexation invalide.

source: LAPACK_dgetrf error code: %d.
fr_fr: Code d'erreur LAPACK_dgetrf : %d.

source: LAPACK_dgecon error code: %d.
fr_fr: Code d'erreur LAPACK_dgecon : %d.

source: LAPACK_zgetrf error code: %d.
fr_fr: Code d'erreur LAPACK_zgetrf : %d.

source: LAPACK_zgecon error code: %d.
fr_fr: Code d'erreur LAPACK_zgecon : %d.

source: LAPACK_sgetrf error code: %d.
fr_fr: Code d'erreur LAPACK_sgetrf : %d.

source: LAPACK_sgecon error code: %d.
fr_fr: Code d'erreur LAPACK_sgecon : %d.

source: LAPACK_cgetrf error code: %d.
fr_fr: Code d'erreur LAPACK_cgetrf : %d.

source: LAPACK_cgecon error code: %d.
fr_fr: Code d'erreur LAPACK_cgecon : %d.

source: ' not available.
fr_fr: ' non disponible.

source: Wrong size for input argument #2: scalar expected.
fr_fr: Taille incorrecte pour l'argument d'entrée #2 : un scalaire est attendu.

source: Continuous model expected.
fr_fr: Modèle continu attendu.

source: Ts must be a finite positive scalar.
fr_fr: Ts doit être un scalaire positif fini.

source: Wrong value for #3 input argument: valid method expected.
fr_fr: Valeur incorrecte pour l'argument d'entrée #3 : une méthode valide est attendue.

source: Wrong value for #3 argument: 'prewarp' method expected.
fr_fr: Valeur incorrecte pour l'argument #3 : méthode 'prewarp' attendue.

source: Wrong size for input argument #4: scalar expected.
fr_fr: Taille incorrecte pour l'argument d'entrée #4 : un scalaire est attendu.

source: The prewarp frequency, also known as the critical frequency, should be less than the Nyquist frequency.
fr_fr: La fréquence de pré-distorsion, également connue sous le nom de fréquence critique, devrait être inférieure à la fréquence de Nyquist.

source: slicot_ab04md fails.
fr_fr: Échec de slicot_ab04md.

source: Discret model expected.
fr_fr: Modèle discret attendu.

source: Wrong value for #2 argument: 'prewarp' method expected.
fr_fr: Valeur incorrecte pour l'argument #2 : méthode 'prewarp' attendue.

source: Wrong size for input argument #3: scalar expected.
fr_fr: Taille incorrecte pour l'argument d'entrée #3 : un scalaire est attendu.

source: Sample time: %s
fr_fr: Temps d'échantillonnage : %s

source: unspecified
fr_fr: non spécifié

source: 'o', 'c' second argument expected.
fr_fr: Deuxième argument attendu : 'o', 'c'.

source: Wrong value for argument #1: sys.E must not be singular.
fr_fr: Valeur incorrecte pour l'argument #1 : sys.E ne doit pas être singulier.

source: Wrong value for input arguments #5 or #6: result must be positive definite.
fr_fr: Valeur incorrecte pour les arguments d'entrée #5 ou #6 : le résultat doit être défini positif.

source: Not a valid indexing expression
fr_fr: Expression d'indexation non valide

source: Illegal indexing structure argument: type . expected.
fr_fr: Argument de structure d'indexation illégal : type . attendu.

source: Command cannot be used for models of class 'tf'.
fr_fr: La commande ne peut pas être utilisée pour les modèles de classe 'tf'.

source: Illegal indexing structure argument: type . or () expected.
fr_fr: Argument de structure d'indexation illégal : type . ou () attendu.

source: Pole locations are in more than 10% error
fr_fr: Les emplacements des pôles sont en erreur de plus de 10%

source: Wrong size for input argument #1: square matrix expected.
fr_fr: Taille incorrecte pour l'argument d'entrée #1 : une matrice carrée est attendue.

source: slicot_mb03rd returned info = %d
fr_fr: slicot_mb03rd a retourné l'information = %d

source: Wrong value for argument #4: Symmetric matrix expected.
fr_fr: Valeur incorrecte pour l'argument #4 : une matrice symétrique est attendue.

source: Wrong size for argument #1: Square matrix expected.
fr_fr: Taille incorrecte pour l'argument #1 : une matrice carrée est attendue.

source: Wrong size for arguments: Q, R square matrix expected.
fr_fr: Taille incorrecte pour les arguments : Q, R doivent être des matrices carrées.

source: Wrong size for arguments #1 and #2: Same number of rows expected.
fr_fr: Taille incorrecte pour les arguments #1 et #2 : le même nombre de lignes est attendu.

source: Wrong size for arguments #2 and #4: Same number of columns expected.
fr_fr: Taille incorrecte pour les arguments #2 et #4 : le même nombre de colonnes est attendu.

source: Wrong size for arguments #2 and #5: Same size expected.
fr_fr: Taille incorrecte pour les arguments #2 et #5 : la même taille est attendue.

source: Wrong size for arguments #1 and #6: Same number of rows expected.
fr_fr: Taille incorrecte pour les arguments #1 et #6 : le même nombre de lignes est attendu.

source: Wrong size for arguments #1 and #3: Same size expected.
fr_fr: Taille incorrecte pour les arguments #1 et #3 : la même taille est attendue.

source: Unable to solve the specified Riccati equation.
fr_fr: Impossible de résoudre l'équation de Riccati spécifiée.

source: The accuracy of the solution could be compromised by inadequate scaling or eigenvalues that are in close proximity to the stability domain's boundary.
fr_fr: L'exactitude de la solution pourrait être compromise par une mise à l'échelle inadéquate ou des valeurs propres qui sont proches de la limite du domaine de stabilité.

source: The number of feedback inputs and outputs are not equal.
fr_fr: Le nombre d'entrées et de sorties de rétroaction n'est pas égal.

source: First input argument must be one of the following: 'tan', 'cos', 'sin', 'square', or 'pulse'.
fr_fr: Le premier argument d'entrée doit être l'un des suivants : 'tan', 'cos', 'sin', 'square', ou 'pulse'.

source: Impulse response
fr_fr: Réponse à l'impulsion

source: The initial conditions vector has not the same row length as matrix A.
fr_fr: Le vecteur des conditions initiales n'a pas la même longueur de ligne que la matrice A.

source: Response to initial Conditions
fr_fr: Réponse aux conditions initiales

source: Wrong value for argument #1: sys.E matrix must be positive definite.
fr_fr: Valeur incorrecte pour l'argument #1 : la matrice sys.E doit être définie positive.

source: Wrong size for argument #2: real square matrix expected.
fr_fr: Taille incorrecte pour l'argument #2 : une matrice carrée réelle est attendue.

source: Wrong value or size in arguments #%d: valid index expected and expected length %d expected.
fr_fr: Valeur ou taille incorrecte dans les arguments #%d : un index valide est attendu et une longueur attendue de %d.

source: Wrong type for argument #1: state space model expected.
fr_fr: Type incorrect pour l'argument #1 : un modèle d'espace d'état est attendu.

source: Wrong size for argument #5: vector expected.
fr_fr: Taille incorrecte pour l'argument #5 : un vecteur est attendu.

source: Wrong value in argument #1: sys.E is a singular matrix.
fr_fr: Valeur incorrecte dans l'argument #1 : sys.E est une matrice singulière.

source: Wrong size for input argument #2 and #4.
fr_fr: Taille incorrecte pour l'argument d'entrée #2 et #4.

source: Wrong size for input argument #2 and #5.
fr_fr: Taille incorrecte pour l'argument d'entrée #2 et #5.

source: Linear Simulation Results
fr_fr: Résultats de simulation linéaire

source: Time (%s)
fr_fr: Temps (%s)

source: %d states removed.
fr_fr: %d états supprimés.

source: %d state removed.
fr_fr: %d état supprimé.

source: Nyquist Diagram
fr_fr: Diagramme de Nyquist

source: Real axis
fr_fr: Axe réel

source: Imaginary axis
fr_fr: Axe imaginaire

source: Wrong size for argument #2: a vector expected
fr_fr: Taille incorrecte pour l'argument #2 : un vecteur est attendu

source: Wrong type for argument #2: real expected
fr_fr: Type incorrect pour l'argument #2 : un réel est attendu

source: OUTPUTS1 and INPUTS2 must be vectors of the same length.
fr_fr: OUTPUTS1 et INPUTS2 doivent être des vecteurs de la même longueur.

source: length of INPUTS2 cannot exceed the number of inputs in SYS2.
fr_fr: La longueur de INPUTS2 ne peut pas dépasser le nombre d'entrées dans SYS2.

source: length of OUTPUTS1 cannot exceed the number of outputs in SYS1.
fr_fr: La longueur de OUTPUTS1 ne peut pas dépasser le nombre de sorties dans SYS1.

source: some index in INPUTS2 is out of range.
fr_fr: Certains indices dans INPUTS2 sont hors de portée.

source: some index in OUTPUTS1 is out of range.
fr_fr: Certains indices dans OUTPUTS1 sont hors de portée.

source: Single input system expected.
fr_fr: Un système à entrée unique est attendu.

source: Index out of bounds or not a scalar.
fr_fr: Indice hors limites ou non un scalaire.

source: Step response
fr_fr: Réponse indicielle
