Repository: nelson-lang/nelson
Catalog: locale/*/LC_MESSAGES/nelson.po
Languages: fr_fr

source: Conversion to logical from function_handle is not possible.
fr_fr: La conversion en logique à partir de function_handle n'est pas possible.

source: Undefined function 'logical' for input arguments of type '
fr_fr: Fonction 'logical' non définie pour les arguments d'entrée de type '

source: Conversion to logical from struct is not possible.
fr_fr: La conversion en logique à partir de struct n'est pas possible.

source: Conversion to logical from complex is not possible.
fr_fr: La conversion en logique à partir de complexe n'est pas possible.

source: Size mismatch on arguments.
fr_fr: Taille non conforme sur les arguments.

source: Invalid option:
fr_fr: Option non valide :

source: Cannot read variable.
fr_fr: Impossible de lire la variable.

source: Cannot open .mat file.
fr_fr: Impossible d'ouvrir le fichier .mat.

source: Unknown save format.
fr_fr: Format d'enregistrement inconnu.

source: Cannot append variable (-v7.3 required).
fr_fr: Impossible d'ajouter une variable (-v7.3 requis).

source: invalid function handle.
fr_fr: handle de fonction invalide.

source: handle not saved.
fr_fr: handle non enregistré.

source: Valid .mat file expected.
fr_fr: Un fichier .mat valide est attendu.

source: #1 Argument must contain a string: 'global', 'base', 'local' or 'caller' expected.
fr_fr: L'argument #1 doit contenir une chaîne de caractères : 'global', 'base', 'local' ou 'caller' attendu.

source: #2 Argument must contain a valid variable name.
fr_fr: L'argument #2 doit contenir un nom de variable valide.

source: variable not found.
fr_fr: variable non trouvée.

source: variable is locked:
fr_fr: la variable est verrouillée :

source: A valid variable name expected.
fr_fr: Un nom de variable valide est attendu.

source: Argument must contain a valid variable name.
fr_fr: L'argument doit contenir un nom de variable valide.

source: variable is locked.
fr_fr: la variable est verrouillée.

source: Argument #1 : 'global', 'base', 'local' or 'caller' expected.
fr_fr: L'argument #1 : 'global', 'base', 'local' ou 'caller' est attendu.

source: Physical Memory used by Nelson:
fr_fr: Mémoire physique utilisée par Nelson :

source: Virtual Memory used by Nelson:
fr_fr: Mémoire virtuelle utilisée par Nelson :

source: Physical Memory:
fr_fr: Mémoire physique :

source: Virtual Memory:
fr_fr: Mémoire virtuelle :

source: A 'persistent' declaration is only allowed in a script file function.
fr_fr: Une déclaration 'persistent' n'est autorisée que dans une fonction de fichier de script.

source: #2 Argument must be an existing variable name.
fr_fr: L'argument #2 doit être un nom de variable existant.

source: filename expected after '-file'.
fr_fr: un nom de fichier est attendu après '-file'.

source: -file must be the first argument.
fr_fr: -file doit être le premier argument.

source: who file function expected.
fr_fr: who file function attendu.

source: Wrong scope.
fr_fr: Portée incorrecte.

source: whos file function expected.
fr_fr: whos file function attendu.

source: Filename does not exist.
fr_fr: Le fichier n'existe pas.

source: mex extension not yet supported.
fr_fr: l'extension mex n'est pas encore prise en charge.

source: Input must be 'all' or "all".
fr_fr: L'entrée doit être 'all' ou "all".

source: C MEX type not managed.
fr_fr: Type C MEX non géré.

source: Assertion failed: %s, at line %d of file "%s". %s
fr_fr: Échec de l'assertion : %s, à la ligne %d du fichier "%s". %s

source: Assertion failed: %s, at line %d of file "%s".
fr_fr: Échec de l'assertion : %s, à la ligne %d du fichier "%s".

source: Assertion failed: at line %d of file "%s". %s
fr_fr: Échec de l'assertion : à la ligne %d du fichier "%s". %s

source: Assertion failed: at line %d of file "%s".
fr_fr: Échec de l'assertion : à la ligne %d du fichier "%s".

source: mxGetPi not allowed with interleaved complex.
fr_fr: mxGetPi n'est pas autorisé avec un complexe entrelacé.

source: mxGetDoubles complex expected.
fr_fr: mxGetDoubles attendu en complexe.

source: mxGetDoubles real expected.
fr_fr: mxGetDoubles attendu en réel.

source: mxGetSingles complex expected.
fr_fr: mxGetSingles attendu en complexe.

source: mxGetSingles real expected.
fr_fr: mxGetSingles attendu en réel.

source: mxGetPr not allowed with interleaved complex.
fr_fr: mxGetPr n'est pas autorisé avec un complexe entrelacé.

source: mxGetProperty object expected.
fr_fr: mxGetProperty attendu en objet.

source: mxSetProperty object expected.
fr_fr: mxSetProperty attendu en objet.

source: Wrong value for #1 argument, 'reverse' expected.
fr_fr: Mauvaise valeur pour l'argument #1, 'reverse' attendu.

source: Argument #2 must be a valid option.
fr_fr: L'argument #2 doit être une option valide.

source: is not installed.
fr_fr: n'est pas installé.

source: Cannot compare versions:
fr_fr: Impossible de comparer les versions :

source: invalid module name.
fr_fr: nom de module invalide.

source: Impossible to get external modules directory.
fr_fr: Impossible d'obtenir le répertoire des modules externes.

source: Invalid module name:
fr_fr: Nom de module invalide :

source: Impossible to associate module name and library path
fr_fr: Impossible d'associer le nom du module et le chemin de la bibliothèque

source: : This module is already used:
fr_fr: : Ce module est déjà utilisé :

source: An existing module with the same name already used:
fr_fr: Un module existant avec le même nom est déjà utilisé :

source: An existing module with the same path already defined:
fr_fr: Un module existant avec le même chemin est déjà défini :

source: startup.m does not exist
fr_fr: startup.m n'existe pas

source: An existing module root path expected
fr_fr: Un chemin de racine de module existant est attendu

source: Invalid value #1
fr_fr: Valeur invalide #1

source: Invalid value #2
fr_fr: Valeur invalide #2

source: File not found.
fr_fr: Fichier non trouvé.

source: Module not loaded: symbol not found.
fr_fr: Module non chargé : symbole non trouvé.

source: Module not loaded: library not loaded.
fr_fr: Module non chargé : bibliothèque non chargée.

source: Module not loaded: library not loaded.
fr_fr: Module non chargé : bibliothèque non chargée.

source: Module not loaded: library handle not found.
fr_fr: Module non chargé : gestionnaire de bibliothèque introuvable.

source: Invalid option.
fr_fr: Option invalide.

source: Path does not exist:
fr_fr: Le chemin n'existe pas :

source: Please check:
fr_fr: Veuillez vérifier :

source: Cannot remove module (protected):
fr_fr: Impossible de supprimer le module (protégé) :

source: : This module is registered but it has no path.
fr_fr: : Ce module est enregistré mais il n'a pas de chemin.

source: finish.m does not exist.
fr_fr: finish.m n'existe pas.

source: An existing module root path expected.
fr_fr: Un chemin de racine de module existant est attendu.

source: MPI must be initialized.
fr_fr: MPI doit être initialisé.

source: Unsupported type to reduce.
fr_fr: Type non pris en charge pour la réduction.

source: Unsupported operator type.
fr_fr: Type d'opérateur non pris en charge.

source: Unsupported Type: must be a numerical type.
fr_fr: Type non pris en charge : doit être un type numérique.

source: MPI_Comm handle expected.
fr_fr: MPI_Comm attendu en tant que gestionnaire.

source: MPI_COMM_NULL not allowed.
fr_fr: MPI_COMM_NULL non autorisé.

source: not allowed.
fr_fr: non autorisé.

source: MPI_Comm_split fails.
fr_fr: Échec de MPI_Comm_split.

source: Attempting to use an MPI routine before initializing MPI.
fr_fr: Tentative d'utilisation d'une routine MPI avant l'initialisation de MPI.

source: Wrong engine mode.
fr_fr: Mode moteur incorrect.

source: MPI_Comm valid handle expected.
fr_fr: MPI_Comm attendu en tant que gestionnaire valide.

source: Invalid communicator
fr_fr: Communicateur invalide

source: Same types expected.
fr_fr: Les mêmes types sont attendus.

source: finite integer values expected.
fr_fr: Valeurs entières finies attendues.

source: finite positive integer values expected.
fr_fr: Valeurs entières positives finies attendues.

source: ASSUMEDTYPE must be an integer type name.
fr_fr: ASSUMEDTYPE doit être un nom de type entier.

source: Operands to BIT Ops must be numeric.
fr_fr: Les opérandes des opérations BIT doivent être numériques.

source: Inputs must be full.
fr_fr: Les entrées doivent être pleines.

source: Input arguments must have the same class or scalar doubles.
fr_fr: Les arguments d'entrée doivent avoir la même classe ou des doubles scalaires.

source: Array used as scalar.
fr_fr: Tableau utilisé comme scalaire.

source: ctranspose on N-D array is undefined.
fr_fr: La ctranspose sur un tableau N-D est indéfinie.

source: Size mismatch on arguments to power (^) operator.
fr_fr: Taille incompatible des arguments pour l'opérateur de puissance (^).

source: Only positive integers expected.
fr_fr: Seuls des entiers positifs sont attendus.

source: Unhandled type for second argument to A^B
fr_fr: Type non géré pour le deuxième argument de A^B

source: Unhandled type combination for A^B
fr_fr: Combinaison de types non gérée pour A^B

source: Integer type not managed.
fr_fr: Type entier non géré.

source: Same class type expected.
fr_fr: Le même type de classe est attendu.

source: Matrix is rank deficient to machine precision:
fr_fr: La matrice est de rang défectueux à la précision machine :

source: Requested divide operation requires arguments to have correct dimensions.
fr_fr: L'opération de division demandée nécessite que les arguments aient des dimensions correctes.

source: Matrix is singular to working precision:
fr_fr: La matrice est singulière à la précision de travail :

source: At least one input argument must be scalar.
fr_fr: Au moins un argument d'entrée doit être scalaire.

source: using operator '*' Matrix dimensions must agree.
fr_fr: en utilisant l'opérateur '*' Les dimensions de la matrice doivent être compatibles.

source: Complex integer not allowed for arithmetic operator
fr_fr: Nombre complexe entier non autorisé pour l'opérateur arithmétique

source: Input argument must be real.
fr_fr: L'argument d'entrée doit être réel.

source: transpose on N-D array is undefined.
fr_fr: La transposition sur un tableau N-D est indéfinie.

source: Unknown command option.
fr_fr: Option de commande inconnue.

source: Cannot set environment variable.
fr_fr: Impossible de définir la variable d'environnement.

source: Unrecognized option. "-echo" or timeout value expected.
fr_fr: Option non reconnue. "-echo" ou une valeur de temporisation est attendue.

source: same size expected.
fr_fr: La même taille est attendue.

source: Filename not associated to an application.
fr_fr: Nom de fichier non associé à une application.

source: 'name' argument requires 3 input arguments.
fr_fr: L'argument 'name' nécessite 3 arguments d'entrée.

source: system does not return result.
fr_fr: le système ne retourne pas de résultat.

source: Invalid ROOTKEY value.
fr_fr: Valeur de ROOTKEY invalide.

source: Cannot get KEY information.
fr_fr: Impossible d'obtenir les informations sur la clé.

source: Invalid SUBKEY value.
fr_fr: Valeur de SUBKEY invalide.

source: Cannot convert RegQueryValueEx.
fr_fr: Impossible de convertir RegQueryValueEx.

source: Future handle expected.
fr_fr: Un handle de future est attendu.

source: FevalFuture handle expected.
fr_fr: Un handle FevalFuture est attendu.

source: function handle handle expected.
fr_fr: Un handle de fonction est attendu.

source: integer value expected.
fr_fr: Valeur entière attendue.

source: non negative value expected.
fr_fr: Valeur non négative attendue.

source: backgroundPool handle expected.
fr_fr: Un handle de backgroundPool est attendu.

source: a numeric scalar value expected.
fr_fr: Une valeur scalaire numérique est attendue.

source: FevalQueue handle expected.
fr_fr: Un handle FevalQueue est attendu.

source: Valid states to wait for are: 'running' or 'finished'.
fr_fr: Les états valides à attendre sont : 'running' ou 'finished'.

source: Expected timeout to be non-negative real numerical scalar.
fr_fr: Le délai d'attente attendu doit être un scalaire numérique réel non négatif.

source: Cannot wait for completion of Futures that are in state 'unavailable'.
fr_fr: Impossible d'attendre l'achèvement des futures qui sont dans l'état 'non disponible'.

source: Invalid backgroundPool handle.
fr_fr: Handle de backgroundPool invalide.

source: outstanding future.
fr_fr: Future exceptionnel.

source: outstanding futures.
fr_fr: Futures exceptionnels.

source: %s handle expected.
fr_fr: Un %s handle est attendu.

source: %s valid handle expected.
fr_fr: Un %s handle valide est attendu.

source: There are no unread Futures to fetch.
fr_fr: Il n'y a aucun Future non lu à récupérer.

source: One or more futures resulted in an error.
fr_fr: Un ou plusieurs futures ont entraîné une erreur.

source: Unable to concatenate outputs.
fr_fr: Impossible de concaténer les sorties.

source: Same size
fr_fr: Même taille

source: option not managed.
fr_fr: option non gérée.

source: Profile struct expected.
fr_fr: Structure de profil attendue.

source: Summary
fr_fr: Résumé

source: Profile Summary
fr_fr: Résumé du profil

source: Filename
fr_fr: Nom de fichier

source: Number of Calls
fr_fr: Nombre d'appels

source: Total Time (s)
fr_fr: Temps total (s)

source: Coverage %
fr_fr: Couverture %

source: Lines where the most time was spent
fr_fr: Lignes où la plupart du temps a été passé

source: Line Number
fr_fr: Numéro de ligne

source: Calls
fr_fr: Appels

source: Total time (s)
fr_fr: Temps total (s)

source: Coverage results
fr_fr: Résultats de couverture

source: Total lines in file
fr_fr: Total des lignes dans le fichier

source: Non-code lines (comments, blank lines)
fr_fr: Lignes non codées (commentaires, lignes vides)

source: Code lines that did run
fr_fr: Lignes de code qui ont été exécutées

source: Code lines (lines that can run)
fr_fr: Lignes de code (lignes qui peuvent s'exécuter)

source: Code lines (Code lines that did not run)
fr_fr: Lignes de code (lignes de code qui n'ont pas été exécutées)

source: Coverage (did run/can run)
fr_fr: Couverture (exécuté/pouvant s'exécuter)

source: Function listing
fr_fr: Liste des fonctions

source: Line
fr_fr: Ligne

source: Time (s)
fr_fr: Temps (s)

source: Source code
fr_fr: Code source

source: lines
fr_fr: lignes

source: Profile and Coverage
fr_fr: Profil et couverture

source: File
fr_fr: Fichier

source: Time
fr_fr: Temps

source: NumCalls
fr_fr: NumAppels

source: TotalTime (s)
fr_fr: TempsTotal (s)

source: PerCall (s)
fr_fr: ParAppel (s)

source: Filename:LinePosition(FunctionName)
fr_fr: NomDeFichier:PositionDeLigne(NomDeFonction)

source: QObject handle expected.
fr_fr: Handle QObject attendu.

source: No property for class QObject.
fr_fr: Pas de propriété pour la classe QObject.

source: Properties for class QObject:
fr_fr: Propriétés de la classe QObject :

source: Name not found.
fr_fr: Nom non trouvé.

source: QObject scalar handle expected.
fr_fr: Handle scalaire QObject attendu.

source: handle to deleted:
fr_fr: handle supprimé :

source: QObject valid handle expected.
fr_fr: Handle QObject valide attendu.

source: No parent.
fr_fr: Pas de parent.

source: Only 10 input parameters expected.
fr_fr: Seulement 10 paramètres d'entrée attendus.

source: Invalid parameters
fr_fr: Paramètres invalides

source: Cannot create QQuickView.
fr_fr: Impossible de créer QQuickView.

source: Cannot set parent.
fr_fr: Impossible de définir le parent.

source: QML engine not initialized.
fr_fr: Moteur QML non initialisé.

source: Uncaught exception at line
fr_fr: Exception non capturée à la ligne

source: Uncaught exception in
fr_fr: Exception non capturée dans

source: at line
fr_fr: à la ligne

source: QVariant invalid.
fr_fr: QVariant invalide.

source: property type not managed.
fr_fr: type de propriété non géré.

source: vector expected.
fr_fr: Vecteur attendu.

source: vector 1x3 expected.
fr_fr: Vecteur 1x3 attendu.

source: vector 1x4 expected.
fr_fr: Vecteur 1x4 attendu.

source: vector 1x7 expected.
fr_fr: Vecteur 1x7 attendu.

source: vector 1x2 expected.
fr_fr: Vecteur 1x2 attendu.

source: vector 1x6 expected.
fr_fr: Vecteur 1x6 attendu.

source: matrix 3x3 expected.
fr_fr: matrice 3x3 attendue.

source: matrix 4x4 expected.
fr_fr: matrice 4x4 attendue.

source: structs expected.
fr_fr: structs attendues.

source: QVariant type not managed.
fr_fr: Type QVariant non géré.

source: Type conversion to QVariant not managed.
fr_fr: Conversion de type en QVariant non gérée.

source: Empty matrix not managed.
fr_fr: Matrice vide non gérée.

source: QObject parent egals to the child.
fr_fr: Le parent QObject est égal à l'enfant.

source: 'children' can not modified.
fr_fr: 'children' ne peut pas être modifié.

source: 'className' can not modified.
fr_fr: 'className' ne peut pas être modifié.

source: 'parent' can not modified.
fr_fr: 'parent' ne peut pas être modifié.

source: 'single' or 'double' expected at last argument.
fr_fr: 'single' ou 'double' attendu en dernier argument.

source: random engine not initialized.
fr_fr: moteur de nombres aléatoires non initialisé.

source: 'default', 'shuffle' or 'enginelist' expected.
fr_fr: 'default', 'shuffle' ou 'enginelist' attendu.

source: A valid generator name expected.
fr_fr: Un nom de générateur valide est attendu.

source: 'shuffle' expected.
fr_fr: 'shuffle' attendu.

source: Must contain generator settings captured previously.
fr_fr: Doit contenir les paramètres du générateur capturés précédemment.

source: A valid generator expected.
fr_fr: Un générateur valide est attendu.

source: dimensions of state must be
fr_fr: les dimensions de l'état doivent être

source: type of state must be uint32.
fr_fr: le type de l'état doit être uint32.

source: type of state must be uint64.
fr_fr: le type de l'état doit être uint64.

source: name already register.
fr_fr: le nom est déjà enregistré.

source: reserved name
fr_fr: nom réservé

source: Input argument #1: scalar expected.
fr_fr: Argument d'entrée #1 : scalaire attendu.

source: Input argument #2: scalar expected.
fr_fr: Argument d'entrée #2 : scalaire attendu.

source: Input argument #3: scalar expected.
fr_fr: Argument d'entrée #3 : scalaire attendu.

source: Input argument #4: wrong size.
fr_fr: Argument d'entrée #4 : taille incorrecte.

source: Input argument #5: wrong size.
fr_fr: Argument d'entrée #5 : taille incorrecte.

source: Input argument #6: wrong size.
fr_fr: Argument d'entrée #6 : taille incorrecte.

source: Input argument #7: scalar expected.
fr_fr: Argument d'entrée #7 : scalaire attendu.

source: Input argument #8: scalar expected.
fr_fr: Argument d'entrée #8 : scalaire attendu.

source: Input argument #9: wrong size.
fr_fr: Argument d'entrée #9 : taille incorrecte.

source: Input argument #10: scalar expected.
fr_fr: Argument d'entrée #10 : scalaire attendu.

source: Input argument #7: wrong size.
fr_fr: Argument d'entrée #7 : taille incorrecte.

source: Input argument #1: wrong size.
fr_fr: Argument d'entrée #1 : taille incorrecte.

source: Input argument #2: wrong size.
fr_fr: Argument d'entrée #2 : taille incorrecte.

source: Input argument #3: wrong size.
fr_fr: Argument d'entrée #3 : taille incorrecte.

source: Input argument #4: scalar expected.
fr_fr: Argument d'entrée #4 : scalaire attendu.

source: Input argument #9: scalar expected.
fr_fr: Argument d'entrée #9 : scalaire attendu.

source: Input argument #5: scalar expected.
fr_fr: Argument d'entrée #5 : scalaire attendu.

source: Input argument #6: scalar expected.
fr_fr: Argument d'entrée #6 : scalaire attendu.

source: Input argument #13: scalar expected.
fr_fr: Argument d'entrée #13 : scalaire attendu.

source: Input argument #10: wrong size.
fr_fr: Argument d'entrée #10 : taille incorrecte.

source: Input argument #11: wrong size.
fr_fr: Argument d'entrée #11 : taille incorrecte.

source: Input argument #13: wrong size.
fr_fr: Argument d'entrée #13 : taille incorrecte.

source: Input argument #14: wrong size.
fr_fr: Argument d'entrée #14 : taille incorrecte.

source: Input argument #16: scalar expected.
fr_fr: Argument d'entrée #16 : scalaire attendu.

source: Sparse matrix indices must be positive integers.
fr_fr: Les indices de la matrice creuse doivent être des entiers positifs.

source: in I, J, V format, all three vectors must be the same size or be scalars.
fr_fr: Sous le format I, J, V, les trois vecteurs doivent être de même taille ou être des scalaires.

source: Index into matrix must be positive.
fr_fr: L'indice dans la matrice doit être positif.

source: Index exceeds matrix dimensions.
fr_fr: L'indice dépasse les dimensions de la matrice.

source: Sparse expected.
fr_fr: Sparse attendue.

source: Cannot do imag with current type '
fr_fr: Impossible de faire imag avec le type actuel '

source: type not supported.
fr_fr: type non pris en charge.

source: Cannot do real with current type '
fr_fr: Impossible de faire real avec le type actuel '

source: Unsupported type in EyeSparseMatrixConstructor.
fr_fr: Type non pris en charge dans EyeSparseMatrixConstructor.

source: Unsupported type in MakeDenseArrayOf.
fr_fr: Type non pris en charge dans MakeDenseArrayOf.

source: Unsupported type in MakeSparseArrayOf
fr_fr: Type non pris en charge dans MakeSparseArrayOf

source: Unsupported type in CopySparseMatrix.
fr_fr: Type non pris en charge dans CopySparseMatrix.

source: Invalid sparse.
fr_fr: Sparse invalide.

source: Unsupported type in CountNonzeros.
fr_fr: Type non pris en charge dans CountNonzeros.

source: Unsupported type in CountNonzerosMax.
fr_fr: Type non pris en charge dans CountNonzerosMax.

source: Unsupported type in SparseMatrixConstructor.
fr_fr: Type non pris en charge dans SparseMatrixConstructor.

source: Index exceeds variable dimensions.
fr_fr: L'indice dépasse les dimensions de la variable.

source: Unsupported type in SetSparseNDimSubsets.
fr_fr: Type non pris en charge dans SetSparseNDimSubsets.

source: Eigen_DeleteSparseMatrixVectorSubset advanced not yet implemented.
fr_fr: Eigen_DeleteSparseMatrixVectorSubset avancé pas encore implémenté.

source: Eigen_SetSparseNDimSubsets advanced not yet implemented.
fr_fr: Eigen_SetSparseNDimSubsets avancé pas encore implémenté.

source: Unsupported type in SparseToIJV.
fr_fr: Type non pris en charge dans SparseToIJV.

source: Repeated indices are not supported for sparse logical matrices.
fr_fr: Les indices répétés ne sont pas pris en charge pour les matrices logiques creuses.

source: Eigen_DeleteSparseMatrixCols not yet implemented.
fr_fr: Eigen_DeleteSparseMatrixCols pas encore implémenté.

source: Eigen_DeleteSparseMatrixRows not yet implemented.
fr_fr: Eigen_DeleteSparseMatrixRows pas encore implémenté.

source: Eigen_DeleteSparseMatrixVectorSubset not yet implemented.
fr_fr: Eigen_DeleteSparseMatrixVectorSubset pas encore implémenté.

source: Unsupported type in TypeConvertSparse.
fr_fr: Type non pris en charge dans TypeConvertSparse.

source: Unsupported type in TypeConvertSparse (complex to logical).
fr_fr: Type non pris en charge dans TypeConvertSparse (complexe à logique).

source: Unsupported type in TypeConvertSparse (complex to double).
fr_fr: Type non pris en charge dans TypeConvertSparse (complexe à double).

source: Unsupported type in ReshapeSparseMatrix.
fr_fr: Type non pris en charge dans ReshapeSparseMatrix.

source: Cannot do uminus with current type
fr_fr: Impossible de faire uminus avec le type actuel

source: Wrong value of the fourth argument 'upper' or 'lower' expected.
fr_fr: Mauvaise valeur du quatrième argument, 'upper' ou 'lower' attendu.

source: Input argument must be dense and real.
fr_fr: L'argument d'entrée doit être dense et réel.

source: 'linear' method expected.
fr_fr: Méthode 'linear' attendue.
