Repository: nelson-lang/nelson
Catalog: locales/*/LC_MESSAGES/nelson.po
Languages: fr_fr

source: Cannot apply numeric operation
fr_fr: Vous ne pouvez pas appliquer une opération numérique

source: Cannot apply matrix operation
fr_fr: Impossible d'appliquer l'opération de matrice

source: Size mismatch on arguments to arithmetic operator
fr_fr: Différence de taille sur les arguments de l'opérateur arithmétique

source: Size mismatch on arguments to
fr_fr: Différence de taille sur des arguments à

source: isapprox returns more than one output argument.
fr_fr: isapprox retourne plus qu'un argument en sortie.

source: Unrecognized option. "s" expected.
fr_fr: Option non reconnue. « s » attendu.

source: Type 'double' or 'single' expected.
fr_fr: Type «double» ou «unique» attendu.

source: N-dimensional arrays are not supported.
fr_fr: Tableaux à N-dimensions ne sont pas supportés.

source: 'like' expected at n - 2 argument.
fr_fr: 'like' attendu à l'argument n-2.

source: sparse not supported.
fr_fr: sparse non supporté

source: #1 string expected.
fr_fr: #1 chaîne attendue.

source: #2 'errcatch' or 'nocatch' expected.
fr_fr: #2 'errcatch' ou 'nocatch' attendu.

source: #2 string expected.
fr_fr: #2 chaîne attendue.

source: unexpected format.
fr_fr: format inattendu.

source: not allowed in base scope.
fr_fr: non autorisé dans le scope de base.

source: Wrong value for #1 argument, 'fullpathext' or 'fullpath' expected.
fr_fr: Valeur incorrecte pour l'argument #1, 'fullpathext' ou 'fullpath' attendu.

source: at line %5d of '%s'
fr_fr: à la ligne %5d de '%s'

source: at line %5d of '%s'
fr_fr: à la ligne %5d de '%s'

source: Unknow option.
fr_fr: Option inconnue.

source: Cannot change directory '
fr_fr: Ne peut pas changer de répertoire '

source: File does not exist.
fr_fr: Le fichier n'existe pas.

source: An valid script expected.
fr_fr: Un script valid attendu

source: Memory allocation.
fr_fr: Erreur d'allocation mémoire

source: Error: we cannot find Nelson binaries path.
fr_fr: Erreur : nous ne pouvons pas trouver le chemin des binaires de NelSon.

source: Error: we cannot find Nelson root path.
fr_fr: Erreur : nous ne pouvons pas trouver le chemin d'accès racine de NelSon.

source: Error: we cannot create preferences path.
fr_fr: Erreur : nous ne pouvons pas créér le chemin des preferences de NelSon.

source: Error: we cannot find Nelson preferences path.
fr_fr: Erreur : nous ne pouvons pas trouver le chemin des preferences de NelSon.

source: function not found.
fr_fr: fonction non trouvée.

source: Not yet implemented with dim > 2
fr_fr: Pas encore implémenté avec dim > 2

source: Number of field names must match number of fields in new structure.
fr_fr: Nombre de noms de champs doit correspondre nombre de valeurs dans la structure constructeur.

source: function returned non-scalar result
fr_fr: La fonction a retourné un résultat non scalaire

source: Error wrong type expected.
fr_fr: Erreur mauvais type attendu.

source: Error already defined.
fr_fr: Erreur déjà définie.

source: wrong type #1
fr_fr: mauvais type #1

source: A valid function name expected.
fr_fr: Un nom de fonction valide attendu.

source: same size expected.
fr_fr: Même taille attendue.

source: cell expected.
fr_fr: cell attendu.

source: not defined.
fr_fr: Non défini

source: struct([]) expected.
fr_fr: struct([]) attendu.

source: requires pairs of field names and values.
fr_fr: nécessite des paires de noms de champs et valeurs.

source: requires a valid fieldname.
fr_fr: nécessite un nom de champs valide.

source: Invalid range.
fr_fr: Plage non valide

source: Empty matrix :
fr_fr: Matrice vide :

source: -by-
fr_fr: -par-

source: Columns %d to %d
fr_fr: Colonnes %d to %d

source: File not found.
fr_fr: Fichier non trouvé.

source: Module not loaded: symbol not found.
fr_fr: Module non chargé : symbole non trouvé.

source: Module not loaded: library not loaded.
fr_fr: Module non chargé : bibliothèque non chargé.

source: Module not loaded: library not loaded.
fr_fr: Module non chargé : bibliothèque non chargé.

source: Sparse type not supported.
fr_fr: sparse non supporté.

source: Numerics types expected.
fr_fr: Type numérique attendu.

source: finite value expected.
fr_fr: valeur finie attendue.

source: real integer expected.
fr_fr: entier réel attendu.

source: real positive integer expected.
fr_fr: entier positif réel attendu.

source: only one unknown dimension allowed.
fr_fr: Une seule dimension inconnue autorisé.

source: Wrong value for argument #2. 'r' or 'c' expected
fr_fr: Valeur incorrecte pour argument #2. « r » ou « c » attendu.

source: Input arguments must be full.
fr_fr: Les arguments d'entrée doivent être plein.

source: Input arguments must be numeric.
fr_fr: Les arguments d'entrée doivent être de type numérique.

source: Input arguments must be real.
fr_fr: Les arguments d'entrée doivent être de type réel.

source: Input arguments must have the same size.
fr_fr: Les arguments d'entrée doivent avoir la même taille.

source: Undefined function '
fr_fr: Fonction non définie '

source: unknown mode.
fr_fr: mode inconnu

source: Main finish.nls failed to run.
fr_fr: Le fichier finish.nls principal a échoué.

source: User finish.nls failed to run.
fr_fr: Le fichier finish.nls utilisateur a échoué.

source: This mode is not yet implemented.
fr_fr: Ce mode n'est pas encore implémenté.

source: unknow engine.
fr_fr: moteur de nombre aléatoire inconnu.

source: Gui module not loaded.
fr_fr: Fonction de GUI non chargés.

source: Gui Function not loaded.
fr_fr: Fonction de GUI non chargés.

source: no value after
fr_fr: aucune valeur après

source: multiple option
fr_fr: option multiple

source: display this help message
fr_fr: afficher ce message d'aide

source: display the version number
fr_fr: afficher le numéro de version

source: no main startup file
fr_fr: aucun fichier de démarrage principal

source: no user startup file
fr_fr: aucun fichier de démarrage de l'utilisateur

source: command to execute
fr_fr: Instruction à exécuter

source: file to execute
fr_fr: fichier à exécuter

source: language used in current session
fr_fr: langue utilisée dans la session en cours

source: wrong value for timeout option.
fr_fr: Valeur incorrecte pour l'option timeout.

source: Error
fr_fr: Erreur

source: Nelson paths not initialized.
fr_fr: Chemins de Nelson non initialisé.

source: Nelson paths not initialized.
fr_fr: Chemins de Nelson non initialisé.

source: Nelson interpreter not initialized.
fr_fr: Nelson interpréteur non initialisé.

source: Nelson interpreter not initialized.
fr_fr: Interpréteur Nelson non initialisé.

source: Current C stack is:
fr_fr: La pile C actuelle est :

source: Main startup.nls failed to run.
fr_fr: Le fichier startup.nls principal a échoué.

source: User startup.nls failed to run.
fr_fr: Le fichier startup.nls utilisateur a échoué.

source: Wrong value for #2 input argument.
fr_fr: Mauvaise valeur pour l'argument #2.

source: 'reset' expected.
fr_fr: 'reset' attendu.

source: a structure or the string 'reset' expected.
fr_fr: une structure ou la chaîne « reset » attendu.

source: called from:
fr_fr: appelée à partir de :

source: at line:
fr_fr: à la ligne:

source: Impossible to get current directory.
fr_fr: Impossible de recuperer le repertoire courant.

source: Not a file or a directory.
fr_fr: Pas un fichier ou un répertoire.

source: Cannot change directory: '
fr_fr: Ne peut pas changer de répertoire '

source: File source does not exist.
fr_fr: Fichier source n'existe pas.

source: Directory source does not exist.
fr_fr: Répertoire source n'existe pas.

source: Directory destination does not exist.
fr_fr: Destination de répertoire n'existe pas.

source: A cell of existing filenames expected.
fr_fr: Une cell de string (nom de fichier) attendue.

source: Permission denied.
fr_fr: Permission refusée.

source: Directory already exists.
fr_fr: Le répertoire existe déjà.

source: an existing directory expected.
fr_fr: Répertoire existant attendu.

source: an existing file expected.
fr_fr: Un fichier existant attendu.

source: Warning: Not a directory:
fr_fr: Attention: Ce n'est pas un répertoire:

source: function '
fr_fr: fonction '

source: ' is not a builtin.
fr_fr: ' n'est pas une builtin.

source: ' is not a function.
fr_fr: ' n'est pas une fonction.

source: function macro name not found.
fr_fr: nom de la macro fonction introuvable.

source: Not an existing directory:
fr_fr: Répertoire existant attendu:

source: #2 Argument must be '-all' or '-module'.
fr_fr: # 2 L'argument doit être '-all' ou '-module'.

source: a valid function definition expected.
fr_fr: une définition de fonction valide attendue.

source: ' already defined.
fr_fr: ' déjà défini.

source: Argument must be a valid filename.
fr_fr: L'argument doit être un nom de fichier valide.

source: is defined in memory only.
fr_fr: est défini en mémoire.

source: file does not exist.
fr_fr: Le fichier nexiste pas.

source: cannot read file.
fr_fr: Impossible de lire le fichier

source: is already a protected macro.
fr_fr: est déjà une macro protégée.

source: not a macro.
fr_fr: n'est pas une macro.

source: not found.
fr_fr: non trouvé

source: #1 Argument must contain a valid function_handle.
fr_fr: Argument #1 doit contenir un function_handle valide.

source: Function does not exist.
fr_fr: Fonction n'existe pas.

source: Argument #1 must be a valid function_handle.
fr_fr: Argument #1 doit contenir un function_handle valide.

source: function_handle not valid.
fr_fr: function_handle non valide.

source: Execute...
fr_fr: Executer...

source: Interpreter currently runs.
fr_fr: En cours d'execution

source: About Nelson...
fr_fr: A propos de Nelson...

source: &File
fr_fr: &Fichier

source: Execute a .nls file
fr_fr: Executer un fichier .nls

source: &Change current directory
fr_fr: &Changer de répertoire courant

source: Change current directory
fr_fr: Changer de répertoire courant

source: &Display current directory
fr_fr: &Afficher le répertoire courant

source: Display current directory
fr_fr: Afficher le répertoire courant

source: E&xit
fr_fr: Q&uitter

source: Exit the application
fr_fr: Quitter l'application

source: &Edit
fr_fr: &Editer

source: C&ut
fr_fr: C&ouper

source: Cut
fr_fr: Couper

source: &Copy
fr_fr: &Copier

source: Copy
fr_fr: Copier

source: &Paste
fr_fr: &Coller

source: Paste
fr_fr: Coller

source: &Select all
fr_fr: &Tout sélectionner

source: Select all
fr_fr: Tout sélectionner

source: &Empty clipboard
fr_fr: &Vider le presse papier

source: Empty clipboard
fr_fr: Vider le presse papier

source: Clear c&onsole
fr_fr: Effacer la c&onsole

source: Clear console
fr_fr: Effacer la console

source: &Help
fr_fr: &Aide

source: &About
fr_fr: &A propos

source: About
fr_fr: A propos

source: Close confirmation
fr_fr: Fermer confirmation

source: Are you sure to quit?
fr_fr: Êtes-vous sûr de vouloir quitter ?

source: Help on Selection
fr_fr: Aide sur le texte séléctionné

source: Select All
fr_fr: Tout sélectionner

source: Clear Command Window
fr_fr: Effacer la fenêtre de commande

source: Stop execution
fr_fr: Arrêter l'exécution

source: Qt Assistant not found.
fr_fr: Qt Assistant non trouvé.

source: help collection file not found.
fr_fr: fichier help collection non trouvée.

source: built-in have no comments.
fr_fr: fonction intégrée n'ont aucun commentaire.

source: function does not exist.
fr_fr: fonction n'existe pas.

source: A valid function expected.
fr_fr: Un nom de fonction valide attendu.

source: Cannot not open destination file.
fr_fr: Impossible d'ouvrir le fichier de destination.

source: pdf file not generated.
fr_fr: fichier PDF non généré.

source: pdf cannot generated in this engine mode.
fr_fr: fichier pdf non généré dans ce mode.

source: Existing directory expected.
fr_fr: Répertoire existant attendu.

source: Errors:
fr_fr: Erreurs:

source: Error:
fr_fr: Erreur:

source: No error.
fr_fr: Aucune erreur.

source: Warnings:
fr_fr: Attention :

source: Warning:
fr_fr: Attention :

source: No warning.
fr_fr: Aucun avertissement.

source: Wrong value for argument #1: An existing .xml documentation file expected.
fr_fr: Mauvaise valeur pour l'argument n °1: Un fichier .xml documentation attendu.

source: Wrong type for argument #1: .xml documentation file expected.
fr_fr: Type incorrect pour l'argument #1: Un fichier .xml documentation attendu

source: Authors
fr_fr: Auteurs

source: Author
fr_fr: Auteur

source: Bibliography
fr_fr: Bibliographie

source: File does not exist:
fr_fr: Le fichier n'existe pas:

source: XmlDocDirectory not created.
fr_fr: XmlDocDirectory n'a pas été créé.

source: line
fr_fr: à la ligne:

source: not managed.
fr_fr: Non géré.

source: missing.
fr_fr: manquant.

source: invalid.
fr_fr: invalide.

source: is empty.
fr_fr: est vide.

source: cannot allocate memory.
fr_fr: ne peux allouer de la mémoire.

source: not supported.
fr_fr: non disponible

source: file does not exist.
fr_fr: Le fichier n'existe pas.

source: not found.
fr_fr: non trouvé.

source: has no property.
fr_fr: n'a aucune propriété.

source: Examples
fr_fr: Exemples

source: Example
fr_fr: Exemple

source: History
fr_fr: Historique

source: Error in file:
fr_fr: Erreur dans le fichier:

source: chapter.xml file is missing.
fr_fr: Fichier chapter.xml est manquant.

source: chapter.xml is missing.
fr_fr: chapter.xml est manquant.

source: Input argument
fr_fr: Argument d'entrée

source: Output argument
fr_fr: Argument de sortie

source: See also
fr_fr: Voir aussi

source: Syntax
fr_fr: Syntaxe

source: Used function(s)
fr_fr: fonction(s) utilisée(s)

source: Cannot create a parser context
fr_fr: Impossible de créer un contexte de l'analyseur

source: History manager not enabled.
fr_fr: Gestionnaire de l'historique non activé.

source: The name of an integer class expected.
fr_fr: Le nom d'une classe de type entier attendu.

source: Conversion to '
fr_fr: Conversion de '

source: Invalid conversion.
fr_fr: Conversion non valide.

source: Argument #1: 'max' expected.
fr_fr: Argument #1: « max » attendu.

source: Argument #1: valid value expected.
fr_fr: Argument #1: une valeur valide attendue.

source: function
fr_fr: fonction

source: undefined.
fr_fr: non défini

source: System error detected.
fr_fr: Erreur systéme detectée.

source: Redefining permanent variable.
fr_fr: Redéfinition d'une variable permanente.

source: %d of %d:
fr_fr: %d de %d:

source: unable to resolve
fr_fr: incapable de résoudre

source: Undefined function
fr_fr: fonction indéfinie

source: Insufficient number of outputs.
fr_fr: Nombre incorrect d'arguments de sortie.

source: %d %s line %d
fr_fr: %d %s ligne %d

source: In %s(%s), line %d, position %d
fr_fr: Dans %s(%s), ligne %d, position %d

source: Undefined variable:
fr_fr: Variable non définie:

source: Undefined function:
fr_fr: Fonction non définie:

source: Undefined variable or function:
fr_fr: Variable ou fonction non définie:

source: index expected.
fr_fr: index attendu.

source: a valid script expected.
fr_fr: Un script valide attendu.

source: Function name:%s
fr_fr: Nom de la fonction:%s

source: Lexical error '%s' at line %d of file %s
fr_fr: Erreur lexical '%s' à la ligne %d du fichier %s

source: Lexical error '%s'
fr_fr: Erreur lexical '%s'

source: Lexical error
fr_fr: Erreur lexical

source: mismatched parenthesis
fr_fr: parenthèses dépareillés

source: unterminated string
fr_fr: chaîne non terminée

source: exceeds the Nelson maximum name length of %d characters.
fr_fr: dépasse la longueur maximale des noms de NelSon de %d caractères.

source: malformed floating point constant
fr_fr: virgule flottante mal formaté

source: function
fr_fr: fonction

source: undefined.
fr_fr: non défini.

source: . function not loaded.
fr_fr: . Fonction non chargée.

source: Expecting %s at line %d, column %d of file %s
fr_fr: Attend %s à la ligne %d, colonne %d du fichier %s

source: Expecting %s
fr_fr: Attend %s

source: function name for function declared
fr_fr: nom de la fonction pour la fonction déclarée

source: indexing expression
fr_fr: expression d'indexation

source: indexing list
fr_fr: liste d'indexation

source: left parenthesis
fr_fr: parenthèse gauche

source: an expression after ':'
fr_fr: une expression après ':'

source: an expression after '+'
fr_fr: une expression après '+'

source: an expression after '-'
fr_fr: une expression après '-'

source: an expression after '*'
fr_fr: une expression après ' *'

source: an expression after '/'
fr_fr: une expression après '/'

source: an expression after '\'
fr_fr: une expression après ' \'

source: an expression after '|'
fr_fr: une expression après ' |'

source: an expression after '&'
fr_fr: une expression après '&'

source: an expression after '||'
fr_fr: une expression après ' ||'

source: an expression after '&&'
fr_fr: une expression après '&&'

source: an expression after '<'
fr_fr: une expression après '<'

source: an expression after '<='
fr_fr: une expression après '<='

source: an expression after '>'
fr_fr: une expression après '>'

source: an expression after '>='
fr_fr: une expression après '>='

source: an expression after '=='
fr_fr: une expression après '=='

source: an expression after '~='
fr_fr: une expression après '~='

source: an expression after '.*'
fr_fr: une expression après « .* »

source: a right parenthesis after expression to match this one
fr_fr: une parenthèse fermante après une expression en fonction de celui-ci

source: an expression after left parenthesis
fr_fr: une expression après la parenthèse ouvrante

source: a matrix definition followed by a right bracket
fr_fr: une définition de la matrice suivie d'une parenthèse fermante

source: Size mismatch on arguments.
fr_fr: Différence de taille sur les arguments.

source: Invalid type.
fr_fr: Type Invalide

source: Conversion to logical from handle is not possible.
fr_fr: Conversion logical depuis handle n'est pas possible.

source: Conversion to logical from complex is not possible.
fr_fr: La conversion de logique complexe n'est pas possible.

source: #1 Argument must contain a string: 'global', 'base', 'local' or 'caller' expected.
fr_fr: #1 argument doit contenir une chaîne: « global », « base », « local » ou « appelant » attendu.

source: #2 Argument must contain a valid variable name.
fr_fr: #2 argument doit contenir un nom de variable valide.

source: variable not found.
fr_fr: variable non trouvée.

source: A valid variable name expected.
fr_fr: Un nom de variable valide attendu.

source: variable is locked.
fr_fr: variable est verrouillé.

source: Argument must contain a valid variable name.
fr_fr: Argument doit contenir un nom de variable valide.

source: A 'persistent' declaration is only allowed in a script file function.
fr_fr: Une déclaration « persistante » est uniquement autorisée dans une fonction de fichier de script.

source: #2 Argument must be an existing variable name.
fr_fr: #2 l'argument doit être un nom de variable existant.

source: Argument #1 : 'global', 'base', 'local' or 'caller' expected.
fr_fr: Argument #1: 'global', 'base', 'local' ou 'caller' attendu.

source: Wrong scope.
fr_fr: Mauvais scope.

source: invalid module name.
fr_fr: nom du module non valide.

source: Argument #3 must be a valid option.
fr_fr: #3 de l'argument doit être une option valide.

source: is not installed.
fr_fr: n'est pas installé.

source: : This module is already used.
fr_fr: : Ce module est déjà utilisé.

source: An existing module with the same name already used.
fr_fr: Un module existant portant le même nom déjà utilisé.

source: An existing module with the same path already defined.
fr_fr: Un module existant avec le même chemin déjà défini.

source: loader.nls does not exist.
fr_fr: Loader.nls n'existe pas.

source: Path does not exist:
fr_fr: Chemin d'accès n'existe pas :

source: Wrong option.
fr_fr: Mauvaise option.

source: finish.nls does not exist.
fr_fr: finish.nls n'existe pas.

source: Unknown command option.
fr_fr: Option de commande inconnue.

source: Unrecognized option. "-echo" expected.
fr_fr: Option non reconnue. "-echo" attendu.

source: Filename not associated to an application.
fr_fr: Nom de fichier non associé à une application.

source: Not implemented on this platform.
fr_fr: Non mis en place sur cette plateforme.

source: Cannot call unix command.
fr_fr: Impossible d'appeler commande unix.

source: Cannot duplicate stdout (1).
fr_fr: Ne peux pas dupliquer stdout (1).

source: Cannot duplicate stdin (1).
fr_fr: Ne peux pas dupliquer stdin (1).

source: Cannot duplicate stderr (1).
fr_fr: Ne peux pas dupliquer stderr (1).

source: Cannot redirect stdout.
fr_fr: Ne peux rediriger stdout.

source: Cannot redirect stderr.
fr_fr: Ne peux rediriger stderr.

source: Cannot restore stdout.
fr_fr: Ne peux restorer stdout.

source: Cannot restore stdin.
fr_fr: Ne peux restorer stdin

source: Cannot close redirected stdout.
fr_fr: Impossible de fermer la redirection de stdout.

source: Cannot close redirected stderr.
fr_fr: Impossible de fermer la rediriger stderr.

source: Cannot close redirected stdin.
fr_fr: Impossible de fermer la redirection stdin.

source: Cannot read results.
fr_fr: Ne peut pas lire les résultats.

source: Wrong OVERLOAD_TYPE.
fr_fr: Mauvais OVERLOAD_TYPE.

source: only one output argument expected.
fr_fr: Seule un argument de sortie attendu.

source: Too many dimensions! Current limit is
fr_fr: Trop de dimensions ! Limite actuelle est

source: random engine not initialized.
fr_fr: moteur de nombre aléatoire non initialisé.

source: 'default', 'shuffle' or 'enginelist' expected.
fr_fr: 'default', 'shuffle' ou 'enginelist' attendu.

source: A valid generator name expected.
fr_fr: Un nom de générateur valide attendu.

source: 'shuffle' expected.
fr_fr: 'shuffle' attendue.

source: A valid generator expected.
fr_fr: Un générateur valide attendu.

source: type of state must be uint32.
fr_fr: type d'État doit être uint32.

source: type of state must be uint64.
fr_fr: type d'État doit être uint64.

source: Size mismatch on arguments to arithmetic operator
fr_fr: Différence de taille sur les arguments de l'opérateur arithmétique

source: Conversion to single from handle is not possible.
fr_fr: La conversion du type 'handle' vers 'single' n'est pas possible.

source: Conversion to single from cell is not possible.
fr_fr: La conversion du type 'cell' vers 'single' n'est pas possible.

source: Sparse expected.
fr_fr: Sparse attendu.

source: type not supported.
fr_fr: type non supporté

source: Index exceeds variable dimensions.
fr_fr: L'index dépasse les dimensions de la variable.

source: Error using diary.
fr_fr: Erreur utilisant diary.

source: #1 Argument 'get' expected.
fr_fr: #1 argument « get » attendu.

source: #2 Argument 'Diary' or 'DiaryFile' expected.
fr_fr: #2 argument « Diary » ou « DiaryFile » attendu.

source: #1 Argument 'set' expected.
fr_fr: #1 argument « set » attendu.

source: #3 Argument 'on' or 'off' expected.
fr_fr: #3 argument « on » ou « off » attendu.

source: #3 Argument a string expected.
fr_fr: #3 argument une chaîne attendue.

source: Problem with file manager.
fr_fr: Problème avec le gestionnaire de fichiers.

source: Invalid file identifier.
fr_fr: Identificateur de fichier non valide.

source: Cannot close files.
fr_fr: Impossible de fermer les fichiers.

source: Wrong value for #1: 'all' expected.
fr_fr: Mauvaise valeur pour #1: « all » prévu.

source: Not implemented for requested file identifier.
fr_fr: Non implémenté pour l'identificateur de fichier demandé.

source: Second argument must be greater than zero.
fr_fr: Deuxième argument doit être supérieure à zéro.

source: Invalid name.
fr_fr: Nom incorrect.

source: Invalid file mode.
fr_fr: Mode de fichier non valide.

source: Impossible to add file.
fr_fr: Impossible d'ajouter le fichier.

source: Impossible to open file.
fr_fr: Impossible d'ouvrir le fichier.
