Repository: nelson-lang/nelson
Catalog: locales/*/LC_MESSAGES/nelson.po
Languages: fr_fr

source: Wrong value for machine format.
fr_fr: Valeur incorrecte pour le format machine.

source: Wrong value for #3 argument: not supported precision.
fr_fr: Mauvaise valeur pour l'argument #3: précision non prise en charge.

source: Problem to read data.
fr_fr: Problème pour lire les données.

source: Rewind failed.
fr_fr: Rembobinage à échoué.

source: Invalid origin.
fr_fr: Origine non valide.

source: Cannot write references type.
fr_fr: Impossible d'écrire des types éférences.

source: Cannot write sparse type.
fr_fr: Impossible d'écrire des types sparse.

source: Type not supported.
fr_fr: type non supporté.

source: Memory allocation error... You may have run out of memory!
fr_fr: Erreur : mémoire insuffisante.

source: Endian conversion not supported for this file identifier.
fr_fr: Conversion Endian non pris en charge pour cet identifieur de fichier.

source: Wrong value for #1 argument: a valid file ID expected.
fr_fr: Mauvaise valeur pour l'argument n ° 1: un ID de fichier valide attendu.

source: Unable to open file
fr_fr: Impossible d’ouvrir le fichier

source: Conversion to char from handle is not possible.
fr_fr: La conversion vers caractères depuis handle n'est pas possible.

source: Undefined function 'char' for input arguments of type
fr_fr: Fonction 'char' non définie pour les arguments d'entrée de type

source: Conversion to char from logical is not possible.
fr_fr: La conversion vers logical depuis char n'est pas possible.

source: Calendar not initialized.
fr_fr: Calendrier non initialisé.

source: Year value is wrong [1400, 9999] expected.
fr_fr: La valeur de l'année est mauvaise: [1400, 9999] attendu.

source: Month value is wrong [1, 12] expected.
fr_fr: La valeur du mois est mauvaise [1, 12] attendu.

source: Elapsed time is %f seconds.
fr_fr: Temps écoulé: %f secondes.

source: Cannot call toc.
fr_fr: Impossible d'appeler toc.

source: You must call 'tic' without an output argument before calling 'toc' without an input argument.
fr_fr: Vous devez appeler « tic » sans un argument de sortie avant d'appeler « toc » sans argument d'entrée.

source: Sun
fr_fr: Dim

source: M
fr_fr: Lun

source: Tu
fr_fr: Mar

source: W
fr_fr: Mer

source: Th
fr_fr: Jeu

source: F
fr_fr: Ven

source: Sat
fr_fr: Sam

source: Feb
fr_fr: Fév

source: Apr
fr_fr: Avr

source: May
fr_fr: Mai

source: Jun
fr_fr: Juin

source: Jul
fr_fr: Juil

source: Aug
fr_fr: Août

source: Sep
fr_fr: Sept

source: Dec
fr_fr: Déc

source: Undefined function 'cos' for input arguments of type
fr_fr: Fonction 'cos' non définie pour les arguments d'entrée de type

source: Undefined function 'sin' for input arguments of type
fr_fr: Fonction 'sin' non définie pour les arguments d'entrée de type

source: Undefined function 'tan' for input arguments of type
fr_fr: Fonction 'tan' non définie pour les arguments d'entrée de type

source: Undefined function 'cosh' for input arguments of type
fr_fr: Fonction 'cosh' non définie pour les arguments d'entrée de type

source: Undefined function 'sinh' for input arguments of type
fr_fr: Fonction 'sinh' non définie pour les arguments d'entrée de type

source: Undefined function 'tanh' for input arguments of type
fr_fr: Fonction 'tanh' non définie pour les arguments d'entrée de type

source: Undefined function 'acos' for input arguments of type
fr_fr: Fonction 'acos' non définie pour les arguments d'entrée de type

source: Undefined function 'asin' for input arguments of type
fr_fr: Fonction 'asin' non définie pour les arguments d'entrée de type

source: Undefined function 'atan' for input arguments of type
fr_fr: Fonction 'atan' non définie pour les arguments d'entrée de type

source: This declaration is only allowed from a class constructor.
fr_fr: Cette déclaration est seulement autorisé à partir d'un constructeur de classe.

source: Duplicated field detected.
fr_fr: Champ(s) dupliqué(s) détécté.

source: Illegal zero or negative index
fr_fr: Zéro illégale ou indice négatif

source: Cannot convert string data types to indices.
fr_fr: Impossible de convertir les types de données chaîne en indices.

source: Imaginary part of complex index ignored.
fr_fr: Partie imaginaire de l'ndex ignoré.

source: index must either be real positive integers or logicals.
fr_fr: index doit être des entiers positifs réel ou logical.

source: Zero or negative index encountered.
fr_fr: Zéro ou index négatif rencontrés.

source: Too big index encountered.
fr_fr: Trop gros indice rencontrée.

source: operation does not support sparse matrix arguments.
fr_fr: opération ne supporte pas les arguments de matrices creuses.

source: Warning: sparse matrix converted to full for operation.
fr_fr: AVERTISSEMENT : matrices creuses converti rn pleines pour opération.

source: Sparse not supported.
fr_fr: sparse non supporté

source: Scalar expected.
fr_fr: Un scalaire attendu.

source: Cannot resize sparse arrays.
fr_fr: Impossible de redimensionner les matrices creuses.

source: Byte size calculation not supported for sparse arrays.
fr_fr: Calcul de la taille octets non pris en charge pour les matrices creuses.

source: Invalid dimensions.
fr_fr: Dimensions non valides.

source: Cannot index into empty variable.
fr_fr: Ne peut pas indexer dans une variable vide.

source: Size mismatch in assignment A(I) = B.
fr_fr: Différence de taille dans l'affectation A (I) = B.

source: Size mismatch in assignment A(I1,I2,...,In) = B.
fr_fr: Différence de taille dans l'affectation A (I1, I2, ..., In) = B.

source: multidimensional indexing (more than 2 dimensions) not legal for sparse arrays in assignment A(I1,I2,...,IN) = B
fr_fr: indexation multidimensionnelle (plus de 2 dimensions) non légal pour matrices creuses en affectation A (I1, I2, ..., IN) = B

source: Matrix is sparse with %d nonzeros
fr_fr: La matrice est creuse avec %d nonzeros

source: Columns %d to %d
fr_fr: Colonnes %d à %d

source: ... Output truncated - use setprintlimit function to see more of the output ...
fr_fr: ... Sortie tronquée - Utiliser la fonction setprintlimit pour voir plus de la sortie ...

source: Expected a scalar.
fr_fr: Un scalaire attendu.

source: Expected a integer.
fr_fr: Un entier attendu

source: NaN and Inf not allowed.
fr_fr: NaN et Inf non autorisé.

source: Expected integer index.
fr_fr: Un index entier attendu.

source: Expected a real valued scalar.
fr_fr: Un scalaire à valeur réelle attendu.

source: Expected a real valued scalar
fr_fr: Un scalaire à valeur réelle attendu

source: Expected a function_handle.
fr_fr: Un function_handle attendu.

source: A cell expected.
fr_fr: Une cell attendu.

source: A cell of string expected.
fr_fr: Une cell de string attendue.

source: A vector expected.
fr_fr: Un vecteur attendu.

source: A row vector expected.
fr_fr: Un vecteur ligne attendu.

source: A column vector expected.
fr_fr: Un vecteur colonne attendu.

source: Number of field names must match number of values in structure constructor.
fr_fr: Nombre de noms de champs doit correspondre nombre de valeurs dans la structure constructeur.

source: sparse arrays not supported for struct constructor.
fr_fr: matrices creuses non pris en charge pour le constructeur struct.

source: Reference to non-existent field
fr_fr: Référence à un champ inexistant

source: Cannot apply A.field_name = B to non struct-array object A.
fr_fr: Vous ne pouvez pas appliquer A.field_name = B à un type A non struct.

source: setFieldAsList not supported for sparse arrays.
fr_fr: setFieldAsList non pris en charge pour les matrices creuses.

source: insertFieldName not supported for sparse arrays.
fr_fr: insertFieldName non pris en charge pour les matrices creuses.

source: Index exceeds dimensions.
fr_fr: L'index dépasse les dimensions.

source: Sparse Function not loaded.
fr_fr: Fonction Sparse non chargé.

source: input must be a valid class name.
fr_fr: l'entrée doit être un nom de classe valide.

source: Allowable stack depth exceeded...
fr_fr: Profondeur de la pile admissible dépassé ...

source: AST - syntax error!
fr_fr: AST - Erreur de syntaxe!

source: END keyword illegal!
fr_fr: Clé END illégal!

source: Unrecognized reserved node in expression tree!
fr_fr: Noeud inconnu réservé dans l'arbre d'expression!

source: Unrecognized expression!
fr_fr: Expression non reconnue!

source: Empty expression!
fr_fr: Expression vide!

source: Illegal use of the ':' keyword in indexing expression
fr_fr: L'utilisation illégale de la ':' mot-clé dans l'expression d'indexation

source: endfunction cannot used here.
fr_fr: endfunction ne peut pas utilisée ici.

source: Unrecognized statement type.
fr_fr: Expression non reconnue!

source: Need to Overload!
fr_fr: Besoin d'une surcharge!

source: Multiple rows not allowed in left hand side of multifunction expression
fr_fr: Plusieurs lignes non autorisés dans gauche d'expression multifonction

source: Parenthetical expression in the left hand side of a function call must resolve to a single element.
fr_fr: Expression entre parenthèses dans le côté gauche d'un appel de fonction doit se résoudre à un seul élément.

source: Cannot use arguments in a call to a script.
fr_fr: Vous ne pouvez pas utiliser des arguments dans un appel à un script.

source: Cannot assign outputs in a call to a script.
fr_fr: Vous ne pouvez pas assigner des sorties dans un appel à un script.

source: Illegal expression in function expression
fr_fr: Expression illégale dans l'expression de fonction

source: Must have lvalue in argument passed by reference
fr_fr: Doit avoir lvalue dans l'argument passé par référence

source: Invalid file id.
fr_fr: Identificateur de fichier non valide.

source: Wrong numbers of output arguments.
fr_fr: Nombre incorrect d'arguments de sortie.

source: Wrong number of input arguments.
fr_fr: Nombre incorrect d'arguments d'entrée.

source: Wrong type for argument #1: string expected.
fr_fr: Type incorrect pour l'argument #1: string attendu.

source: Wrong type for argument #2: string expected.
fr_fr: Type incorrect pour l'argument #1: string attendu.

source: Wrong type for argument #3: string expected.
fr_fr: Type incorrect pour l'argument #3: string attendu.

source: Wrong type for argument #%d: string expected.
fr_fr: Type incorrect pour l'argument #%d: string attendu.

source: Wrong type for argument #1: cell of strings expected.
fr_fr: Type incorrect pour l'argument #1: cell de string attendu.

source: Wrong type for argument #2: cell of strings expected.
fr_fr: Type incorrect pour l'argument #2: cell de string attendu.

source: Wrong type for argument #%d: cell of strings expected.
fr_fr: Type incorrect pour l'argument #%d: cell de string attendu.

source: Wrong type for argument #1: logical expected.
fr_fr: Type incorrect pour l'argument #1: logical attendu.

source: Wrong type for argument #2: logical expected.
fr_fr: Type incorrect pour l'argument #2: logical attendu.

source: Wrong type for argument #3: logical expected.
fr_fr: Type incorrect pour l'argument #3: logical attendu.

source: Wrong type for argument #1: sparse logical expected.
fr_fr: Type incorrect pour l'argument #1: matrice creuse de type logical attendu.

source: Wrong type for argument #2: sparse logical expected.
fr_fr: Type incorrect pour l'argument #2: matrice creuse de type logical attendu.

source: Wrong type for argument #1: double expected.
fr_fr: Type incorrect pour l'argument #1: double attendu.

source: Wrong type for argument #2: double expected.
fr_fr: Type incorrect pour l'argument #2: double attendu.

source: Wrong type for argument #3: double expected.
fr_fr: Type incorrect pour l'argument #3: double attendu.

source: Wrong type for argument #4: double expected.
fr_fr: Type incorrect pour l'argument #4: double attendu.

source: Wrong type for argument #5: double expected.
fr_fr: Type incorrect pour l'argument #5: double attendu.

source: Wrong type for argument #6: double expected.
fr_fr: Type incorrect pour l'argument #6: double attendu.

source: Wrong type for argument #%d: double expected.
fr_fr: Type incorrect pour l'argument #%d: double attendu.

source: Wrong type for argument #1: sparse double expected.
fr_fr: Type incorrect pour l'argument #1: matrice creuse de type double attendu.

source: Wrong type for argument #2: sparse double expected.
fr_fr: Type incorrect pour l'argument #1: matrice creuse de type double attendu.

source: Wrong type for argument #1: sparse expected.
fr_fr: Type incorrect pour l'argument #1: matrice creuse attendu.

source: Wrong type for argument #2: sparse expected.
fr_fr: Type incorrect pour l'argument #1: matrice creuse attendu.

source: Wrong type for argument #1: single expected.
fr_fr: Type incorrect pour l'argument #1: single attendu.

source: Wrong type for argument #2: single expected.
fr_fr: Type incorrect pour l'argument #1: single attendu.

source: Wrong type for argument #1. integer expected.
fr_fr: Type incorrect pour l'argument #1: entier attendu.

source: Wrong type for argument #2. integer expected.
fr_fr: Type incorrect pour l'argument #2: entier attendu.

source: Wrong size for argument #1. integer matrix expected.
fr_fr: Taille incorrect pour l'argument #1: matrice d'entier attendu.

source: Wrong size for argument #2. integer matrix expected.
fr_fr: Taille incorrect pour l'argument #2: matrice d'entier attendu.

source: Wrong size for argument #1. integer n-d matrix expected.
fr_fr: Taille incorrect pour l'argument #1: n-dimension matrice d'entier attendu.

source: Wrong size for argument #2. integer n-d matrix expected.
fr_fr: Taille incorrect pour l'argument #2: n-dimension matrice d'entier attendu.

source: Same integer type expected.
fr_fr: Même type d'entier attendu.

source: Wrong type for argument #1. int8 expected.
fr_fr: Type incorrect pour l'argument #1: int8 attendu.

source: Wrong type for argument #1. uint8 expected.
fr_fr: Type incorrect pour l'argument #1: uint8 attendu.

source: Wrong type for argument #1. int16 expected.
fr_fr: Type incorrect pour l'argument #1: in16 attendu.

source: Wrong type for argument #1. uint16 expected.
fr_fr: Type incorrect pour l'argument #1. uint16 attendu.

source: Wrong type for argument #1. int32 expected.
fr_fr: Type incorrect pour l'argument #1: int32 attendu.

source: Wrong type for argument #1. uint32 expected.
fr_fr: Type incorrect pour l'argument #1: uint32 attendu.

source: Wrong type for argument #1. int64 expected.
fr_fr: Type incorrect pour l'argument #1: int64 attendu.

source: Wrong type for argument #1. uint64 expected.
fr_fr: Type incorrect pour l'argument #1. uint64 attendu.

source: Wrong type for argument #1: function handle expected.
fr_fr: Type incorrect pour l'argument #1: function_handle attendu.

source: Wrong type for argument #%d: function handle expected.
fr_fr: Type incorrect pour l'argument #%d: function_handle attendu.

source: Wrong type for argument #1: string or function handle expected.
fr_fr: Type incorrect pour l'argument #1: string ou function_handle attendu.

source: Wrong type for argument #1: string or double expected.
fr_fr: Type incorrect pour l'argument #1: string ou double attendu.

source: Wrong type for argument #1: string or cell expected.
fr_fr: Type incorrect pour l'argument #1: string ou cell attendu.

source: Wrong type for argument #2: string or cell expected.
fr_fr: Type incorrect pour l'argument #2: string ou cell attendu.

source: Wrong type for #1 argument: numeric value expected.
fr_fr: Type incorrect pour l'argument #1: valeur numérique attendue.

source: Wrong type for argument #1. cell expected.
fr_fr: Type incorrect pour l'argument #1: cell attendu.

source: Wrong type for argument #2. cell expected.
fr_fr: Type incorrect pour l'argument #2. cell attendu

source: Wrong type for argument #1. struct expected.
fr_fr: Type incorrect pour l'argument #1: cell attendu.

source: Wrong type for argument #2. struct expected.
fr_fr: Type incorrect pour l'argument #1: struct attendu.

source: Wrong types for inputs arguments.
fr_fr: Types incorrect pour les arguments d'entrées.

source: Wrong type: #1 argument.
fr_fr: Mauvais type pour l'argument #1.

source: Wrong type: #2 argument.
fr_fr: Mauvais type pour l'argument #2.

source: Wrong type for input arguments: double expected.
fr_fr: Types incorrect pour les arguments d'entrées: double attendu.

source: Wrong type for input arguments: single expected.
fr_fr: Types incorrect pour les arguments d'entrées: single attendu.

source: logical expected.
fr_fr: logical attendu.

source: struct expected.
fr_fr: struct attendu.

source: cell of strings expected.
fr_fr: cellule de chaînes attendu.

source: type reserved.
fr_fr: type réservé.

source: Wrong size for input arguments: full matrix expected.
fr_fr: Taille incorrect pour les arguments d'entrées: matrice pleine attendu.

source: Wrong size for input arguments: 2D matrix expected.
fr_fr: Taille incorrect pour les arguments d'entrées: matrice 2D attendu.

source: Wrong size for argument #1: full matrix expected.
fr_fr: Taille incorrect pour l'argument #1: matrice pleine attendu.

source: Wrong size for argument #1: 2D matrix expected.
fr_fr: Taille incorrect pour l'argument #1: matrice 2D attendu.

source: Wrong size for argument #1: scalar expected.
fr_fr: Taille incorrect pour l'argument #1: scalaire attendu.

source: Wrong size for argument #2: scalar expected.
fr_fr: Taille incorrect pour l'argument #2: scalaire attendu.

source: Wrong size for argument #%d: scalar expected.
fr_fr: Taille incorrect pour l'argument #%d: scalaire attendu.

source: Wrong size for #1 argument. a scalar or a row vector expected.
fr_fr: Taille incorrect pour l'argument #1: scalaire ou vecteur ligne attendu.

source: Wrong size for #1 argument. [a, b] expected.
fr_fr: Taille incorrect pour l'argument #1: [a, b] attendu.

source: Wrong size for #2 argument. [a, b] expected.
fr_fr: Taille incorrect pour l'argument #2: [a, b] attendu.

source: Wrong size for #1 argument. row vector expected.
fr_fr: Taille incorrect pour l'argument #1: vecteur ligne attendu.

source: Wrong size for #2 argument. row vector expected.
fr_fr: Taille incorrect pour l'argument #2: vecteur ligne attendu.

source: Same size expected.
fr_fr: Même taille attendue.

source: A scalar expected.
fr_fr: Un scalaire attendu.

source: Wrong value for #1 argument.
fr_fr: Mauvaise valeur pour l'argument #1.

source: Wrong value for #2 argument.
fr_fr: Mauvaise valeur pour l'argument #2.

source: Wrong value for #%d argument.
fr_fr: Mauvaise valeur pour l'argument #%d.

source: Wrong value for argument #1. Scalar integer value expected.
fr_fr: Mauvaise valeur pour l'argument #1: scalaire entier attendu.

source: Wrong value for argument #2. Scalar integer value expected.
fr_fr: Mauvaise valeur pour l'argument #2: scalaire entier attendu.

source: Wrong value for argument #%d. Scalar integer value expected.
fr_fr: Mauvaise valeur pour l'argument #%d: scalaire entier attendu.

source: Wrong value for argument #1. A finite scalar integer value expected.
fr_fr: Mauvaise valeur pour l'argument #1: Une valeur finie scalaire entier attendu.

source: Wrong value for argument #2. A finite scalar integer value expected.
fr_fr: Mauvaise valeur pour l'argument #2: Une valeur finie scalaire entier attendu.

source: Wrong value for argument #%d. A finite scalar integer value expected.
fr_fr: Mauvaise valeur pour l'argument #%d: Une valeur finie scalaire entier attendu.

source: Wrong value for argument #1. A finite vector of integer values expected.
fr_fr: Mauvaise valeur pour l'argument #1: Un vecteur de valeurs finie entiere attendu.

source: Wrong value for #1 :Invalid size.
fr_fr: Mauvaise valeur pour #1: taille non valide.

source: Wrong value for #2 :Invalid size.
fr_fr: Mauvaise valeur pour #2: taille non valide.

source: Wrong value for #%d :Invalid size.
fr_fr: Mauvaise valeur pour #%d : taille non valide.

source: Wrong value for #1 argument. positive value expected.
fr_fr: Mauvaise valeur pour l'argument #1: Une valeur positive attendu.

source: Wrong value for #2 argument. positive value expected.
fr_fr: Mauvaise valeur pour l'argument #2: Une valeur positive attendu.

source: Wrong value for #%d argument. positive value expected.
fr_fr: Mauvaise valeur pour l'argument #%d: Une valeur positive attendu.

source: Wrong value for #1 argument. a must be higher than b ([a,b]).
fr_fr: Mauvaise valeur pour l'argument #1: a doit être supérieure à b ([a, b]).

source: Wrong value for #2 argument. a must be higher than b ([a,b]).
fr_fr: Mauvaise valeur pour l'argument #2: a doit être supérieure à b ([a, b]).

source: Interrupt (ctrl-c) encountered.
fr_fr: Interruption (ctrl-c) rencontrée.

source: Warning! one or more outputs not assigned in call.
fr_fr: Attention ! une ou plusieurs sorties ne pas assignés dans l'appel.

source: Dimensions concatenated are not consistent.
fr_fr: Dimensions concaténées ne concordent pas.

source: Fieldnames in structs must match.
fr_fr: Noms des champs dans les structs doivent correspondre.

source: For bugs and requests, please <a href="mailto:nelson.numerical.computation@gmail.com">email me</a>.
fr_fr: Pour les bugs et les demandes, Merci de m'écrire <a href="mailto:nelson.numerical.computation@gmail.com">en cliquant ici</a>.

source: For bugs and requests, please mailto: nelson.numerical.computation@gmail.com
fr_fr: Pour les bugs et les demandes, s'il vous plaît, écrivez-moi : nelson.numerical.computation@gmail.com

source: Wrong number of input arguments2.
fr_fr: Nombre incorrect d'arguments d'entrée.

source: Update translations:
fr_fr: Traductions mise à jour:

source: Translations up-to-date:
fr_fr: Traductions à jour:

source: update .po for:
fr_fr: Mise à jour des .po pour:

source: minargs must be a numeric scalar
fr_fr: Minargs doit être une valeur scalaire numérique

source: maxargs must be a numeric scalar
fr_fr: Maxargs doit être une valeur scalaire numérique

source: minargs cannot be larger than maxargs
fr_fr: MINARGS ne peuvent pas être plus grand que maxargs

source: not enough input arguments
fr_fr: pas assez d'entrée arguments

source: too many input arguments
fr_fr: trop d'arguments d'entrée

source: vertcat does not support cell-struct.
fr_fr: vertcat ne supporte pas les cells ou les structs.

source: Wrong numbers of input arguments.
fr_fr: Nombre incorrect d'arguments d'entrée.

source: Invalid Input(s) must be strings or cell arrays.
fr_fr: Entrée(s) non valide, doit être des chaînes ou des cellules.

source: A string expected.
fr_fr: Une chaîne attendue.

source: A filename expected.
fr_fr: Un nom de fichier attendu.

source: Cannot open file.
fr_fr: Impossible d'ouvrir le fichier.

source: file format not a supported file.
fr_fr: Le format de fichier n'est pas pris en charge.

source: version not a supported file.
fr_fr: Version non prise en charge.

source: Wrong type for argument #1. string expected.
fr_fr: Type incorrect pour l'argument #1. string attendu.

source: not yet implemented.
fr_fr: Pas encore implémenté.

source: Impossible to open:
fr_fr: Impossible d'ouvrir:

source: option not managed.
fr_fr: option non gérée.

source: Time:
fr_fr: Temps écoulé:
